{
  "Tech": {
    "summary": "## Executive Summary\nThe Indian government has blocked access to Supabase, a popular developer database platform, under Section 69A of India's Information Technology Act. A legendary weather app has made a comeback, but details about the app are not provided. Google has unveiled a plan to secure HTTPS certificates against quantum computer attacks by using Merkle Trees to reduce the size of cryptographic data. Additionally, there are concerns about the trustworthiness of AI agents and the need for architecture that assumes they will misbehave.\n\n## Market & Business Implications\n* The Indian government's blocking order has resulted in patchy access to Supabase across networks in India, affecting its users and potentially impacting the company's business in the country (Article 1).\n* Google's plan to secure HTTPS certificates against quantum computer attacks involves using Merkle Trees to reduce the size of cryptographic data, which is roughly 40 times bigger than classical cryptographic material (Article 4).\n* The use of AI agents in business and technology requires an architecture that assumes they will misbehave and contains the damage when they do, rather than relying on application-level checks (Article 3).\n\n## Beginner-Friendly Summary\nThe Indian government has blocked a website that helps developers build things. A old weather app is back, but we don't know much about it. Google is working on a way to keep the internet safe from special kinds of computer attacks. Some people are also talking about how to use artificial intelligence in a way that is safe and secure.",
    "articles": [
      {
        "title": "India disrupts access to popular developer platform Supabase with blocking order",
        "link": "https://techcrunch.com/2026/02/27/india-disrupts-access-to-popular-developer-platform-supabase-with-blocking-order/",
        "published": "Sat, 28 Feb 2026 03:51:52 +0000",
        "source": "TechCrunch",
        "text": "Supabase, a popular developer database platform, is facing disruptions in India — one of its key markets — has been blocked in India, TechCrunch has learned. New Delhi ordered internet providers to block its website, resulting in patchy access across networks.\n\nThe blocking order was issued on February 24 under Section 69A of India’s Information Technology Act, according to a source familiar with the matter. The provision empowers the government to restrict public access to online content.\n\nThe Indian government did not publicly cite a reason for the move, and it was not immediately clear whether the action was linked to a cybersecurity concern, copyright complaint, or another issue. It was also unclear how long the restrictions would remain in place.\n\nAccess to Supabase has been inconsistent in India over the past several days, with the San Francisco-based company acknowledging the issue in posts on social media starting Wednesday. While the restrictions were first reported by Supabase on Reliance Industries’ JioFiber network, users have since flagged similar problems across multiple internet providers and telecom networks. In one post on Friday, Supabase tagged India’s IT minister Ashwini Vaishnaw, asking him to intervene and restore access, though the company later removed the message and said in a subsequent update that the site remained blocked for many users in the country.\n\nWe understand many users in India continue to be blocked from accessing Supabase. We acknowledge the difficulties this is causing for our users there. Supabase continues to follow up through all available channels to resolve this issue.\n\n\n\nWe continue to advise affected customers… — Supabase (@supabase) February 27, 2026\n\nAn Indian founder, who asked not to be named to avoid potential repercussions, told TechCrunch they had stopped seeing new user sign-ups from India over the past two to three days. A technology consultant working with local startups, who spoke on condition of anonymity, s"
      },
      {
        "title": "A legendary weather app makes a comeback",
        "link": "https://www.theverge.com/tech/886462/acme-weather-samsung-s26-installer",
        "published": "2026-02-28T08:00:00-05:00",
        "source": "The Verge",
        "text": "is editor-at-large and Vergecast co-host with over a decade of experience covering consumer tech. Previously, at Protocol, The Wall Street Journal, and Wired.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nHi, friends! Welcome to Installer No. 117, your guide to the best and Verge-iest stuff in the world. (If you’re new here, welcome, please send Android tips, and also you can read all the old editions at the Installer homepage.)\n\nI also have for you the first big phone launch of the year, a new-old weather app, a way to maybe make your YouTube a little cheaper, a bunch of stuff to watch this weekend, and much more. Missed you last week! Let’s get back at it.\n\n(As always, the best part of Installer is your ideas and tips. What are you reading / watching / playing / listening to / turning up to 11 this week? Tell me everything: installer@theverge.com. And if you know someone else who might enjoy Installer, forward it to them and tell them to subscribe here.)\n\nThe Drop\n\nScreen share\n\nMeredith Haggerty is one of those people you meet and you’re immediately like, Oh, you’re much cooler than I am. The more I get to know Meredith, a new(ish) editor here at The Verge, the more I realize how correct my first assumption was. Meredith has written about fashion and culture and brands and TV shows and also recently made a Pride and Prejudice joke that made me laugh so hard I spilled coffee all over my keyboard. Technically, Meredith owes me a keyboard.\n\nI asked Meredith to share her homescreen with us, both because I think it’s a fun way to get to know new people here and because I want her to tell me about cool things but I don’t want to just constantly badger her for TV recs. Here’s her homescreen, plus some info on the apps she uses and why:\n\nThe phone: An iPhone 17. Until very recently, I was clinging to an iPhone 12 mini that I’d gotten as a hand-me-down corporate gift from a friend; it was so tiny and good and I had the perfect p"
      },
      {
        "title": "Don't trust AI agents",
        "link": "https://nanoclaw.dev/blog/nanoclaw-security-model",
        "published": "Sat, 28 Feb 2026 12:39:32 +0000",
        "source": "Hacker News: Front Page",
        "text": "When you’re building with AI agents, they should be treated as untrusted and potentially malicious. Whether you’re worried about prompt injection, a model trying to escape its sandbox, or something nobody’s thought of yet, regardless of what your threat model is, you shouldn’t be trusting the agent. The right approach isn’t better permission checks or smarter allowlists. It’s architecture that assumes agents will misbehave and contains the damage when they do.\n\nThat’s the principle I built NanoClaw on.\n\nDon’t trust the process\n\nOpenClaw runs directly on the host machine by default. It has an opt-in Docker sandbox mode, but it’s turned off out of the box, and most users never turn it on. Without it, security relies entirely on application-level checks: allowlists, confirmation prompts, a set of “safe” commands. These checks come from a place of implicit trust that the agent isn’t going to try to do something wrong. Once you adopt the mindset that an agent is potentially malicious, it’s obvious that application-level blocks aren’t enough. They don’t provide hermetic security. A determined or compromised agent can find ways around them.\n\nIn NanoClaw, container isolation is a core part of the architecture. Each agent runs in its own container, on Docker or an Apple Container on macOS. Containers are ephemeral, created fresh per invocation and destroyed afterward. The agent runs as an unprivileged user and can only see directories that have been explicitly mounted in. A container boundary is enforced by the OS.\n\nDon’t trust other agents\n\nEven when OpenClaw’s sandbox is enabled, all agents share the same container. You might have one agent as a personal assistant and another for work, in different WhatsApp groups or Telegram channels. They’re all in the same environment, which means information can leak between agents that are supposed to be accessing different data.\n\nAgents shouldn’t trust each other any more than you trust them. In NanoClaw, each agent gets its own cont"
      },
      {
        "title": "Google quantum-proofs HTTPS by squeezing 2.5kB of data into 64-byte space",
        "link": "https://arstechnica.com/security/2026/02/google-is-using-clever-math-to-quantum-proof-https-certificates/",
        "published": "Sat, 28 Feb 2026 01:26:41 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Google on Friday unveiled its plan for its Chrome browser to secure HTTPS certificates against quantum computer attacks without breaking the Internet.\n\nThe objective is a tall order. The quantum-resistant cryptographic data needed to transparently publish TLS certificates is roughly 40 times bigger than the classical cryptographic material used today. Today’s X.509 certificates are about 64 bytes in size, and comprise six elliptic curve signatures and two EC public keys. This material can be cracked through the quantum-enabled Shor’s algorithm. Certificates containing the equivalent quantum-resistant cryptographic material are roughly 2.5 kilobytes. All this data must be transmitted when a browser connects to a site.\n\nThe bigger they come, the slower they move\n\n“The bigger you make the certificate, the slower the handshake and the more people you leave behind,” said Bas Westerbaan, principal research engineer at Cloudflare, which is partnering with Google on the transition. “Our problem is we don’t want to leave people behind in this transition.” Speaking to Ars, he said that people will likely disable the new encryption if it slows their browsing. He added that the massive size increase can also degrade “middle boxes,” which sit between browsers and the final site.\n\nTo bypass the bottleneck, companies are turning to Merkle Trees, a data structure that uses cryptographic hashes and other math to verify the contents of large amounts of information using a small fraction of material used in more traditional verification processes in public key infrastructure.\n\nMerkle Tree Certificates, “replace the heavy, serialized chain of signatures found in traditional PKI with compact Merkle Tree proofs,” members of Google’s Chrome Secure Web and Networking Team wrote Friday. “In this model, a Certification Authority (CA) signs a single ‘Tree Head’ representing potentially millions of certificates, and the ‘certificate’ sent to the browser is merely a lightweight proof of inclusi"
      },
      {
        "title": "14 Best Travel Toiletry Bags, Tested Over Many Miles (2026)",
        "link": "https://www.wired.com/gallery/best-toiletry-bags/",
        "published": "Sat, 28 Feb 2026 12:30:00 +0000",
        "source": "WIRED",
        "text": "Others We Tested\n\nThere were multiple great bags we tried whose features or designs just didn't add up to a place in the top spots above. However, everyone has something different they're looking for in a toiletry bag, so while not perfect for us, some of these options may still be perfect for you.\n\nPhotograph: Kat Merck\n\nPatricks BB1 Bathroom Bag for $189: This crush-resistant, shock-absorbing rectangular bag is basically a heavier-duty, unisex version of the Flat Lay, below, except it costs four times as much. I tested it in the Triple Black colorway, which is “strictly limited to 1,000 pieces globally.” This one’s got two interior flaps with a slim, shallow zippered pouch on either side, but otherwise is just one big compartment that led to too much clinking and clanking of contents during my test. It’s great for full-sized products, but my testers and I all preferred bags that hold the products securely upright, as in the less expensive Parallelle Kit, above.\n\nFlat Lay Makeup Box Bag for $37: Available in opaque-fabric and clear (\"jelly\") styles, this unassuming pouch looks like a chubby rectangle with a handle on the end but actually unzips into a flat tray for easy access. There's only one compartment, so I didn't love it as a toiletry bag, but I did love it as a pool and beach accessory bag for sunscreen and makeup.\n\nMonos Metro Toiletry Case for $95: This durable, structured case, available in either nylon or vegan leather, exhibits the class and quality construction Monos is known for. It has one main roomy compartment with three small pockets inside; one zippered. It did a great job of protecting its contents while still being squishable enough to fit in a tightly packed carry-on, though I did find myself wishing it had a handle for carrying.\n\nCalpak Clear Cosmetics Case for $85: Constructed largely of water-resistant, wipe-clean PVC, this clear cosmetic case (I tested the Medium size) zips all the way around and folds flat to reveal two zippered compartme"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nThe US government has instructed federal agencies to cease use of Anthropic's AI tools due to a dispute over the company's refusal to allow its AI models to be used for mass domestic surveillance or fully autonomous weapons. Secretary of Defense Pete Hegseth has designated Anthropic as a \"supply-chain risk\" to national security, effective immediately. This designation restricts contractors, suppliers, and partners of the US military from conducting commercial activities with Anthropic. The company has stated it will challenge this designation in court. The move follows a public dispute between Anthropic and the Department of Defense.\n\n## Market & Business Implications\n* The Pentagon has directed the Department of War to designate Anthropic a \"Supply-Chain Risk to National Security\", effective immediately, as stated by Secretary of Defense Pete Hegseth in a social media post (Article 1).\n* Anthropic's CEO, Dario Amodei, has reiterated the company's stance on not allowing its AI models to be used for mass domestic surveillance or fully autonomous weapons, as mentioned in a public post (Article 1).\n* The designation of Anthropic as a supply-chain risk allows the Pentagon to restrict or exclude certain vendors from defense contracts if they're deemed to pose security vulnerabilities, as explained in Article 2.\n* Elon Musk has attacked OpenAI's safety record in a deposition, claiming that his company, xAI, better prioritizes safety, as reported in Article 4.\n* The US President has announced a six-month phase-out period for federal agencies using Anthropic's AI tools, as stated in Article 5.\n\n## Beginner-Friendly Summary\nThe US government is stopping its use of a company called Anthropic's AI tools. This is because Anthropic does not want its tools to be used for certain things, like watching people without their knowledge or making weapons that can work on their own. The government is also saying that companies that work with the military cannot work with Anthropic. Anthropic is going to challenge this decision in court. The government and Anthropic have been disagreeing about this for a while.",
    "articles": [
      {
        "title": "Pentagon moves to designate Anthropic as a supply-chain risk",
        "link": "https://techcrunch.com/2026/02/27/pentagon-moves-to-designate-anthropic-as-a-supply-chain-risk/",
        "published": "Fri, 27 Feb 2026 21:53:14 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "In a post on Truth Social, President Trump directed federal agencies to cease use of all Anthropic products after the company’s public dispute with the Department of Defense. The president allowed for a six-month phase-out period for departments using the products, but emphasized that Anthropic was no longer welcome as a federal contractor.\n\n“We don’t need it, we don’t want it, and will not do business with them again,” the president wrote in the post.\n\nNotably, the president’s post did not mention any plans to designate Anthropic as a supply chain risk, as had been previously mentioned as a consequence. However, a subsequent tweet from Secretary of Defense Pete Hegseth made good on the threat.\n\n“In conjunction with the President’s directive for the Federal Government to cease all use of Anthropic’s technology, I am directing the Department of War to designate Anthropic a Supply-Chain Risk to National Security,” Secretary Hegseth wrote. “Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic.”\n\nThe Pentagon dispute centered on Anthropic’s refusal to allow its AI models to be used to power either mass domestic surveillance or fully autonomous weapons, which Secretary Hegseth found unduly restrictive.\n\nCEO Dario Amodei reiterated his stance in a public post on Thursday, refusing to compromise on the two points.\n\n“Our strong preference is to continue to serve the Department and our warfighters — with our two requested safeguards in place,” Amodei wrote at the time. “Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider, avoiding any disruption to ongoing military planning, operations, or other critical missions.”\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, an"
      },
      {
        "title": "Anthropic Hits Back After US Military Labels It a ‘Supply Chain Risk’",
        "link": "https://www.wired.com/story/anthropic-supply-chain-risk-shockwaves-silicon-valley/",
        "published": "Sat, 28 Feb 2026 03:30:41 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "US secretary of defense Pete Hegseth directed the Pentagon to designate Anthropic a “supply-chain risk” on Friday, sending shock waves through Silicon Valley and leaving many companies scrambling to understand whether they can keep using one of the industry’s most popular AI models.\n\n“Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,” Hegseth wrote in a social media post.\n\nThe designation comes after weeks of tense negotiations between the Pentagon and Anthropic over how the US military could use the startup’s AI models. In a blog post this week, Anthropic argued its contracts with the Pentagon should not allow for its technology to be used for mass domestic surveillance of Americans or fully autonomous weapons. The Pentagon asked that Anthropic agree to let the US military apply its AI to “all lawful uses” with no specific exceptions.\n\nA supply-chain-risk designation allows the Pentagon to restrict or exclude certain vendors from defense contracts if they’re deemed to pose security vulnerabilities, such as risks related to foreign ownership, control, or influence. It is intended to protect sensitive military systems and data from potential compromise.\n\nAnthropic responded in another blog post on Friday evening, saying it would “challenge any supply chain risk designation in court,” and that such a designation would “set a dangerous precedent for any American company that negotiates with the government.”\n\nAnthropic added that it hadn’t received any direct communication from the Department of Defense or the White House regarding negotiations over the use of its AI models.\n\n“Secretary Hegseth has implied this designation would restrict anyone who does business with the military from doing business with Anthropic. The Secretary does not have the statutory authority to back up this statement,” the company wrote.\n\nThe Pentagon declined to comment.\n\n“This is the"
      },
      {
        "title": "Defense secretary Pete Hegseth designates Anthropic a supply chain risk",
        "link": "https://www.theverge.com/policy/886632/pentagon-designates-anthropic-supply-chain-risk-ai-standoff",
        "published": "2026-02-27T21:19:16-05:00",
        "source": "AI | The Verge",
        "text": "This week, Anthropic delivered a master class in arrogance and betrayal as well as a textbook case of how not to do business with the United States Government or the Pentagon.\n\nOur position has never wavered and will never waver: the Department of War must have full, unrestricted access to Anthropic’s models for every LAWFUL purpose in defense of the Republic.\n\nInstead, @AnthropicAI and its CEO @DarioAmodei, have chosen duplicity. Cloaked in the sanctimonious rhetoric of “effective altruism,” they have attempted to strong-arm the United States military into submission - a cowardly act of corporate virtue-signaling that places Silicon Valley ideology above American lives.\n\nThe Terms of Service of Anthropic’s defective altruism will never outweigh the safety, the readiness, or the lives of American troops on the battlefield.\n\nTheir true objective is unmistakable: to seize veto power over the operational decisions of the United States military. That is unacceptable.\n\nAs President Trump stated on Truth Social, the Commander-in-Chief and the American people alone will determine the destiny of our armed forces, not unelected tech executives.\n\nAnthropic’s stance is fundamentally incompatible with American principles. Their relationship with the United States Armed Forces and the Federal Government has therefore been permanently altered.\n\nIn conjunction with the President’s directive for the Federal Government to cease all use of Anthropic’s technology, I am directing the Department of War to designate Anthropic a Supply-Chain Risk to National Security. Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic. Anthropic will continue to provide the Department of War its services for a period of no more than six months to allow for a seamless transition to a better and more patriotic service.\n\nAmerica’s warfighters will never be held hostage by the ideological whims of Big"
      },
      {
        "title": "Musk bashes OpenAI in deposition, saying ‘nobody committed suicide because of Grok’",
        "link": "https://techcrunch.com/2026/02/27/musk-bashes-openai-in-deposition-saying-nobody-committed-suicide-because-of-grok/",
        "published": "Fri, 27 Feb 2026 19:42:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "In a newly released deposition filed in Elon Musk’s case against OpenAI, the tech executive attacked OpenAI’s safety record, claiming that his company, xAI, better prioritizes safety. He went so far as to say that “Nobody has committed suicide because of Grok, but apparently they have because of ChatGPT.”\n\nThe comment came up in a line of questioning about a public letter Musk signed in March 2023. In it, he called on AI labs to pause development of AI systems more powerful than GPT-4, OpenAI’s flagship model at the time, for at least six months. The letter, which was signed by over 1,100 people, including many AI experts, stated there was not enough planning and management taking place at AI labs, as they were locked in an “out-of-control race to develop and deploy ever more powerful digital minds that no one — not even their creators — can understand, predict, or reliably control.”\n\nThose fears have since gained credibility. OpenAI now faces a series of lawsuits alleging that ChatGPT’s manipulative conversation tactics have led several people to experience negative mental health effects, with some dying by suicide. Musk’s comment suggests that these incidents could be used as fodder in his case against OpenAI.\n\nThe transcript of Musk’s video testimony, which took place back in September, was filed publicly this week, ahead of the expected jury trial next month.\n\nThe lawsuit against OpenAI centers on the company’s shift from a nonprofit AI research lab to a for-profit company, which Musk claims violated its founding agreements. As part of his arguments, Musk claims that AI safety could be compromised by OpenAI’s commercial relationships, as such relationships would place speed, scale, and revenue above safety concerns.\n\nHowever, since that recording, xAI has faced safety concerns of its own. Last month, Musk’s social network X was flooded with nonconsensual nude images generated by xAI’s Grok, some of which were said to be of minors. This led the California Attorne"
      },
      {
        "title": "Trump Moves to Ban Anthropic From the US Government",
        "link": "https://www.wired.com/story/trump-moves-to-ban-anthropic-from-the-us-government/",
        "published": "Fri, 27 Feb 2026 21:36:31 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "US President Donald Trump announced Friday that he was instructing every federal agency to “immediately cease” use of Anthropic’s AI tools. The move comes after Anthropic and top officials clashed for weeks over military applications of artificial intelligence.\n\n\"The Leftwing nut jobs at Anthropic have made a DISASTROUS MISTAKE trying to STRONG-ARM the Department of War,” Trump said in a post on Truth Social.\n\nTrump said that there would be a “six month phase out period” for agencies using Anthropic, which could allow time for further negotiations between the government and the AI startup.\n\nThe Pentagon and Anthropic did not immediately respond to requests for comment.\n\nShortly after the President’s announcement, defense secretary Pete Hegseth said that Anthropic would also be designated a “supply chain risk,” a move normally reserved for foreign businesses considered a danger to American national security. The designation will bar the US military and its contractors and suppliers from working with the AI company.\n\nHegseth also lashed out at Anthropic and its CEO, Dario Amodei, over the company's refusal to agree to its demands. “Cloaked in the sanctimonious rhetoric of ‘effective altruism,' they have attempted to strong-arm the United States military into submission—a cowardly act of corporate virtue-signaling that places Silicon Valley ideology above American lives,” Hegseth wrote on X.\n\nThe Department of Defense has sought to change the terms of a deal struck with Anthropic and other companies last July to eliminate restrictions on how AI can be deployed and instead permit “all lawful use” of the technology. Anthropic objected to the change, claiming that it could allow AI to be used to fully control lethal autonomous weapons or to conduct mass surveillance on US citizens.\n\nThe Pentagon does not currently use AI in these ways, and has said it has no plans to do so. However, top Trump administration officials have voiced opposition to the idea of a civilian tech c"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nWarren Buffett's successor, Greg Abel, has published his first letter to Berkshire Hathaway shareholders, marking a new era for the company. Berkshire Hathaway reported a $4.5 billion write-down on its Kraft Heinz and Occidental Petroleum stakes. Meanwhile, the US has launched a massive attack on Iran, prompting retaliation and affecting multiple countries in the Middle East. In other news, Kevin O'Leary warned Gen Z job applicants against bringing their parents to interviews, and Sana Biotechnology, Inc. is making progress in its efforts to cure type 1 diabetes.\n\n## Market & Business Implications\n* Berkshire Hathaway took a $4.5 billion write-down on the value of its Kraft Heinz and Occidental Petroleum stakes, as announced in Greg Abel's first letter to shareholders (Article 1).\n* The US has launched a major attack on Iran, resulting in explosions and counterattacks in the Middle East, with several countries condemning Iran's actions (Article 2).\n* Kevin O'Leary stated that bringing a parent to a job interview is a \"horrific signal\" and could lead to a resume being rejected (Article 3).\n* Sana Biotechnology, Inc. is developing a gene-edited, hypoimmune cell therapy to cure type 1 diabetes, with recent developments showing promising results (Article 4).\n* Berkshire Hathaway's operating earnings fell nearly 30% in the fourth quarter, largely due to weakness in the conglomerate's insurance business (Article 5).\n\n## Beginner-Friendly Summary\nThere's a new leader at a big company called Berkshire Hathaway. The company had to write down the value of some of its investments, which means it doesn't think they're worth as much as it thought. The US is also involved in a big conflict with Iran, which is affecting many countries. Some people are talking about how young job applicants should behave in interviews. Additionally, a company called Sana Biotechnology is working on a cure for a disease called type 1 diabetes.",
    "articles": [
      {
        "title": "Warren Buffett's successor Greg Abel publishes his first letter to Berkshire Hathaway shareholders",
        "link": "https://finance.yahoo.com/news/warren-buffetts-successor-greg-abel-131701152.html",
        "published": "2026-02-28T13:17:01Z",
        "source": "Yahoo Finance",
        "text": "OMAHA, Neb. (AP) — Warren Buffett’s successor released his first letter to Berkshire Hathaway shareholders on Saturday as the company took a $4.5 billion write-down on the value of its Kraft Heinz and Occidental Petroleum stakes.\n\nGreg Abel took over as CEO in January, so this is his chance to set the tone for his leadership. Investors are watching closely for any changes he might make, but Abel and Buffett have said there won't be significant changes in the way Berkshire operates.\n\nThe letter opens with a tribute to Buffett and a promise to maintain Berkshire's culture that's based on trust and integrity and continue operating the same way that has worked so well for six decades.\n\n“I am honored by our board’s decision to appoint me CEO of Berkshire and humbled to succeed Warren as I write my first annual letter to you. Warren is obviously a very hard act to follow,” Abel said as he laid out his background and approach.\n\nAnd Buffett remains chairman and the largest shareholder, so he's still helping guide the Omaha, Nebraska-based conglomerate he built. But Abel is now writing the annual letters that were always known as one of the most-read business reports out there because so many investors admired and followed Buffett because of his remarkable track record and homespun wit and advice.\n\nAbel announced a few changes to the lineup for the shareholder meeting in May. The first question-and-answer period will feature Abel alongside Berkshire's Vice Chairman for insurance, Ajit Jain. Then a second panel will have Abel answering questions with BNSF CEO Katie Farmer and NetJets CEO Adam Johnson, who now helps oversee all of Berkshire's consumer, service and retail businesses.\n\nThe only initial changes so far are some administrative moves Abel made as he took over, and a filing in January suggesting Berkshire is considering sell off some or all of its 325 million Kraft Heinz shares. But Buffett may have supported that move because he had made comments about how Berkshire"
      },
      {
        "title": "U.S.-Israel launch massive attack on Iran; 4 U.S. military bases hit in retaliation",
        "link": "https://www.cnbc.com/2026/02/28/trump-us-military-iran-strikes-middle-east-oil.html",
        "published": "Sat, 28 Feb 2026 13:15:27 GMT",
        "source": "US Top News and Analysis",
        "text": "The U.S. military has begun \"major combat operations\" in Iran, U.S. President Donald Trump confirmed on Saturday, as explosions were heard in cities around the Middle East.\n\n\"Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people,\" Trump said in a video message on his Truth Social account.\n\nA U.S. official confirmed earlier that American forces attacked Iran by air and sea, Reuters reported. It also cited an unidentified Iranian official as saying that several ministries in the southern part of the Iranian capital, Tehran, were targeted\n\nExplosions were heard in key cities around the Middle East, including Jerusalem as Iran launched counterattacks.\n\nCNBC producer Joan Muwahed in Dubai reported hearing two explosions over the city in the United Arab Emirates.\n\nQatar and the UAE condemned Iranian missile counterattacks.\n\n\"The State of Qatar expresses its strong condemnation of the targeting of Qatari territory with Iranian ballistic missiles, considering it a flagrant violation of its national sovereignty,\" Qatar's Ministry of Defense said in a statement.\n\nIn the UAE, \"the Ministry of Defense announced that the country was subjected today to a blatant attack by Iranian ballistic missiles, which was dealt with by the UAE air defenses with high efficiency and a number of missiles were successfully intercepted.\"\n\nTrump said Iran has continued to pursue nuclear weapons despite ongoing negotiations to end its program.\n\n\"[In] operation midnight hammer last June, we obliterated the regime's nuclear program at Fordow nets. And Isfahan. After that attack, we warned them never to resume their malicious pursuit of nuclear weapons, and we sought repeatedly to make a deal,\" Trump said. \"But Iran refused.\"\n\n\"Instead, they attempted to rebuild their nuclear program and to continue developing the long range missiles that can now threaten our very good friends and allies in Europe, our troop"
      },
      {
        "title": "Kevin O'Leary warns Gen Z: Bring your parents to an interview, resume goes 'right into the garbage'",
        "link": "https://www.foxbusiness.com/media/kevin-oleary-warns-gen-z-bring-your-parents-interview-resume-goes-right-garbage",
        "published": "Sat, 28 Feb 2026 07:00:29 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "A growing number of hiring managers say that they are seeing a surprising new trend from Gen Z applicants: bringing a parent into the job interview process, sometimes even onto Zoom calls.\n\n\"Shark Tank\" star Kevin O'Leary joined FOX Business' Stuart Varney on 'Varney & Co.' to weigh in on the practice and what it signals to employers.\n\nFor O'Leary, the issue isn't generational stereotypes, it's about independence. In today's competitive labor market, he argues, employers are looking for candidates who can think, decide and execute on their own. When a parent enters the room, he says, that independence immediately comes into question.\n\n\"First question I'd have to the son or daughter, I'd say, do you want me to hire your mother or you? What's she doing here?\" O'Leary said, \"That resume goes right into the garbage in one of my operations.\"\n\nHe said the situation recently happened to him during a virtual interview.\n\n\"It happened to me on a Zoom call, and I just said, this isn't going to work... Your mom is not gonna be part of this discussion,\" he said.\n\nLARRY KUDLOW: WHY ARE GEN Z-ERS SO DOUR, DEPRESSED, AND UNEMPLOYED?\n\nBeyond optics, O'Leary views the move as a warning sign for employers evaluating risk.\n\n\"It means you can't do this on your own... It's a horrific signal,\" O'Leary said, calling it \"a really, really bad idea.\""
      },
      {
        "title": "Sana Biotechnology, Inc. (SANA): A Bull Case Theory",
        "link": "https://finance.yahoo.com/news/sana-biotechnology-inc-sana-bull-130944518.html",
        "published": "2026-02-28T13:09:44Z",
        "source": "Yahoo Finance",
        "text": "We came across a bullish thesis on Sana Biotechnology, Inc. on Stock Invader’s Substack. In this article, we will summarize the bulls’ thesis on SANA. Sana Biotechnology, Inc.'s share was trading at $4.00 as of February 9th.\n\nWhy Impact Biomedical Inc. (IBO) Surged On Thursday?\n\nElena Pavlovich/Shutterstock.com\n\nSana Biotechnology, Inc., a biotechnology company, focuses on utilizing engineered cells as medicines in the United States. SANA has emerged as a compelling player in the race to cure type 1 diabetes (T1D) with its gene-edited, hypoimmune cell therapy, SC451. Recent developments showed a patient remaining insulin-free for an entire year following a donor-cell transplant—a result never seen before and without reported side effects—validating the underlying technology and capturing headlines.\n\nSANA’s approach, using CD47+ “invisibility” to protect transplanted cells from the immune system, represents a significant technological advantage over competitors like Vertex Pharmaceuticals (VRTX) and Sernova, whose therapies rely on conventional donor cells and chronic immunosuppression. While Vertex leads in trial progression, SANA’s innovation and potential scalability through stem-cell-derived islets could allow for unlimited production, expanding eligibility to all T1D patients and creating a platform with applications beyond diabetes.\n\nSANA is now preparing to file its Investigational New Drug (IND) application for SC451, transitioning from proof-of-concept to a practical solution. The company has strategically managed its resources, redirecting funds from a canceled factory plan to advance trials, and has raised sufficient capital to sustain operations into late 2026. Successful stem-cell trials could transform SANA from a speculative “moonshot” into a high-impact biotech platform, while its proprietary technology may attract acquisition interest from major players like Novo Nordisk.\n\nDespite the high risk, the potential reward is substantial, with SANA’s market"
      },
      {
        "title": "Berkshire Hathaway operating earnings fell nearly 30% in Warren Buffett's final quarter as CEO",
        "link": "https://www.cnbc.com/2026/02/28/berkshire-hathaway-brka-q4-2025-earnings.html",
        "published": "Sat, 28 Feb 2026 13:31:55 GMT",
        "source": "US Top News and Analysis",
        "text": "Warren Buffett and Greg Abel walkthrough the Berkshire Hathaway Annual Shareholders Meeting in Omaha, Nebraska on May 3, 2025.\n\nBerkshire Hathaway reported a big decline in its operating earnings for the fourth quarter, due in large part to weakness in the conglomerate's insurance business.\n\nEarnings from operations totaled $10.2 billion in Q4. That's down more than 29% from $14.56 billion in the year-earlier period.\n\nThis was the final quarter under Warren Buffett as CEO, who announced he was stepping down at the annual shareholders meeting last May. Greg Abel took the reins to start 2026 and vowed in Berkshire's annual letter accompanying Saturday's results to continue the culture Buffett built of financial strength and capital discipline. Buffett remains chairman.\n\nInsurance underwriting profits dropped 54% to $1.56 billion from $3.41 billion a year prior. Insurance investment income slid nearly 25% from to $3.1 billion from $4.088 billion.\n\nFor the full-year 2025, operating earnings totaled $44.49 billion. That's down from $47.44 billion in the year prior.\n\nProfits from insurance underwriting came in at $7.26 billion, down from $9 billion in 2024. Insurance investment income for the year eased to $12.5 billion from $13.6 billion a year prior.\n\nThis is breaking news. Please check back for updates."
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe US has launched airstrikes on Iran, resulting in panic and fury among the Iranian population, with reports of at least 53 students killed in a strike on an elementary school. Iran has responded by launching strikes against Israel and US bases in the Gulf. Meanwhile, in Ukraine, the elderly are struggling to survive amidst frequent heat and power cuts caused by Russia's assault on the country's energy infrastructure. Ghana has also reported that at least 55 of its citizens have been killed in Russia's war with Ukraine after being \"lured into battle\".\n\n## Market & Business Implications\n* The Iranian government has declared that all US and Israeli interests and assets in the region are now considered legitimate targets, according to Article 1.\n* At least 55 Ghanaians have been killed in Russia's war with Ukraine after being \"lured into battle\", as stated in Article 3.\n* Russia's assault on Ukraine's energy infrastructure has caused frequent heat and power cuts, affecting the elderly population, as reported in Article 5.\n\n## Beginner-Friendly Summary\nThere was a big attack by the US on Iran, which made a lot of people in Iran very scared and angry. Iran fought back by attacking the US and its friends. In another part of the world, older people in Ukraine are having a hard time because they don't have heat or electricity. Also, some people from Ghana went to fight in Ukraine and many of them got killed.",
    "articles": [
      {
        "title": "Panic, fury, and some hope, in Iran as U.S. launches strikes",
        "link": "https://www.npr.org/2026/02/28/nx-s1-5730186/iran-strikes-israel",
        "published": "Sat, 28 Feb 2026 07:21:28 -0500",
        "source": "NPR Topics: World",
        "text": "Panic, fury, and some hope, in Iran as U.S. launches strikes\n\ntoggle caption AP\n\nAmman, Jordan — In Tehran, panicked residents rushed home to shelter and terrified children poured out of classrooms as U.S. air strikes hit the capitol, Iranians reached by phone told NPR.\n\nThe Iranian government said one of the missiles hit a girl's elementary school in Minab city in Iran's southern Hormozgan province, killing at least 53 students.\n\n\"They have hit many targets around me and we hear fighter jets and missiles exploding,\" said a resident in Western Tehran reached by phone before communications were cut in Iran. \"People were panicking and trying to get to their homes,\" she said. \"Children are running out of school.\"\n\nSponsor Message\n\nSpeaking on condition of anonymity due to fears of arrest, she said there had been no warning from the Iranian government of a potential attack and people were caught unprepared. The airstrikes hit on the first day of Iran's work week while many were at work or in school.\n\nIran responded to the attacks by launching strikes against Israel and U.S. bases in the Gulf.\n\nIt declared that following the airstrikes in Iran early Saturday, it considered all U.S. and Israeli interests and assets in the region legitimate targets.\n\n\"Our country's armed forces will teach America and Israel a big lesson,\" said Brigadier General Abolfazl Shekarchi, spokesman for the military general staff.\n\nThe Bahraini government said an Iranian airstrike had hit the U.S. naval base in Bahrain which is home to the U.S. Fifth Fleet. The United Arab Emirates, another U.S. ally, said it intercepted Iranian missiles. It said shrapnel from one of the intercepted missiles killed a national of an unspecified Asian country in Abu Dhabi.\n\nIn Jordan, several explosions believed to be missiles being intercepted were heard along with the sound of fighter jets. The Jordanian military said its forces had shot down two ballistic missiles.\n\nSponsor Message\n\nIran's foreign ministry said th"
      },
      {
        "title": "US-Israeli attack triggers fear and panic in Iran - Reuters",
        "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQeERoTVp3cHVQUnZ2cjE2bG03YU1FY182d1NTdWprOXFuZmZneUlXT3FvQUZzUC1jUk5kdWUzZU5Bd3RxRzE3VkdqalU4XzE4TVNxUkwwMXlsU28wYlBQdGxRUmFJaGx2TklsYkNwRGYtc3ByMldianUtYmRQQldCU1Rwc1ZXcHNwYTJEQkt5T1hIVkx3SThQRk1OVDI?oc=5",
        "published": "Sat, 28 Feb 2026 11:07:31 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Ghana says at least 55 of its people killed after Russia ‘lured’ them to fight Ukraine",
        "link": "https://www.theguardian.com/world/2026/feb/27/ghana-men-killed-fight-russia-ukraine",
        "published": "Fri, 27 Feb 2026 16:42:39 GMT",
        "source": "World news | The Guardian",
        "text": "At least 55 Ghanaians have been killed in Russia’s war with Ukraine after being “lured into battle”, Ghana’s foreign minister has said after a visit to Kyiv in which officials raised the issue of Russian recruitment of African people.\n\nReports of African men being attracted to Russia by promises of jobs and ending up on Ukraine’s frontlines have become more frequent in recent months, creating tensions between Moscow and some of the countries involved.\n\nRussian authorities have denied illegally recruiting African citizens to fight in Ukraine. The foreign minister, Samuel Okudzeto Ablakwa, said in a post on X on Thursday: “We were informed that 272 Ghanaians are believed to have been lured into battle since 2022 for which an estimated 55 have been killed and 2 captured as prisoners of war.”\n\nAt a media briefing on Tuesday, Andrii Sybiha, the Ukrainian foreign minister, who was standing alongside Ablakwa, said more than 1,780 Africans from 36 different countries were fighting in the Russian army.\n\nGhana, which has economic and diplomatic ties to Russia, intended to raise awareness about recruitment and to dismantle “dark web illegal recruitment schemes operating within our jurisdiction”, Ablakwa said in his post on X. “This is not our war and we cannot allow our youth to become human shields for others,” he said.\n\nThe minister said Ghana’s government would intensify public education and work to “track and dismantle all dark web illegal recruitment schemes” operating in the country. He added that the two captured Ghanaians had warned young people against being tempted by financial incentives to join the conflict.\n\nSouth Africa’s government said this week that two of its citizens had died on the frontlines of the conflict. The two were separate from a group of 17 South Africans who were tricked into fighting for Russia in Ukraine and who had mostly been repatriated, South Africa’s foreign ministry said in a statement.\n\nIn South Africa, Duduzile Zuma-Sambudla, a daughter "
      },
      {
        "title": "What we know so far",
        "link": "https://www.bbc.com/news/articles/cx2dyz6p3weo?at_medium=RSS&at_campaign=rss",
        "published": "Sat, 28 Feb 2026 12:16:20 GMT",
        "source": "BBC News",
        "text": "Bill Clinton asked about hot tub photo and testifies he knew 'nothing' of Epstein crimes\n\nThe former president told the committee that he would never have flown on Epstein's plane if he \"had any inkling of what he was doing\"."
      },
      {
        "title": "Kyiv's elderly endure blackouts and bombardment, clinging to warmth and hope",
        "link": "https://www.npr.org/2026/02/28/nx-s1-5725277/russia-ukraine-war-kyiv-elderly",
        "published": "Sat, 28 Feb 2026 06:00:00 -0500",
        "source": "NPR Topics: World",
        "text": "Kyiv's elderly endure blackouts and bombardment, clinging to warmth and hope\n\ntoggle caption Eleanor Beardsley/NPR\n\nKYIV, Ukraine — There's electricity on Kyiv's left bank today, so a small elevator carries visitors up to Liliya Martynivna Lapina's 10th-floor apartment. The 88-year-old has been spending her days in her bed under a pile of blankets by a bright but cold window, trying to stay warm.\n\nShe sits bolt upright and seems to come alive as visitors enter her apartment, erupting in a stream of words and enthusiasm over the care package of pasta, sugar, tea and cooking oil that has been delivered. Lapina is wearing multiple layers of colorful wool sweaters and a headscarf.\n\ntoggle caption Eleanor Beardsley/NPR\n\nNPR is accompanying the aid group Starenki, which delivers food and fellowship to the mostly older people stuck in their apartments this winter as they try to survive the frequent heat and power cuts brought on by Russia's assault on Ukraine's energy infrastructure.\n\nSponsor Message\n\nAs Russian President Vladimir Putin fails to make significant progress on the battlefield, he is trying to break the Ukrainian people's will by plunging them into the cold and dark in one of the coldest winters in years. The capital, Kyiv, has been particularly hard hit. Kyiv Mayor Vitali Klitschko urged those who could to leave the city. But many people, especially older adults, have nowhere else to go.\n\n\"The left bank of the Dnieper River has been very hard hit by Russian strikes, leaving most people in the dark for days on end,\" says Alina Diachenko, director of Starenki. \"Their houses are without warmth and without electricity, and the old people try to heat themselves by wearing more clothes and turning on the gas of their stoves. They suffer a lot.\"\n\nBut on this day, Lapina is animated. Her cluttered apartment is filled with Eastern Orthodox icons. She says God will punish Russia for what it's doing. And she greatly admires Ukrainian President Volodymyr Zelenskyy:\n\n\"Our"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nNetflix has withdrawn its $83 million bid for Warner Bros. Discovery, allowing Paramount Skydance to take control of the cable network. This move is seen as a win for the right and a significant expansion of the Ellison family's media empire. Meanwhile, Kevin O'Leary has warned Gen Z applicants against bringing their parents to job interviews, citing concerns about independence. President Trump has also proposed giving workers $1,000 for retirement and ordered the government to stop using Anthropic in a battle over AI use.\n\n## Market & Business Implications\n* Netflix's withdrawal from the bidding war for Warner Bros. Discovery has cleared the way for Paramount Skydance to acquire the cable network, adding HBO, DC Comics, and other assets to its portfolio (Article 1).\n* Kevin O'Leary has stated that bringing a parent to a job interview is a \"horrific signal\" and a warning sign for employers evaluating risk, and would result in the resume being rejected (Article 2).\n* President Trump has proposed creating retirement accounts similar to the Thrift Savings Plan to give millions of workers $1,000 a year to boost their retirement savings (Article 5).\n\n## Beginner-Friendly Summary\nSome big changes are happening in the business world. A company called Netflix stopped trying to buy another company called Warner Bros. Discovery. This means that another company, Paramount Skydance, can now buy it instead. A businessman named Kevin O'Leary said that it's not a good idea for young people to bring their parents to job interviews. The President also talked about helping people save money for when they retire.",
    "articles": [
      {
        "title": "Trump allies claim victory as the Ellisons expand their media empire",
        "link": "https://www.washingtonpost.com/business/2026/02/28/trump-paramount-warner-bros/",
        "published": "Sat, 28 Feb 2026 11:00:17 +0000",
        "source": "Business",
        "text": "Hours after Netflix sent shock waves through the media and entertainment world by withdrawing its $83 million bid for most of Warner Bros. Discovery, Laura Loomer celebrated on X in all-caps: “VICTORY.” The far-right influencer, who has called herself President Donald Trump’s “loyalty enforcer,” had spent months denouncing Netflix over its ties to former president Barack Obama and urging Trump to “kill” the megamerger that would have given the streaming giant control over CNN, HBO and more. Netflix’s withdrawal Thursday evening cleared the way for David Ellison’s Paramount Skydance to instead take the reins of the cable network, whose coverage the president has labeled “fake news.”\n\nParamount’s triumph in a bidding war for Warner Bros. Discovery is a game-changing business move — one that will add HBO, the DC Comics universe, the Harry Potter and Star Trek franchises, and a slew of other TV channels and movie studios to a vast father-and-son empire that already includes Oracle, Paramount Pictures, CBS News and a chunk of the new American TikTok. In an email sent to staff on Friday, and obtained by The Washington Post, Ellison said the “historic” merger would create “the next-generation global media and entertainment company.”\n\nAmong power players in politics and media, Paramount’s swoop is also widely viewed as a win for the right amid a broader push to rein in what many conservatives view as a liberal slant in the media and entertainment industries. And in Washington, questions have swirled as to what role was played by a president who famously relishes dealmaking.\n\nAs recently as Thursday morning, Netflix CEO Ted Sarandos appeared at the White House amid reports that he would meet with Trump personally as he sought to save a deal the Silicon Valley streaming giant first struck with Warner Bros. in December. But things unraveled quickly from there. Ask The Post AIDive deeper\n\nA senior White House official told The Post on Friday that Trump never met with Sarandos. "
      },
      {
        "title": "Kevin O'Leary warns Gen Z: Bring your parents to an interview, resume goes 'right into the garbage'",
        "link": "https://www.foxbusiness.com/media/kevin-oleary-warns-gen-z-bring-your-parents-interview-resume-goes-right-garbage",
        "published": "Sat, 28 Feb 2026 07:00:29 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "A growing number of hiring managers say that they are seeing a surprising new trend from Gen Z applicants: bringing a parent into the job interview process, sometimes even onto Zoom calls.\n\n\"Shark Tank\" star Kevin O'Leary joined FOX Business' Stuart Varney on 'Varney & Co.' to weigh in on the practice and what it signals to employers.\n\nFor O'Leary, the issue isn't generational stereotypes, it's about independence. In today's competitive labor market, he argues, employers are looking for candidates who can think, decide and execute on their own. When a parent enters the room, he says, that independence immediately comes into question.\n\n\"First question I'd have to the son or daughter, I'd say, do you want me to hire your mother or you? What's she doing here?\" O'Leary said, \"That resume goes right into the garbage in one of my operations.\"\n\nHe said the situation recently happened to him during a virtual interview.\n\n\"It happened to me on a Zoom call, and I just said, this isn't going to work... Your mom is not gonna be part of this discussion,\" he said.\n\nLARRY KUDLOW: WHY ARE GEN Z-ERS SO DOUR, DEPRESSED, AND UNEMPLOYED?\n\nBeyond optics, O'Leary views the move as a warning sign for employers evaluating risk.\n\n\"It means you can't do this on your own... It's a horrific signal,\" O'Leary said, calling it \"a really, really bad idea.\""
      },
      {
        "title": "Trump orders government to stop using Anthropic in battle over AI use",
        "link": "https://www.bbc.com/news/articles/cn48jj3y8ezo?at_medium=RSS&at_campaign=rss",
        "published": "Sat, 28 Feb 2026 03:50:05 GMT",
        "source": "BBC News",
        "text": "\"But regardless of how we got here, this is no longer just an issue between Anthropic and the [Department of War] DoW; this is an issue for the whole industry and it is important to clarify our stance.\""
      },
      {
        "title": "NASA is sending its first Black and first female astronauts to the moon",
        "link": "https://www.cnbc.com/2026/02/28/nasa-astronauts-moon-artemis.html",
        "published": "Sat, 28 Feb 2026 13:00:01 GMT",
        "source": "Business News",
        "text": "The Artemis II crew – (L-R) pilot Victor Glover, mission specialist Jeremy Hansen of CSA (Canadian Space Agency), commander Reid Wiseman and mission specialist Christina Koch – rehearse a walkout from the Neil A. Armstrong Operations and Checkout Building at NASA’s Kennedy Space Center in Florida on December 20, 2025 in Cape Canaveral, Florida.\n\nNASA is preparing to launch a mission to the moon — and it's making history for more reasons than one.\n\nThe space agency's Artemis II launch marks the U.S.'s first journey back to the moon in more than 50 years. It will also carry the first Black astronaut and the first female astronaut to travel to the moon, though the mission will be a flyby without a touchdown on the surface.\n\nThe launch, originally scheduled for early February and now delayed, will carry four astronauts around the moon and back, including Victor Glover and Christina Koch, the first Black and first female astronauts, respectively, to make the flight.\n\nThe mission follows the success of the Artemis I launch in 2022, which was uncrewed, and marks NASA's next step toward eventually sending astronauts to Mars.\n\n\"The benefits of the Artemis program are technological, but they're also cultural,\" Glover, who is a decorated U.S. Navy captain and has traveled to the International Space Station, said in a 2024 NASA video. \"What really means something to me is the inspiration that will come from it, inspiring future generations to reach for the moon, literally to reach for the moon.\"\n\nKoch began her career at NASA, starting as an engineer and going on to conduct scientific research before becoming an astronaut in 2013, also traveling to the International Space Station.\n\n\"The one thing I'm most excited about is that we are going to carry your excitement, your aspiration, your dreams with us on this mission,\" Koch said at the 2023 press conference when the mission's astronauts were announced.\n\nDanielle Wood, a professor in the astronautics department at Massachusetts "
      },
      {
        "title": "Trump wants to give workers $1,000 for retirement. Can it work?",
        "link": "https://www.washingtonpost.com/business/2026/02/28/trump-retirement-accounts-tsp/",
        "published": "Sat, 28 Feb 2026 11:00:00 +0000",
        "source": "Business",
        "text": "There’s an expression that fraud experts use all the time to warn people about a suspected scam: If it sounds too good to be true, it probably is. That’s how I feel about President Donald Trump’s proposal to give millions of workers $1,000 a year to boost their retirement savings. In his State of the Union address this week, Trump trumpeted the creation of retirement accounts similar to the Thrift Savings Plan (TSP) offered to federal workers. Addressing the millions of Americans currently shut out of workplace savings, the president said he wanted to “remedy this gross disparity.”\n\nHe said he was going to “ensure that all Americans can profit from a rising stock market.”\n\nOn paper — or his teleprompter, in this case — expanding the TSP, the federal government’s low-fee workplace investment program, sounds like a savvy policy move. While individuals can always build a nest egg on their own, we know that automatic payroll deductions through an employer-sponsored plan significantly boost participation rates.\n\nHowever, given Trump’s poor track record for helping low-wage workers, I’m highly skeptical this promise will ever materialize. Or, if the program is implemented, that it would make a long-term difference.\n\nRecent policy shifts under the current administration have further frayed the social safety net for working-class families. Many of these changes were imposed in the One Big Beautiful Bill Act. Ask The Post AIDive deeper\n\nThe Supplemental Nutrition Assistance Program (SNAP) will reduce both the number of eligible people and the level of funding, according to an analysis by the Urban Institute.\n\nTrump’s tariffs have raised prices on many consumer goods. Ask The Post AIDive deeper\n\nOver a million people have abandoned Obamacare this year following the Republican-led expiration of premium subsidies, which is estimated to increase payments by an average of 114 percent, according to a January report from KFF, a nonpartisan health policy organization.\n\nWhile the adm"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market experienced a decline, with the S&P 500 closing down over 1% on Monday. A scenario published by Citrini Research, which modeled a future where AI agents reroute transactions away from card networks, led to a drop in stocks such as Mastercard, Visa, and American Express. Meanwhile, Coreweave's stock plummeted 18% due to concerns over the company's spending plans and debt load. Dell shares, on the other hand, climbed 22% after the company beat earnings estimates and issued strong guidance. Brookfield Renewable was highlighted as a potential outperformer due to its role in providing power to tech companies.\n\n## Market & Business Implications\n* According to Louis Amira, CEO of Circuit & Chisel, the market reaction to Citrini Research's scenario conflated two distinct layers of the payments stack, and the primary casualties would likely be issuers and other intermediaries, not Visa and Mastercard (Article 1).\n* Coreweave's CEO, Mike Intrator, defended the company's spending plans, stating that they have willingly chosen to invest in more infrastructure to meet the demand for capacity (Article 2).\n* Dell reported adjusted earnings of $3.89 per share, exceeding the $3.53 per share expected by analysts, and estimates fiscal 2027 revenue will come in between $138 billion and $142 billion (Article 4).\n* Brookfield Renewable operates a globally diversified clean power platform and has signed long-term power purchase agreements with utilities and large corporations, including Microsoft and Google (Article 5).\n* Citrini Research's scenario modeled a speculative future where AI agents autonomously reroute transactions away from card networks toward stablecoin rails, wiping out interchange economics in the process (Article 1).\n\n## Beginner-Friendly Summary\nThe stock market had a bad day on Monday, with some big companies' stocks going down. This happened because of an idea that was shared about how artificial intelligence might change the way people make payments. Some companies, like Mastercard and Visa, were affected by this idea. Meanwhile, a company called Dell had a good day because it made more money than expected. Another company, Brookfield Renewable, is important because it helps provide power to big tech companies.",
    "articles": [
      {
        "title": "Visa, Mastercard Aren't The Real Casualties In Citrini's AI-Stablecoin Scenario",
        "link": "https://finance.yahoo.com/news/visa-mastercard-arent-real-casualties-133113889.html?.tsrc=rss",
        "published": "Sat, 28 Feb 2026 13:31:13 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Amira said the economic logic underpinning Citrini’s thesis is sound. “If AI agents are optimizing for cost and efficiency, they will naturally route transactions toward cheaper rails when possible. In machine-to-machine commerce, a 2–3% interchange fee is significant, especially when stablecoins can settle near-instantly at a fraction of the cost,” he said.\n\nCitrini’s scenario specifically called out card-focused banks, including American Express, Synchrony Financia l (NYSE: SYF ), Capital One Financial Corporation (NYSE: COF ) and Discover Financial Services , as carrying the sharpest exposure, noting their “moats were made of friction.”\n\n“It’s also important to separate the networks from the issuers. Visa and Mastercard take only a small number of basis points. They pride themselves on being ‘technology companies,’ even if their original stakeholders were the issuing banks. Most of that 2–3% goes to issuers and other intermediaries. If fees compress, the greater pressure is likely on those players,” Amira said.\n\nLouis Amira , CEO of Circuit & Chisel , an agentic commerce platform backed by Stripe and Coinbase Global Inc. (NASDAQ: COIN ), told Benzinga the market reaction conflated two distinct layers of the payments stack.\n\nBy Monday’s open, the S&P 500 turned red and closed down more than 1%. Mastercard, Visa, American Express, and DoorDash Inc. (NYSE: DASH ) each fell between 4% and 6%.\n\nCitrini Research’s over 7,000-word Substack post, titled “The 2028 Global Intelligence Crisis” and explicitly framed as “a scenario, not a prediction,” modeled a speculative future where AI agents autonomously reroute transactions away from card networks toward stablecoin rails, wiping out interchange economics in the process.\n\nBut a CEO building payment infrastructure for AI agents says the the piece got the direction right while misidentifying the primary casualties.\n\nA Citrini Research scenario published Sunday sent shockwaves through financial markets Monday , dragging down"
      },
      {
        "title": "CoreWeave CEO defends spending plans, tries to combat debt narrative as stock plummets 18%",
        "link": "https://www.cnbc.com/2026/02/27/coreweave-ceo-intrator-stock-ai-spending.html",
        "published": "Fri, 27 Feb 2026 21:02:48 GMT",
        "source": "Earnings",
        "text": "Coreweave CEO Mike Intrator backed up the company's massive spending plans during an interview with CNBC's \"Squawk on the Street\" on Friday as shares dropped post-earnings on profitability worries.\n\nIntrator told CNBC that Coreweave has willingly chosen to invest in more infrastructure and take a margin hit to meet the \"once in a generation moment\" for capacity demand.\n\n\"I understand the concerns that people have as they see us allocating a massive scale of money to this market, but the truth of the matter is, our backlog is enormous,\" he said.\n\nCoreweave's stock plummeted 18% on disappointing revenue guidance. The New Jersey-based company also said it plans to spend between $30 billion and $35 billion in 2026. That surpassed a FactSet estimate of $26.9 billion and fueled profitability worries.\n\nConcerns have mounted recently over the long-term sustainability of Coreweave's debt load and business model.\n\nThe company relies on debt to finance purchases of advanced AI Nvidia chips, which it then rents out. Most of its revenue also hinges heavily on a small group of hyperscalers and AI companies, including Microsoft and OpenAI."
      },
      {
        "title": "Trump, Israel Launch 'Massive' Attacks On Iran; How Will Dow Jones Futures React?",
        "link": "https://finance.yahoo.com/m/79b07a85-c9fa-39e7-b8e4-f809203666ee/trump%2C-israel-launch.html?.tsrc=rss",
        "published": "Sat, 28 Feb 2026 13:29:15 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "There are no important events for this country at this time. Select \"All\" to see top events in other countries or view all events."
      },
      {
        "title": "Dell shares climb 22% on earnings beat as company navigates rising memory costs",
        "link": "https://www.cnbc.com/2026/02/27/dell-stock-earnings-memory-shortage-ai-servers.html",
        "published": "Fri, 27 Feb 2026 21:10:25 GMT",
        "source": "Earnings",
        "text": "Dell shares soared 22% on Friday after the company beat fiscal fourth-quarter estimates and issued strong guidance, as a historic memory shortage puts pressure on prices in the sector.\n\nDell reported adjusted earnings of $3.89 per share, exceeding the $3.53 per share expected by analysts surveyed by LSEG. The company posted $33.38 billion in revenue for the quarter, topping a forecast of $31.73 billion.\n\nThe company estimates fiscal 2027 revenue will come in between $138 billion and $142 billion, blowing away the $124.7 billion expected by Factset.\n\nDell expects revenue for its artificial intelligence servers to hit $50 billion in 2027, more than double the year prior.\n\nWith memory chip makers prioritizing the high-bandwidth memory needed for AI chips made by companies including Nvidia , AMD and Google , it has meant less supply for the makers of laptops and smartphones.\n\nDell COO Jeff Clarke told analysts on the company's earnings call that Dell is working with memory partners \"to be as flexible and as agile as possible.\""
      },
      {
        "title": "Forget Tech Stocks: The Utility Play That Could Outperform Nvidia",
        "link": "https://www.fool.com/investing/2026/02/28/forget-tech-stocks-the-utility-play-that-could-out/?.tsrc=rss",
        "published": "Sat, 28 Feb 2026 12:20:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Nvidia's (NVDA 4.43%) stock is up over 700% in the last three years. That has absolutely crushed the S&P 500, which has gained about 70%. The semiconductor giant has cashed in on the AI boom as technology companies can't seem to get enough of its chips.\n\nWhile tech companies need Nvidia's chips to support their AI ambitions, those semiconductors can't run without power. That plays right into Brookfield Renewable's (BEPC 2.15%)(BEP 0.71%) strengths. The leading renewable energy company could outperform an investment in Nvidia in the coming years as power demand surges and chip competition intensifies.\n\nThe power player\n\nBrookfield Renewable operates a globally diversified clean power platform. It sells the electricity it produces under long-term power purchase agreements (PPAs) with utilities and large corporations. Brookfield's global scale, diversification, and expertise have made it the key power supplier for leading AI companies.\n\nFor example, in 2024, Brookfield signed the largest-ever corporate PPA with Microsoft at over 10.5 gigawatts (GW) of renewable power capacity. That deal was nearly eight times larger than the previous corporate PPA record. Brookfield will deliver this capacity between 2026 and 2030 across the U.S. and Europe. The partners have the potential to expand the scope of their agreement beyond those regions and to carbon-free generation technologies other than wind and solar energy.\n\nExpand NYSE : BEPC Brookfield Renewable Today's Change ( -2.15 %) $ -0.94 Current Price $ 42.71 Key Data Points Market Cap $7.7B Day's Range $ 42.12 - $ 44.30 52wk Range $ 23.73 - $ 45.18 Volume 58K Avg Vol 949K Gross Margin 26.41 % Dividend Yield 4.41 %\n\nBrookfield also inked a deal with Google last year to provide it with up to 3 GW of hydropower, the largest-ever corporate hydroelectric agreement. The first two PPAs under that partnership cover 670 megawatts from two hydroelectric facilities in PA, representing over $3 billion of revenue.\n\nBrookfield is also a p"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nEthereum remains the preferred choice for institutions due to its deep liquidity and large concentration of stablecoins and decentralized finance capital. Tether has frozen $4.2 billion in tokens tied to illicit activity over the past three years. Bitcoin's price dropped to $63,000 after the US and Israel announced a military operation in Iran. Barclays is considering a push into blockchain, including tokenized deposits and stablecoin payments. President Trump has ordered federal agencies to stop using Anthropic's AI technology.\n\n## Market & Business Implications\n* Institutions tend to prioritize capital depth over performance, which is why Ethereum remains the preferred choice despite faster blockchains emerging, according to Kevin Lepsoe, founder of ETHGas (Article 1).\n* Tether has frozen roughly $4.2 billion worth of its USDt tokens connected to suspected criminal activity over the past three years (Article 3).\n* Barclays has requested information from technology providers regarding a potential push into blockchain, including tokenized deposits and stablecoin payments (Article 4).\n* President Trump has directed all US federal agencies to stop using Anthropic's AI technology, citing concerns over national security (Article 2).\n* Bitcoin's price has dropped to $63,000 after the US and Israel announced a military operation in Iran, resulting in over $250 million in liquidations (Article 5).\n\n## Beginner-Friendly Summary\nBig companies still like using Ethereum, a type of cryptocurrency, because it has a lot of money and activity on it. A company called Tether froze a lot of bad money, over $4 billion, that was being used for illegal things. The price of Bitcoin, another type of cryptocurrency, went down to $63,000 because of a big military operation. A big bank called Barclays is thinking about using blockchain, a technology related to cryptocurrency. The President of the United States told government agencies to stop using a certain type of artificial intelligence.",
    "articles": [
      {
        "title": "Why institutions still prefer Ethereum despite faster blockchains",
        "link": "https://cointelegraph.com/news/institutions-prefer-eth-faster-blockchains?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 28 Feb 2026 13:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "Ethereum continues to host the largest concentration of stablecoins and decentralized finance (DeFi) capital, even as successive waves of faster networks emerge.\n\nNewer blockchains have promised higher throughput and lower costs, raising questions about whether institutional capital could eventually migrate away from Ethereum.\n\nKevin Lepsoe, founder of ETHGas and a former Morgan Stanley derivatives executive in Asia, said he expects Ethereum’s lead to endure, as institutions tend to prioritize capital depth over flashy performance.\n\n“[Transactions per second] is the metric that gets engineers excited, but is that what drives capital to the blockchain?” Lepsoe asked in an interview with Cointelegraph.\n\n“The capital is on Ethereum; the stablecoins are there. TradFi is looking at where the liquidity is,” he said.\n\nInstitutional capital brings scale and stability to a blockchain’s ecosystem. Large asset managers and tokenized fund issuers move capital in volumes that deepen liquidity and anchor stablecoin supply. Their presence can establish a network’s position beyond hype-driven retail activity that surges in bull markets and fades in downturns.\n\nEthereum isn’t the fastest chain, but its DeFi liquidity is the deepest. Source: DefiLlama\n\nLiquidity keeps Ethereum ahead of faster rivals\n\nIf institutions prefer to operate where most of the money already sits, then simply making a faster blockchain will not pull capital away from Ethereum.\n\nOver the past several cycles, performance has become a weapon to attract users. Solana has emerged as Ethereum’s high-speed alternative, dubbed an “Ethereum killer,” though that label is debated. It onboarded retail traders through the non-fungible token (NFT) boom and the memecoin frenzy, but the heightened activities weren’t sustained in the long run.\n\nRelated: Can Solana shed its memecoin image in 2026?\n\nSolana now has its own generation of “Solana killers” that advertise higher theoretical transactions per second (TPS). But Ethereum"
      },
      {
        "title": "Trump Orders Federal Agencies to Dump 'Woke' Anthropic AI After Pentagon Dispute",
        "link": "https://decrypt.co/359453/trump-orders-federal-agencies-dump-woke-anthropic-ai",
        "published": "Fri, 27 Feb 2026 22:09:28 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Trump ordered federal agencies to “immediately cease” using Anthropic's AI technology.\n\nThe order follows a dispute between Anthropic and the Pentagon over the use of Claude for unrestricted military use.\n\nTrump has given agencies six months to phase out Anthropic systems.\n\nPresident Donald Trump has directed all U.S. federal agencies to stop using artificial intelligence technology developed by Anthropic, escalating a dispute between the AI company and the Pentagon over how the military uses the technology.\n\nIn a Truth Social post on Friday, Trump said agencies must “immediately cease” using Anthropic products, with a six-month phase-out period for departments that already use the company’s technology.\n\n\"The United States of America will never allow a radical left, woke company to dictate how our great military fights and wins wars!” Trump wrote. “That decision belongs to your commander-in-chief and the tremendous leaders I appoint to run our military.\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nThe directive follows Anthropic’s refusal on Thursday to remove safeguards preventing Claude from being used for “mass domestic surveillance” or “fully autonomous weapons,” after Pentagon officials demanded contractors allow their systems to be used for “any lawful use.”\n\n“The left-wing nut jobs at Anthropic have made a disastrous mistake trying to strong-arm the Department of War and force them to obey their terms of service instead of our Constitution,” Trump wrote.\n\nPresident Trump called the situation a threat to U.S. troops and national security.\n\n“Their selfishness is putting American lives at risk, our troops in danger, and our national security in jeopardy,” Trump said.\n\nAnthropic has resisted Pentagon demands to grant unrestricted military use of its models, while also recently walking back "
      },
      {
        "title": "Tether froze $4.2B in tokens tied to illicit activity in 3 years: Report",
        "link": "https://cointelegraph.com/news/tether-freezes-4-2b-usdt-illicit-activity-report?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 28 Feb 2026 10:13:17 +0000",
        "source": "Cointelegraph.com News",
        "text": "Stablecoin issuer Tether has reportedly frozen roughly $4.2 billion worth of its USDt tokens connected to suspected criminal activity over the past three years.\n\nMost of the blocked funds were restricted since 2023, as regulators and law enforcement agencies intensified scrutiny of crypto-related fraud and sanctions evasion, the El Salvador-based firm reportedly told Reuters on Friday.\n\nTether’s dollar-pegged USDt (USDT) token is the largest stablecoin in circulation, with more than $180 billion outstanding, up sharply from about $70 billion three years ago.\n\nTether can freeze tokens directly on the blockchain by blacklisting wallet addresses when requested by authorities.\n\nRelated: Tether-backed Oobit adds crypto-to-bank transfers for local payment networks\n\nTether helps governments freeze funds\n\nOn Tuesday, Tether announced that it has assisted the US Department of Justice in seizing nearly $61 million in USDt tied to “pig-butchering” scams, a scheme in which criminals build relationships with victims before persuading them to send money.\n\nEarlier this month, the company also froze approximately $544 million in cryptocurrency at the request of Turkish authorities, blocking funds tied to an alleged illegal online betting and money-laundering operation.\n\nAccording to blockchain analytics firm Elliptic, by late 2025, stablecoin issuers Tether and Circle had blacklisted around 5,700 wallets holding about $2.5 billion, with roughly three-quarters of the addresses containing USDt when they were frozen.\n\nRelated: Tether USDT supply set for biggest monthly decline since 2022 FTX collapse\n\nUSDt supply shrinks\n\nAs Cointelegraph reported, USDt is on track for its largest monthly supply drop in three years, with circulating supply falling about $1.5 billion in February after a $1.2 billion decline in January, according to blockchain data. The contraction echoes the period following the FTX collapse in late 2022 and may point to tighter liquidity in crypto markets.\n\nUSDt marke"
      },
      {
        "title": "Banking Giant Barclays Mulls Crypto Payments Push: Bloomberg",
        "link": "https://decrypt.co/359451/banking-giant-barclays-mulls-crypto-payments-push-bloomberg",
        "published": "Fri, 27 Feb 2026 21:54:08 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Barclays has requested information from technology providers regarding a potential push into blockchain, according to Bloomberg.\n\nThe banking giant is said to be considering tokenized deposits and stablecoin payments.\n\nEarlier this year, the firm made an investment in stablecoin settlement firm, Ubyx.\n\nPublicly traded banking institution Barclays (BCS) is reportedly gathering information for a potential push into blockchain, according to a Friday report from Bloomberg.\n\nSources familiar with the matter said the firm has requested information from “technology suppliers” while it considers a path forward. Its utilization of blockchain may include tokenized deposits and stablecoins, the report said.\n\nThe U.K.-based banking institution appears to be warming to crypto, investing in stablecoin settlement startup Ubyx after being named as one of a number of leading international banks exploring the joint issuance of a stablecoin last fall.\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\n“Specialist technology will play a pivotal role in delivering connectivity and infrastructure to enable regulated financial institutions to interact seamlessly,” Barclays Head of Digital Assets Ryan Hayward said at the time of the Ubyx investment.\n\nNow the firm is further investigating those technologies and could ultimately decide on a provider by April, according to Bloomberg.\n\nIf the firm ultimately decides to offer tokenized deposits or experiment with stablecoins, it would join a list of major banking institutions that have already entered the crypto space.\n\nLast year, JPMorgan launched its tokenized deposit token—JPMD—to the Coinbase-incubated Ethereum scaling network, Base, letting institutional clients make payments using a digital representation of their JPMorgan deposits. The firm expanded the token to the Cant"
      },
      {
        "title": "Bitcoin price drops to $63K as US, Israel bomb Iran",
        "link": "https://cointelegraph.com/news/bitcoin-price-drops-63k-us-israel-bomb-iran?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 28 Feb 2026 08:23:53 +0000",
        "source": "Cointelegraph.com News",
        "text": "Bitcoin (BTC) daily losses neared 4% on Saturday as the US and Israel announced a military operation in Iran.\n\nKey points:\n\nBitcoin targets $63,000 as US President Donald Trump confirms a major bombing campaign inside Iran.\n\nTrump highlights nuclear infrastructure as a key target of the joint raids with Israel.\n\nCrypto markets react alone with TradFi trading suspended until futures return.\n\n\n\nTrump tells Iranians: “Take over your government”\n\nData from TradingView showed BTC price action testing $63,000 as crypto markets reacted to the weekend’s events.\n\nBTC/USD one-hour chart. Source: Cointelegraph/TradingView\n\n\n\nIn a video address, US President Donald Trump said that the goal of the move was to target Iran’s nuclear infrastructure, but finished by calling on Iranians to take control of the incumbent government.\n\n“When we are finished, take over your government; it will be yours to take,” he said.\n\n“This will be, probably, your only chance for generations. For many years, you have asked for America’s help, but you never got it.”\n\nWith US stock market futures yet to open, crypto was alone in deciding on how to react to fresh geopolitical instability.\n\nData from CoinGlass showed liquidations passing $250 million in the four hours to the time of writing.\n\nBTC liquidation heatmap (screenshot). Source: CoinGlass\n\n\n\n“The US and Israel now appear to be at war with Iran for the second time in 8 months,” trading resource The Kobeissi Letter wrote in a response on X.\n\nKobeissi referenced a previous Iran offensive in 2025 — an event that sparked an immediate, volatile reaction across crypto and risk assets.\n\n\n\nBitcoin reacts to familiar cues\n\nWith core support levels still holding for BTC/USD, the fresh escalation comes at a key time for traders as the final hours tick down to the February monthly close.\n\nRelated: Price predictions 2/27: BTC, ETH, XRP, BNB, SOL, DOGE, BCH, ADA, HYPE, LINK\n\nAs Cointelegraph reported, the pair is now down roughly as much as in February 2025, an"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-28T13:38:13.326660+00:00"
  }
}