{
  "Tech": {
    "summary": "## Executive Summary\nWispr Flow has launched an Android app for AI-powered dictation, allowing users to access the app through a floating bubble. Nothing has revealed the design of its upcoming Phone 4A, featuring a new \"Glyph Bar\" lighting feature. Donut Lab has published third-party testing results for its solid-state battery, demonstrating fast charge performance. Password managers' claims of being \"zero knowledge\" have been debunked by new research. \n\n## Market & Business Implications\n* Wispr Flow's Android app launch expands the company's reach, as stated by Tanay Kothari, co-founder and CEO, who said \"Android finally gave us the freedom to build the voice experience we always wanted\" (Article 1).\n* Nothing's Phone 4A design features a new \"Glyph Bar\" lighting feature, which is 40 percent brighter than the previous A-series' lights, according to the company (Article 2).\n* Donut Lab's solid-state battery has been tested by VTT Technical Research Centre of Finland, confirming its fast-charging targets, including a 0–80% charge in just 4.5 minutes at 11C (Article 3).\n* Research has shown that password managers' \"zero knowledge\" claims are not always true, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups (Article 4).\n\n## Beginner-Friendly Summary\nA company called Wispr Flow made an app for Android phones that can type out what you say. Another company called Nothing showed off its new phone design. A battery company called Donut Lab had someone else test its batteries to make sure they work well. Some password keeper companies say they can't see your private info, but it turns out that's not always true.",
    "articles": [
      {
        "title": "Wispr Flow launches an Android app for AI-powered dictation",
        "link": "https://techcrunch.com/2026/02/23/wispr-flow-launches-an-android-app-for-ai-powered-dictation/",
        "published": "Mon, 23 Feb 2026 08:01:00 +0000",
        "source": "TechCrunch",
        "text": "AI-powered dictation startup Wispr Flow has launched its Android app today. The company released its app for Mac and Windows first, then launched on iOS in June 2025.\n\nOn iOS, users could use Wispr Flow through a dedicated keyboard. On Android, the interface is a bit different, as you can access the dictionary through a floating bubble. You can hold the bubble and dictate, or press once to start, and then press the close button to stop the process. Just like on other platforms, in addition to dictation, the app cleans up the filter words and also formats the text based on the context of the app and spoken content.\n\n“Android finally gave us the freedom to build the voice experience we always wanted. Only when the platform gets out of the way can we truly expect voice to replace typing on mobile,” Tanay Kothari, co-founder and CEO of the startup, said.\n\nThe app can support translation in over 100 languages and can work across other apps. Along with the Android app release, Wispr Flow said that it has done an infrastructure rewrite that makes dictation 30% faster than before.\n\nLoading the player…\n\nWhile there are tons of AI-powered dictation apps available on desktop and iOS, Wispr Flow is one of the few available on Android with this launch, besides Typeless, which launched an app for the platform last month.\n\nWhat’s more, the company has also released a new model for Hinglish, a mix of Hindi and English, for people in India who speak in mix-coded way.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately.\n\n\n\nOffer ends March 13. Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder"
      },
      {
        "title": "Nothing couldn’t wait to show off the Phone 4A",
        "link": "https://www.theverge.com/gadgets/882983/nothing-phone-4a-official-design-glyph-bar",
        "published": "2026-02-23T08:01:33-05:00",
        "source": "The Verge",
        "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nAfter teasing the upcoming launch of its midrange Phone 4A last week, Nothing has now revealed what the rear of the device looks like. An official render of the Phone 4A shared on X shows off the brand’s familiar transparent-industrial stylings, alongside a new “Glyph Bar” lighting feature located to the right of the triple camera island.\n\nThis Glyph Bar features nine individually controllable mini-LEDs that appear as a line of seven square lights — six white, and one red — replacing the three LED light strips that surround the camera on Nothing’s 3A devices. Nothing says that the Glyph Bar is 40 percent brighter than the previous A-series’ lights and uses patented tech to provide “a more natural, neutral, bleed-free glow.”\n\nNothing hasn’t shared much else about the Phone 4A series besides confirming it’ll be running a Snapdragon chip. Full specifications, price, and availability might not be announced until it launches on March 5th. Nothing CEO Carl Pei has confirmed that there won’t be a Phone 4 this year, however, so last year’s Phone 3 will remain the current flagship for now."
      },
      {
        "title": "I Donut Believe – Presenting Third Party Results (Donut Lab)",
        "link": "https://idonutbelieve.com/",
        "published": "Mon, 23 Feb 2026 12:28:06 +0000",
        "source": "Hacker News: Front Page",
        "text": "Third Party Testing\n\nThis website serves as the platform for publishing validation results and technical documentation related to the Donut Solid State Battery. Donut Lab has commissioned the internationally renowned VTT Technical Research Centre of Finland to conduct independent measurements of the battery’s performance and key characteristics. Unless otherwise stated, all tests presented here have been conducted by VTT. Full reports will be published alongside detailed video documentation that walks through the procedures, showcases the test setups, and explains the results.\n\nIntroducing “I Donut Believe” Donut Lab has commissioned internationally respected VTT Technical Research Centre of Finland to independently measure the performance and characteristics of its solid-state battery. Through third-party testing under controlled research conditions, Donut Lab provides verified data to support its performance claims. In the video, CEO Marko Lehtimäki explains the company’s perspective and the rationale for launching the series and publishing the results in this format. Watch the launch video\n\nFast Charge Performance Test The first independent test of the Donut Solid State Battery, conducted by VTT Technical Research Centre of Finland, evaluates its charge performance under demanding conditions without active cooling. The cell was tested at both 5C and extreme 11C charge rates, confirming previously stated fast-charging targets, including a 0–80% charge in just 4.5 minutes at 11C. The results demonstrate exceptional charging capability alongside stable thermal behavior, providing verification of the battery’s high-power performance. Watch the video Download full VTT test report"
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Best Puffer Jacket (2026): Patagonia, Arc’teryx, REI",
        "link": "https://www.wired.com/gallery/the-best-puffer-jackets/",
        "published": "Mon, 23 Feb 2026 13:00:00 +0000",
        "source": "WIRED",
        "text": "Mountain Hardware's Ghost Whisperer UL hoodie has been a popular pick among ultralight backpackers since it was introduced a few years ago. It remains the best puffer jacket for anyone trying to shave every last ounce off their pack weight. It weighs just 6.7 ounces for a men's medium (7.3 ounces for the men's large I tested), packs down to a tiny little thing (stuffing into its own pocket), and the 1,000-fill-power goose down offers one of the best warmth-to-weight ratios on the market. The very lightweight shell material is a mix of 5D and 7D ripstop nylon, which is a bit more fragile than heavier jackets, but it has held up well so far in my testing. I can safely say that the Ghost Whisper UL is everything I ever wanted in an ultralight down puffer and then some.\n\nWhat sets it apart from some other very nice puffers out there are the little details. First there's the 1.9 ounces of 1,000-fill-power down, which is as high a fill power as you'll find in a jacket of this class, meaning you're getting the maximum warmth and loft that you can for the least amount of weight. My only caveat for this jacket would be, if you are the type of person who gets cold easily, you might want something with a bit more fill. The classic Ghost Whisperer Down Hoody (not the ultralight) has 3 ounces of 800 fill power and is slightly warmer in most scenarios, the trade-off being it's heavier as well (about 9 ounces for a men's medium). Also check out the Katabatic Gear puffer below, which is considerably warmer. I do not get cold easily, and I have found the Ghost Whisperer UL works well for me as a warm layer to throw on in camp at high elevation is summer, a mid-layer for hiking in cold conditions, and a mid-layer under the Rab Glaceon Pro in extreme cold.\n\nOther details that make the Ghost Whisperer UL our top pick for ultralight hiking include two very nice zippered hand pockets with a good amount of space to stash little stuff like a three-season hat and some gloves, along with an "
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nIndia is hosting a four-day AI Impact Summit, attended by executives from major AI labs and Big Tech companies. The event aims to lure more AI investment to the country. Meanwhile, a trick has been discovered to hide Google's AI Overviews from search results by typing \"–ai\" at the end of a query. Additionally, the US Pentagon is reconsidering its relationship with Anthropic, an AI company, due to its objections to participating in certain military operations. \n\n## Market & Business Implications\n* The India AI Impact Summit is expected to be attended by 250,000 visitors, including executives from OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state (Article 1).\n* A keyboard trick can be used to dodge Google's AI Overviews by typing \"–ai\" at the end of a query, although it is unclear how long this trick will work (Article 2).\n* The US Pentagon is reconsidering its $200 million contract with Anthropic due to the company's objections to participating in certain military operations (Article 5).\n* TechCrunch Disrupt 2026 is offering Super Early Bird pricing until February 27, with savings of up to $680 on individual passes (Article 4).\n* Extracting information from PDFs remains a challenge for AI models, with even state-of-the-art models often summarizing or hallucinating contents instead of extracting information (Article 3).\n\n## Beginner-Friendly Summary\nIndia is having a big meeting about artificial intelligence, or AI, to try to get more companies to invest in the country. There's a way to stop Google from showing AI summaries when you search for something online. The US military is having a problem with an AI company called Anthropic because the company doesn't want to help with certain military actions. These are some of the big things happening in the world of AI right now.",
    "articles": [
      {
        "title": "All the important news from the ongoing India AI Impact Summit",
        "link": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
        "published": "Sun, 22 Feb 2026 17:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "With an eye toward luring more AI investment to the country, India is hosting a four-day AI Impact Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state.\n\nThe event, which expects 250,000 visitors, will see Alphabet CEO Sundar Pichai, OpenAI CEO Sam Altman, Anthropic CEO Dario Amodei, Reliance Chairman Mukesh Ambani, and Google DeepMind CEO Demis Hassabis in attendance.\n\nIndia’s prime minister, Narendra Modi, is scheduled to deliver a speech with French President Emmanuel Macron on Thursday.\n\nHere are all the key updates from the event:\n\nDrop 12/14: Models, products, impact – today something different, very different. Launching Sarvam Kaze, our foray into getting our models into the your hands with our devices – designed and built here in India! pic.twitter.com/8RnqO16Idg — Pratyush Kumar (@pratykumar) February 17, 2026\n\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart.”"
      },
      {
        "title": "How to Hide Google’s AI Overviews From Your Search Results",
        "link": "https://www.wired.com/story/how-to-hide-google-ai-overviews-from-your-search-results/",
        "published": "Sun, 22 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Going online in 2026 means subjecting yourself to a relentless bombardment of generative AI tools. How about a few AI agents to get you started? Do you want to use this chatbot sidebar? Would you like every search query to be answered with an AI summary? While there’s no off switch to avoid this smorgasbord of AI tools entirely, there is one keyboard trick you can use to dodge Google’s AI Overviews for a brief respite.\n\nIf you don’t want to see an AI-generated summarization of webpage links when you use Google Search, you can type “–ai” at the end of your query. It’s an option WIRED readers highlighted under a recent article about scams found in Google’s AI Overviews. I’ve thoroughly enjoyed using this nifty addendum over the past week, and I wish Google offered a permanent toggle with similar zapping capabilities.\n\n“People find Search more helpful with AI Overviews, and they're coming back to search more as a result,” a Google spokesperson tells WIRED. “We offer a ‘web’ filter to see links only, but people only use it for a tiny fraction of searches.” The spokesperson compared AI Overviews to other features baked into the search results, like knowledge panels, that can’t be removed.\n\nIf you want to try this out, you can put any combination of letters or numbers attached to an en dash, like “–1” or “–z,” at the end of your Google search, and it works just the same, as reported by PCMag. It prevents AI Overviews from appearing completely. The en dash function in Google is designed to remove whatever topic you attach to it from the search results. The removal of AI Overviews seems incidental, and it’s unclear how long this trick will stick around. After typing in a result, you can also tap on the “Web” tab—sometimes hidden under “More”—right below the search bar to see site links.\n\nIn my tests, the –ai trick appears to be limited to search queries in computer browsers. When I tried it in the Safari and Chrome apps on iOS, Google’s AI-generated “web guide” still popped"
      },
      {
        "title": "How many AIs does it take to read a PDF?",
        "link": "https://www.theverge.com/ai-artificial-intelligence/882891/ai-pdf-parsing-failure",
        "published": "2026-02-23T06:00:00-05:00",
        "source": "AI | The Verge",
        "text": "is an investigations editor and feature writer covering technology and the people who make, use, and are affected by it. Since joining The Verge in 2014, he has won a Loeb Award for feature writing, among others.\n\nLast November, the House Oversight Committee had just released 20,000 pages of documents from the estate of Jeffrey Epstein, and Luke Igel and some friends were clicking around, trying to follow the threads of conversation through garbled email threads and a PDF viewer that was, frankly, “gross.” In the coming months, the Department of Justice would release its own batches of files, more than three million of them — again, all PDFs.\n\nThis was a problem. While the Department of Justice had run optical character recognition over the text, it was not very good, Igel said, rendering the files more or less unsearchable.\n\n“There was no interface the government put out that allowed you to actually see any sort of summary of things like flights, things like calendar events, things like text messages. There was no real index. You just had to get lucky and hope that the document ID that you were looking at contains what you’re looking for,” said Igel, cofounder of the AI video editing startup Kino. What if, Igel thought, they built a Gmail clone to view and search all this correspondence in a more intuitive way?\n\nTo do this, they would need to extract the information contained in PDFs, which is far less straightforward than it might sound. Despite rapid progress in AI’s ability to build complex software and solve advanced physics problems, the ubiquitous format of PDF remains something of a grand challenge. Edwin Chen, the CEO of the data company Surge, includes it among AI’s “unsexy failures” limiting real-world usefulness. Last year, he found that even state-of-the-art models asked to extract information from a PDF will instead summarize it, confuse footnotes with body text, or outright hallucinate contents. In a half-joking timeline of AI development, the researc"
      },
      {
        "title": "6 days left to lock in the lowest TechCrunch Disrupt 2026 rates",
        "link": "https://techcrunch.com/2026/02/22/6-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-rates/",
        "published": "Sun, 22 Feb 2026 15:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Super Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\n\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% off with community passes before prices increase. Register here.\n\nFrom October 13-15 at San Francisco’s Moscone West, TechCrunch will bring together 10,000 founders, investors, operators, and innovators for three focused days built around launching, scaling, and shaping what’s next in tech.\n\nWhat’s at Disrupt?\n\nDisrupt is where you get:\n\nDirect access to founders, VCs, and operators actively building.\n\nConversations that turn into funding, partnerships, and key hires.\n\nTactical insights you can apply immediately.\n\nEarly visibility into where tech is heading next.\n\nImage Credits:Slava Blazer Photograpy\n\nYou’ll see 300+ exhibiting startups debut tomorrow’s breakthroughs, experience the high-stakes Startup Battlefield 200 pitch competition — where one standout company wins a $100,000 equity-free prize — and take part in curated networking designed to drive real outcomes.\n\nYou’ll also hear insights from some of the most influential voices in tech, including WordPress co-founder Matt Mullenweg, General Motors CEO Mary Barra, and legendary VC Vinod Khosla. Keep an eye on the event page for the agenda drop.\n\nMaximize your experience as a founder or investor\n\nFounder Pass: Built to help you scale faster with the right insights and connections\n\nInvestor Pass: Designed to help you discover breakout startups and expand your portfolio\n\nSecure your pass before rates increase\n\nSix days remain to secure the lowest rate of the year. Lock it in before February 27 at 11:59 p.m. PT. Register here.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, an"
      },
      {
        "title": "AI Safety Meets the War Machine",
        "link": "https://www.wired.com/story/backchannel-anthropic-dispute-with-the-pentagon/",
        "published": "Fri, 20 Feb 2026 17:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "When Anthropic last year became the first major AI company cleared by the US government for classified use—including military applications—the news didn’t make a major splash. But this week a second development hit like a cannonball: The Pentagon is reconsidering its relationship with the company, including a $200 million contract, ostensibly because the safety-conscious AI firm objects to participating in certain deadly operations. The so-called Department of War might even designate Anthropic as a “supply chain risk,” a scarlet letter usually reserved for companies that do business with countries scrutinized by federal agencies, like China, which means the Pentagon would not do business with firms using Anthropic’s AI in their defense work. In a statement to WIRED, chief Pentagon spokesperson Sean Parnell confirmed that Anthropic was in the hot seat. “Our nation requires that our partners be willing to help our warfighters win in any fight. Ultimately, this is about our troops and the safety of the American people,” he said. This is a message to other companies as well: OpenAI, xAI and Google, which currently have Department of Defense contracts for unclassified work, are jumping through the requisite hoops to get their own high clearances.\n\nThere’s plenty to unpack here. For one thing, there’s a question of whether Anthropic is being punished for complaining about the fact that its AI model Claude was used as part of the raid to remove Venezuela's president Nicolás Maduro (that’s what’s being reported; the company denies it). There’s also the fact that Anthropic publicly supports AI regulation—an outlier stance in the industry and one that runs counter to the administration’s policies. But there’s a bigger, more disturbing issue at play. Will government demands for military use make AI itself less safe?\n\nResearchers and executives believe AI is the most powerful technology ever invented. Virtually all of the current AI companies were founded on the premise that i"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nPT Bukit Makmur Mandiri Utama (BUMA) has secured a long-term contract with PT Adaro Indonesia for operations at the South Tutupan Mine in Indonesia. The US has introduced a new global 15% tariff on all imports, causing concern among European trade partners. Florida's economy is thriving, with a significant wealth migration of over $4 million per hour. OpenAI is expanding its enterprise market presence through partnerships with major consulting firms. Airlines have halted flights to Puerto Vallarta, Mexico, due to violence following the killing of a cartel leader.\n\n## Market & Business Implications\n* BUMA has secured a contract with Adaro Indonesia to manage the removal of approximately 239 million bank cubic metres of overburden and the extraction of 44 million tonnes of coal at the South Tutupan Mine (Article 1).\n* The US has introduced a new global 15% tariff on all imports, effective immediately, which may impact trade deals with European partners (Article 2).\n* Florida's economy is experiencing significant growth, with over $4 million in wealth flowing into the state every hour, and the state aims to become a top-10 economy by 2030 (Article 3).\n* OpenAI has launched the \"Frontier Alliance\" program, partnering with major consulting firms to help enterprises integrate AI into core business processes (Article 4).\n* Airlines have canceled flights to Puerto Vallarta, Mexico, due to violence and security concerns following the killing of a cartel leader (Article 5).\n\n## Beginner-Friendly Summary\nSome big things are happening in the world of money and business. A company called BUMA got a big contract to work on a mine in Indonesia. The US government has introduced a new tax on things imported from other countries, which might cause problems for trade with Europe. The state of Florida in the US is doing very well, with lots of money and people moving there. A company called OpenAI is working with big consulting firms to help businesses use artificial intelligence. And some airlines have stopped flying to a city in Mexico because it's not safe right now.",
    "articles": [
      {
        "title": "BUMA secures contract with Adaro at South Tutupan mine in Indonesia",
        "link": "https://finance.yahoo.com/news/buma-secures-contract-adaro-south-135220800.html",
        "published": "2026-02-23T13:52:20Z",
        "source": "Yahoo Finance",
        "text": "PT Bukit Makmur Mandiri Utama (BUMA), BUMA International Group’s key subsidiary, has secured a long-term contract with PT Adaro Indonesia for operations at the South Tutupan Mine in South Kalimantan, Indonesia.\n\nThe agreement is set to commence on 1 April 2026 and will continue until 31 December 2030.\n\nThe contract outlines that BUMA will manage the removal of approximately 239 million bank cubic metres of overburden and the extraction of 44 million tonnes (mt) of coal, equating to average annual volumes of 50.5 million bank cubic metres and 9.3mt of coal, respectively.\n\nIt further strengthens the two companies' partnership, which has been in place for more than two decades, and enhances BUMA's revenue stability and long-term earnings.\n\nBUMA president director Ronald Sutardja: “We are pleased to announce this significant contract with Adaro Indonesia, one of our valued long-term partners.\n\n“The contract is a testament to BUMA's consistent operational delivery and our ability to manage technically complex mining operations safely and reliably. It strengthens our contracted earnings visibility and reinforces our position as Indonesia's trusted mining services partner.”\n\nBUMA International Group, established in 1990, operates in Indonesia, Australia and the US. It focuses on four main areas: mining services, mine ownership, social enterprise and technology.\n\nThe group expanded its operations into mine ownership in 2024 by acquiring Atlantic Carbon Group. In the same year, it also ventured into future-facing commodities with the acquisition of a stake in Australian company 29Metals, which specialises in copper and base metals.\n\nBUMA was established in 1998 and provides mining services to coal producers in Indonesia.\n\n\"BUMA secures contract with Adaro at South Tutupan mine in Indonesia\" was originally created and published by Mining Technology, a GlobalData owned brand.\n\n\n\n"
      },
      {
        "title": "Europe hits back at 'pure tariff chaos' from the U.S., warning trade deals are at risk",
        "link": "https://www.cnbc.com/2026/02/23/trump-15percent-global-tariff-europe-eu-uk-reaction.html",
        "published": "Mon, 23 Feb 2026 11:30:25 GMT",
        "source": "US Top News and Analysis",
        "text": "In this article DJT Follow your favorite stocks CREATE FREE ACCOUNT\n\nU.S. President Donald Trump meets with European Commission President Ursula von der Leyen (not pictured), in Turnberry, Scotland, Britain, July 27, 2025. Evelyn Hockstein | Reuters\n\nEurope has warned that trade deals struck with the U.S. could now be at risk after President Donald Trump unveiled a new global 15% tariff on all imports at the weekend. Trump's move came after the U.S. Supreme Court on Friday struck down his global tariffs policy, implemented last spring, that had upset the long-standing global trading order. The president reacted to the Supreme Court's judgment by initially announcing a new universal 10% levy, using a different legal framework for the latest tariffs, but then increased the global tariff rate to 15% — the legal maximum which can be in place for 150 days before Congressional approval is required. The new import duties are \"effective immediately,\" Trump said in a Truth Social post on Saturday. Officials in Europe and London expressed alarm and consternation at the latest upheaval in global trade relations, saying Trump's new tariff policy could upend trade deals signed with the U.S. last year. They asked for more clarity from the White House as to what the new tariff policy framework means in practice for their respective trade deals, which saw most EU exports to the States hit with a 15% duty, and those from the U.K. slapped with a 10% levy.\n\nwatch now\n\n\"Pure tariff chaos from the U.S. administration,\" the Chair of the European Parliament's committee on International Trade, Bernd Lange, reacted to the White House on Sunday. \"No one can make sense of it anymore — only open questions and growing uncertainty for the EU and other U.S. trading partners,\" Lange wrote on social media platform X. \"Do new tariffs ... not constitute a breach of the deal? Regardless, no one knows whether the US will adhere to it – or even be able to,\" Lange said, adding that \"clarity and legal cer"
      },
      {
        "title": "Florida Chamber CEO says high-tax states are in a ‘death spiral’ as $4M-an-hour wealth migration accelerates",
        "link": "https://www.foxbusiness.com/economy/florida-chamber-ceo-says-high-tax-states-death-spiral-4m-an-hour-wealth-migration-accelerates",
        "published": "Mon, 23 Feb 2026 06:00:24 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Behind Florida’s fine sand beaches and bright green palm trees, a roaring and thriving economy isn’t just running on sunshine; it’s a direct result of a \"secret sauce\" that combines aggressive private-sector growth with a stark fiscal contrast to the policies of high-tax, Democratic-led states.\n\nWhile hubs like New York and California descend into what Florida Chamber of Commerce President and CEO Mark Wilson calls a \"death spiral,\" the Sunshine State is officially open for business as a global superpower. With more than $4 million in wealth flowing across its borders every single hour, Florida has leapfrogged Spain to become the 15th-largest economy in the world — and Wilson says the state is just getting started.\n\n\"Part of the secret sauce in Florida is that we're all on the same page,\" Wilson told Fox News Digital. \"The business community, our elected leaders, we understand that economic growth — growing the private sector and shrinking the public sector — that's good for everyone in Florida. So we have 23.5 million people here, and we want to create economic opportunity and good jobs for everyone who wants to be in Florida.\"\n\n\"I always say, if Florida was a stock, I'd be investing everything I had in it. It's because of our economic diversification strategy and our focus on growing business and growing jobs,\" he continued.\n\nA.I. GIANT PALANTIR MOVES ITS HEADQUARTERS TO FLORIDA AS TECH COMPANY EXODUS CONTINUES\n\nWilson provided the most current statistics around Florida’s population and wealth migration, which began in the early post-pandemic period. The number of new residents moving to the state every day has decreased from a peak of 1,000 to between 500 and 600 people, while the amount of income has remained the same at just over $4 million, \"24 hours a day, nights, weekends, holidays included.\"\n\nThe Chamber’s 2030 blueprint aims to raise Florida’s economy to a top-10 spot by that landmark year, and Wilson remained confident in the state’s ability to accomplish"
      },
      {
        "title": "OpenAI deepens partnerships with consulting giants to push enterprise AI beyond pilot",
        "link": "https://finance.yahoo.com/news/openai-deepens-partnerships-consulting-giants-133507621.html",
        "published": "2026-02-23T13:35:07Z",
        "source": "Yahoo Finance",
        "text": "Feb 23 (Reuters) - OpenAI (OPAI.PVT) is expanding its push into the enterprise market by teaming up with four of the world’s largest consulting firms, betting that a more hands-on approach will ‌help corporate clients move beyond pilot projects to full-scale AI deployments.\n\nThe company said on Monday ‌it had launched the so-called “Frontier Alliance,” a program built around its new Frontier platform and anchored by BCG, McKinsey, Accenture and ​Capgemini. The initiative pairs OpenAI’s forward-deployed engineers with consulting firms to help companies integrate AI agents into core business processes such as software development, sales and customer support.\n\nMore from Yahoo Scout Who are OpenAI's main competitors in enterprise AI? How does OpenAI plan to help enterprises scale AI? What challenges do companies face with AI deployment? What is OpenAI's new Frontier Alliance program?\n\nThe move follows months of Chief Executive Sam Altman emphasizing selling to enterprise clients as a priority for the AI lab. In December, OpenAI hired former Slack CEO ‌Denise Dresser as chief revenue officer.\n\nWhile ⁠OpenAI has previously worked with consulting firms to sell its technology, Dresser said the new partnership is designed to help companies embed AI into core workflows rather than ⁠run isolated experiments.\n\nEnterprises “don't just need caution. They actually need a path, and they need help so that they can grow and adopt this technology,” Dresser said in an interview.\n\nUnder the alliance, OpenAI’s engineers will work alongside consulting teams ​to train ​staff and support implementations. The Frontier platform includes a “context ​layer” designed to connect disparate corporate data ‌and applications, a common obstacle to AI adoption. Companies can build AI agents that share skills and memory across workflows, while managing them through an observability system. Products such as ChatGPT Enterprise are also part of the offering.\n\n“Companies have realized that siloed AI deploym"
      },
      {
        "title": "Airlines halt Puerto Vallarta flights after violence following Mexican cartel leader's killing",
        "link": "https://www.cnbc.com/2026/02/23/puerto-vallarta-flights-mexico.html",
        "published": "Mon, 23 Feb 2026 13:38:34 GMT",
        "source": "US Top News and Analysis",
        "text": "Smoke billows from burning vehicles amid a wave of violence, with torched vehicles and gunmen blocking highways in more than half a dozen states, following a military operation in which a government source said Mexican drug lord Nemesio Oseguera, known as \"El Mencho,\" was killed, in Puerto Vallarta, Jalisco, Mexico, February 22, 2026, in this screen grab obtained from a social media video.\n\nU.S. and Canadian airlines halted flights to Puerto Vallarta, Mexico, and some to Guadalajara after violence broke out in the country in the wake of the Mexican army's killing of a cartel leader.\n\nThe U.S. State Department on Sunday told U.S. citizens to shelter in place, citing \"ongoing security operations and related road blockages and criminal activity.\"\n\nAir Canada , American Airlines , Delta Air Lines , Southwest Airlines , United Airlines and others canceled flights to Puerto Vallarta, a popular tourist destination on Mexico's Pacific coast, and to Guadalajara, which is also in the Jalisco state. Airlines waived change fees for affected travelers.\n\nSeveral Mexican states also canceled school on Monday after the country's army killed Nemesio Rubén Oseguera Cervantes. Known as \"El Mencho,\" he led one of fastest-growing criminal networks in Mexico, notorious for trafficking fentanyl, methamphetamine and cocaine to the United States and staging brazen attacks against government officials who challenged it, the Associated Press reported.\n\nHe was killed during a shoot-out in his home state of Jalisco, the AP said."
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe city of Milan is providing services to integrate migrants into society, despite the Italian government's efforts to limit new arrivals. A son of the late Zimbabwean president Robert Mugabe has been charged with attempted murder in Johannesburg. President Trump has announced plans to raise global tariffs from 10% to 15%. The Italian government is also seeking to restrict charities performing search and rescue missions to help migrants in the Mediterranean Sea. \n\n## Market & Business Implications\n* Novo Nordisk's CagriSema trial has dealt a blow in the obesity drug battle with Eli Lilly, according to Reuters.\n* President Trump plans to raise global tariffs from 10% to 15%, as announced on Saturday, which may force Congress to take ownership of the policy.\n* The Italian government is spending tens of millions of euros to fund the Tunisian and Libyan coast guards to prevent irregular migration across the Mediterranean Sea to Italy, as reported by NPR.\n\n## Beginner-Friendly Summary\nThere's a city in Italy called Milan that is helping migrants settle in, even though the Italian government is trying to stop more migrants from coming. A son of a former president of Zimbabwe has been accused of trying to kill someone in South Africa. The president of the United States, Trump, wants to increase taxes on things imported from other countries. The Italian government is also trying to stop charities from helping migrants at sea.",
    "articles": [
      {
        "title": "In the shadow of the Olympics, migrants search for a welcome in Milan",
        "link": "https://www.npr.org/2026/02/23/nx-s1-5719485/italy-migrants-milan",
        "published": "Mon, 23 Feb 2026 08:25:36 -0500",
        "source": "NPR Topics: World",
        "text": "In the shadow of the Olympics, migrants search for a welcome in Milan\n\ntoggle caption Valerio Muscella for NPR\n\nMILAN — Three Afghan men stand together in the freezing fog outside of Milan's central train station on a recent night — their first moments in Italy. It took two of them a year of clandestine border crossings and journeys in smugglers' vans to get to this country where they will claim asylum.\n\nThe third Afghan man fled to here from Germany, where he had lived and learned the language for three years, before the government hardened its stance on irregular migration and allowed deportations of asylum seekers from Afghanistan and Syria.\n\nAs Europe's political climate darkens against refugees, asylum seekers and economic migrants, with governments including that of Italian Prime Minister Giorgia Meloni focusing resources on limiting new arrivals, Milan is taking a stand for a different approach. The city, led by a mayor from a center-left political party, provides services and programs to try to integrate the people arriving into society.\n\ntoggle caption Valerio Muscella for NPR\n\n\"Milan is and wants to be an open city — open to the world and to change,\" says Lamberto Bertolé, Milan's commissioner for health and welfare. \"This idea of Europe as a fortress that is closing is pointless because people find ways to enter anyway.\"\n\nSponsor Message\n\nMeloni's government is spending tens of millions of euros to fund the Tunisian and Libyan coast guards to try to prevent irregular migration across the Mediterranean Sea to Italy. These patrols sometimes use violent tactics to stop the smugglers' boats, endangering those on board. Many migrants are placed in squalid detention centers in Libya where the United Nations and human rights groups have documented the widespread use of torture and abuse.\n\nThe Italian government is also seeking ever greater restrictions on charities performing search and rescue missions to help migrants in the Mediterranean Sea.\n\ntoggle caption V"
      },
      {
        "title": "Novo Nordisk's CagriSema trial deals blow in obesity drug battle with Eli Lilly - Reuters",
        "link": "https://news.google.com/rss/articles/CBMi3wFBVV95cUxPNzVRR1I3NEkySHJVcHBNVDNZcWFpSkZxeWwyUFZPb0V2Z2xON2p2N0dfV3oyNFFJaUx3MTR4cll0dndYbFRsS09LNklPazZwY1ZPdFo4LTRfNkF6SGJwX1NUdkgxZXdWcjVpLXZ5TUZEblhwN3R0eFNDSFV3WGFnWHkyU3VUOFE3Wjc4Qmh4MXBYaGJzXzlLdFF2cmlxTFRTaUIwMWN6MEdlWENVRm01Z3RoXzJOeVlKYnhkX1FnRmFWSkV2c3lSR09FZ0N4RTkyemM1UDZSd3dfT1AyZHE0?oc=5",
        "published": "Mon, 23 Feb 2026 09:41:01 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Robert Mugabe’s son charged with attempted murder over Johannesburg shooting",
        "link": "https://www.theguardian.com/world/2026/feb/23/robert-mugabe-son-bellarmine-mugabe-charged-with-crimes",
        "published": "Mon, 23 Feb 2026 13:48:51 GMT",
        "source": "World news | The Guardian",
        "text": "A son of the late Zimbabwean president Robert Mugabe has been charged with attempted murder after a 23-year-old man was allegedly shot in the back on 19 February in an upmarket area of Johannesburg.\n\nBellarmine Chatunga Mugabe, 28, appeared in court on Monday for a brief hearing alongside co-accused Tobias Mugabe Matonhodze. Mugabe’s lawyer Sinenhlanhla Mnguni declined to comment when asked by reporters whether the two men were related. Mnguni said he would request bail for his clients at the next hearing on 3 March.\n\nMugabe and his older brother Robert Junior became notorious in the 2010s for sharing their lavish lifestyles online. In 2017, the younger Mugabe posted a photograph of his watch on Instagram with the caption: “$60,000 on the wrist when your daddy run the whole country ya know!!!” Shortly after, a video circulated of him dousing the watch with champagne.\n\nA state prosecutor said at the hearing on Monday that the gun allegedly used in the shooting had not yet been found. He added that investigations were “far from over”.\n\nMugabe and Matonhodze, 33, have also been charged with obstructing justice, illegal possession of a firearm and ammunition, contraventions of the Immigration Act on suspicion of being in South Africa illegally, and theft, said Magaboke Mohlatlole, a national prosecuting authority spokesperson.\n\nRegarding the theft charge, Mohlatlole said: “After [the alleged victim] got shot, he tried to flee. He went outside of the gate and then he fell. After falling, one of the accused went and took the remote [for the gate] from him.”\n\nThe man who was shot is still in hospital and is being watched over by police, a police spokesperson, Dimakatso Nevhuhulwi, told the national broadcaster SABC before the hearing. When the men were arrested, police said they believed the victim was an employee at the house in Hyde Park, a plush suburb where South Africa’s president, Cyril Ramaphosa, also has a home.\n\nRobert Mugabe ruled Zimbabwe for almost 40 years unt"
      },
      {
        "title": "The key changes being made to special educational needs - at a glance",
        "link": "https://www.bbc.com/news/articles/cwyke5n1z4po?at_medium=RSS&at_campaign=rss",
        "published": "Mon, 23 Feb 2026 12:47:38 GMT",
        "source": "BBC News",
        "text": "All of these phrases will become crucial to anyone working out how they'll be affected by the new system, which the education secretary says will get support to children with SEND \"when they need it, as routine and without a fight.\""
      },
      {
        "title": "Trump to raise global tariffs. And, most say the state of the union is weak, poll says",
        "link": "https://www.npr.org/2026/02/23/g-s1-111152/up-first-newsletter-trump-tariffs-china-state-of-the-union-winter-games-fcc",
        "published": "Mon, 23 Feb 2026 07:30:48 -0500",
        "source": "NPR Topics: World",
        "text": "Trump to raise global tariffs. And, most say the state of the union is weak, poll says\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nPresident Trump announced Saturday that he plans to raise global tariffs from 10% to 15%. The move comes one day after the Supreme Court struck down the president's use of emergency powers to impose tariffs under the International Emergency Economic Powers Act. After the ruling, the president claimed he had the authority to impose a global tariff using some sections of the Trade Act of 1974.\n\ntoggle caption Aaron Schwartz/Getty Images\n\n🎧 These sections are more cumbersome than the sweeping powers Trump previously claimed , NPR's Mara Liasson tells Up First. Some tariffs will only last 150 days before Congress has to weigh in. Others could be permanent, but require months of investigation. The high court's ruling meant that Republicans wouldn't have to defend Trump's extremely unpopular tariffs, Liasson says. But now, Congress will have to show its loyalty to the president by voting to impose new tariffs, which they aren't interested in doing. A vote would force lawmakers to take more ownership of a policy that voters believe has driven up their costs.\n\n, NPR's Mara Liasson tells Up First. Some tariffs will only last 150 days before Congress has to weigh in. Others could be permanent, but require months of investigation. The high court's ruling meant that Republicans wouldn't have to defend Trump's extremely unpopular tariffs, Liasson says. But now, Congress will have to show its loyalty to the president by voting to impose new tariffs, which they aren't interested in doing. A vote would force lawmakers to take more ownership of a policy that voters believe has driven up their costs. 🎧 China has been a major target of Trump's tariffs. NPR's Jennifer Pak, who is in Shanghai, repo"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe cost of attending the Olympics has increased significantly since the 1984 Los Angeles Olympics, with ticket prices now much higher. Florida's economy is thriving, with a significant amount of wealth migrating to the state every hour. Eli Lilly has launched a new form of its obesity drug Zepbound, offering a month's worth of doses in a single pen. The UK is considering its response to US tariffs, with \"nothing off the table\". The Trump administration is struggling to determine how to spend an additional $500 billion on the military.\n\n## Market & Business Implications\n* According to Article 1, the average ticket cost for the 1984 Olympics was $17, which would be $55 today, and only a third of tickets for the 2028 Olympics will cost under $100.\n* As stated in Article 2, Florida's economy is growing, with over $4 million in wealth flowing into the state every hour, and the state aims to become one of the top 10 economies by 2030.\n* Article 4 reports that Eli Lilly's new form of Zepbound, called KwikPen, offers a month's worth of doses in a single pen, with prices starting at $299 per month for the lowest dose level.\n* Article 3 notes that the UK is considering its response to US tariffs, with the UK saying \"nothing is off the table\".\n* Article 5 states that the Trump administration is struggling to determine how to spend an additional $500 billion on the military, with the White House being over two weeks behind its statutory deadline to send its budget proposal to Congress.\n\n## Beginner-Friendly Summary\nThe Olympics are going to be very expensive to attend now. A long time ago, in 1984, it was much cheaper. Florida is doing well and a lot of money is moving there. A company called Eli Lilly made a new way to take a medicine for weight loss. The UK is not happy about some tariffs from the US and is thinking about what to do. The US government is trying to figure out how to spend a lot of extra money on the military.",
    "articles": [
      {
        "title": "Tickets for the 1984 Olympics in L.A. were $3. Could it happen again?",
        "link": "https://www.washingtonpost.com/business/2026/02/22/los-angeles-olympics-ticket-prices/",
        "published": "Sun, 22 Feb 2026 10:00:34 +0000",
        "source": "Business",
        "text": "The day before the Milan Cortina Olympics started earlier this month, Sarah Dunlay pulled out an old Ghirardelli chocolate box holding her ticket stubs from the 1984 Olympics. When Dunlay and her husband, Dennis Kissick, reminisce on the summer the Olympics came to Los Angeles, they note the highlights that many Angelenos still recall — the glorious weather, the remarkable reprieve from L.A.’s normally clogged traffic, the elation as the United States’ medal count piled up each day.\n\nShe also can hardly believe some of the prices on those old ticket stubs. She saw Olympic exhibition baseball at Dodger Stadium for $6. For $16, she saw the world’s best boxers compete. Her track and field tickets cost $33: “It seemed like a lot at the time.” (It’s a little over $100 in today’s dollars.)\n\n“It was all totally fun,” Dunlay said. “The spirit of it all, and the pageantry, and people from different countries.”\n\nNow, the Olympics are headed back to Los Angeles. When the Milan Cortina Games wrap up on Sunday, the world will start to look ahead to the 2028 Summer Olympics in L.A. But ticket prices will be much higher — organizers have said that only a third of tickets will cost under $100, and another third will cost more than $250. The experience of 1984, when many Angelenos were able to see five or 10 Olympic events, would be costly to replicate in 2028. Ask The Post AIDive deeper\n\nBack then, Olympics ticket prices started at $3 (adjusted for inflation, that would be just under $10 today). According to a New York Times article at the time, half the tickets were under $10 — meaning in today’s dollars, half of all tickets were cheaper or around the cost of today’s cheapest seats, which will be $28. The average ticket cost $17 in 1984, which would be $55 today.\n\nIncomes are higher now, but by that measure too, today’s tickets are less affordable. That $10 ticket represented just under an hour of work for the median California worker in 1984. Today, a $100 ticket would cost more "
      },
      {
        "title": "Florida Chamber CEO says high-tax states are in a ‘death spiral’ as $4M-an-hour wealth migration accelerates",
        "link": "https://www.foxbusiness.com/economy/florida-chamber-ceo-says-high-tax-states-death-spiral-4m-an-hour-wealth-migration-accelerates",
        "published": "Mon, 23 Feb 2026 06:00:24 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Behind Florida’s fine sand beaches and bright green palm trees, a roaring and thriving economy isn’t just running on sunshine; it’s a direct result of a \"secret sauce\" that combines aggressive private-sector growth with a stark fiscal contrast to the policies of high-tax, Democratic-led states.\n\nWhile hubs like New York and California descend into what Florida Chamber of Commerce President and CEO Mark Wilson calls a \"death spiral,\" the Sunshine State is officially open for business as a global superpower. With more than $4 million in wealth flowing across its borders every single hour, Florida has leapfrogged Spain to become the 15th-largest economy in the world — and Wilson says the state is just getting started.\n\n\"Part of the secret sauce in Florida is that we're all on the same page,\" Wilson told Fox News Digital. \"The business community, our elected leaders, we understand that economic growth — growing the private sector and shrinking the public sector — that's good for everyone in Florida. So we have 23.5 million people here, and we want to create economic opportunity and good jobs for everyone who wants to be in Florida.\"\n\n\"I always say, if Florida was a stock, I'd be investing everything I had in it. It's because of our economic diversification strategy and our focus on growing business and growing jobs,\" he continued.\n\nA.I. GIANT PALANTIR MOVES ITS HEADQUARTERS TO FLORIDA AS TECH COMPANY EXODUS CONTINUES\n\nWilson provided the most current statistics around Florida’s population and wealth migration, which began in the early post-pandemic period. The number of new residents moving to the state every day has decreased from a peak of 1,000 to between 500 and 600 people, while the amount of income has remained the same at just over $4 million, \"24 hours a day, nights, weekends, holidays included.\"\n\nThe Chamber’s 2030 blueprint aims to raise Florida’s economy to a top-10 spot by that landmark year, and Wilson remained confident in the state’s ability to accomplish"
      },
      {
        "title": "UK says 'nothing is off the table' in response to US tariffs",
        "link": "https://www.bbc.com/news/articles/cx2rv212wwyo?at_medium=RSS&at_campaign=rss",
        "published": "Mon, 23 Feb 2026 14:08:16 GMT",
        "source": "BBC News",
        "text": "The UK had negotiated a 10% tariff deal with the US and would be one of the hardest hit, while countries such as China and Brazil which have higher rates would be better off, according to think tank Global Trade Alert (GTA)."
      },
      {
        "title": "Eli Lilly launches new form of obesity drug Zepbound with a month’s worth of doses in one pen",
        "link": "https://www.cnbc.com/2026/02/23/eli-lilly-launches-zepbound-obesity-drug-pen-one-month-doses.html",
        "published": "Mon, 23 Feb 2026 14:00:14 GMT",
        "source": "Business News",
        "text": "An Eli Lilly & Co. Zepbound injection pen arranged in the Brooklyn borough of New York on March 28, 2024.\n\nEli Lilly on Monday launched a new form of its blockbuster obesity drug, Zepbound, that offers a month's worth of doses in a single pen.\n\nCash-paying patients can get the multi-dose device, called KwikPen, on the company's direct-to-consumer website, LillyDirect. Prices start at $299 per month for the lowest dose level.\n\nThe pen could serve as a more convenient option for some patients, as it reduces the number of devices they have to use in a month to take the drug. Patients can use one pen to take four weekly doses of Zepbound.\n\nCurrently, patients on the treatment use a different single-dose autoinjector device each week. Lilly also offers single-dose vials of Zepbound, which requires users to draw the medication into a syringe and inject themselves.\n\nThe announcement comes as Lilly works to sustain the early success of Zepbound, which has exploded in demand since it first entered the market in late 2023. LillyDirect has been key to Zepbound's growth, and rolling out a new form of the drug on the platform could attract even more patients.\n\nThe torrid growth of Zepbound has helped Eli Lilly seize a majority share of the weight-loss drug market from rival Novo Nordisk. In the company's fourth quarter, Zepbound brought in $4.2 billion in U.S. revenue, a 122% spike from the previous year.\n\nIn a release, Lilly said the Food and Drug Administration approved a label expansion for Zepbound to include the multi-dose device.\n\nThe KwikPen is already used for other drugs, such as Lilly's popular diabetes medication, Mounjaro.\n\n\"As part of our commitment to supporting people living with obesity in their weight management journey, we are introducing a new option with the Zepbound KwikPen, a device trusted by patients globally and in the United States for other Lilly medicines,\" said Ilya Yuffa, the president of Lilly USA and Global Customer Capabilities, in the release."
      },
      {
        "title": "Trump aides struggle with how to spend $500 billion more on military",
        "link": "https://www.washingtonpost.com/business/2026/02/21/trump-hegseth-budget-military/",
        "published": "Sun, 22 Feb 2026 04:43:00 +0000",
        "source": "Business",
        "text": "Trump administration officials have struggled to figure out how to increase U.S. military spending by a whopping $500 billion in their forthcoming budget, slowing the overall White House spending plan, four people familiar with the matter said. President Donald Trump last month agreed to a roughly 50 percent funding boost sought by Pete Hegseth, the defense secretary, in the White House’s annual budget proposal. The idea ran into internal criticism from several other officials, including White House budget chief Russell Vought, who warned about its potential impact on the widening federal deficit, said the people, who spoke on the condition of anonymity to reflect internal deliberations.\n\nSince Trump agreed to the higher number, White House aides and defense officials have run into logistical challenges surrounding where to put the money, because the amount is so large, the people said. The White House is more than two weeks behind its statutory deadline to send its budget proposal to Congress, in part because it is unclear how precisely to spend the additional $500 billion, according to the people familiar with the matter.\n\nSenior Pentagon officials have consulted with former senior defense officials as they grapple with the challenge, said one person familiar with the matter. Part of the discussion centers on how much emphasis should go into buying weapons the military already uses versus investing in high-end technologies, such as artificial intelligence, that the Pentagon envisions as part of its future.\n\nThe roughly $900 billion defense budget approved last year was the largest in U.S. history. While other nations have also increased their military spending, the United States already spends more on defense than the next nine countries combined, according to 2023 data from the Peter G. Peterson Foundation, a nonpartisan think tank.\n\n“I’m not surprised they’re having difficulty doing that,” said G. William Hoagland, senior vice president at the Bipartisan Policy "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market has seen various developments, including the comparison of two ETFs, SIL and SGDM, which track silver and gold miners, respectively. RingCentral and Five9, software companies, have seen their shares surge after alleviating concerns about the impact of artificial intelligence on their business models. Texas Roadhouse's shares have risen despite missing estimates due to high beef prices. Vulcan Materials Company is set to webcast its Investor Day event, and IMG Wealth Management has sold $4 million of First Trust Capital Strength ETF.\n\n## Market & Business Implications\n* The SIL and SGDM ETFs have different underlying focuses, with SIL tracking silver miners globally and SGDM tracking gold producers primarily in the U.S. and Canada (Article 1).\n* RingCentral and Five9 have seen their shares rise after topping Wall Street's estimates and issuing upbeat guidance, alleviating concerns about the impact of artificial intelligence on their business models (Article 2).\n* Texas Roadhouse's shares have risen despite missing estimates, with the company's strong comparable restaurant sales and no change in management's commodity inflation outlook for the year contributing to the increase (Article 4).\n* Vulcan Materials Company will webcast its Investor Day event on March 12, 2026, featuring presentations from the company's management team (Article 3).\n* IMG Wealth Management has sold 48,466 shares of First Trust Capital Strength ETF, reducing its stake by approximately $4.5 million (Article 5).\n\n## Beginner-Friendly Summary\nThere have been some changes in the stock market. Two investment funds, SIL and SGDM, are being compared. They invest in companies that mine silver and gold. Some software companies, like RingCentral and Five9, have seen their stock prices go up after they showed that they can still do well even with new artificial intelligence technologies. A restaurant company, Texas Roadhouse, had some problems but its stock price still went up. A building materials company, Vulcan, is going to have a meeting with investors. Another company, IMG Wealth, sold some of its investments in a fund called First Trust Capital Strength ETF.",
    "articles": [
      {
        "title": "Gold vs. Silver Showdown: Should You Buy SGDM or SIL ETF?",
        "link": "https://www.fool.com/coverage/etfs/2026/02/23/gold-vs-silver-showdown-should-you-buy-sgdm-or-sil-etf/?.tsrc=rss",
        "published": "Mon, 23 Feb 2026 14:00:26 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Explore how these miner ETFs differ in risk, cost, and portfolio makeup -- key factors for refining a precious metals strategy.\n\nThe Global X - Silver Miners ETF (SIL +4.39%) and the Sprott Gold Miners ETF (SGDM +1.93%) offer concentrated exposure to mining companies, but their underlying focus diverges: SIL zeroes in on silver miners globally, while SGDM tracks gold producers primarily in the U.S. and Canada.\n\nThe two ETFs differ most in metal exposure, recent performance, and fund size, with SIL leading in recent returns and assets under management (AUM), while SGDM offers a lower expense ratio and milder historical drawdowns. This comparison unpacks how their cost, risk, performance, and portfolio details stack up for investors looking to invest in precious metals.\n\nSnapshot (cost & size)\n\nMetric SIL SGDM Issuer Global X Sprott Expense ratio 0.65% 0.50% 1-yr return (as of 2026-02-20) 198.5% 157.7% Dividend yield 1.0% 0.95% Beta 0.96 0.73 AUM $6.7 billion $829.2 million\n\nBeta measures price volatility relative to the S&P 500; beta is calculated from five-year weekly returns. The 1-yr return represents total return over the trailing 12 months.\n\nSGDM is slightly more affordable, charging a 0.50% expense ratio versus SIL’s 0.65%. That’s one difference that may appeal to cost-conscious investors.\n\nPerformance & risk comparison\n\nMetric SIL SGDM Max drawdown (5 y) -56.79% -49.68% Growth of $1,000 over 5 years $2,515 $3,237\n\nWhat's inside\n\nSGDM targets gold miners, allocating 100% to basic materials and holding 40 positions as of its most recent data. Its largest stakes are in Agnico Eagle Mines (AEM +1.69%), Newmont (NEM 2.61%), and Wheaton Precious Metals (WPM +3.47%), with a portfolio focused on North American gold producers. Canada constitutes 75% of its portfolio. The fund has been operating for 11.6 years.\n\nSIL, in contrast, is also 100% basic materials, but with a strict focus on silver. Its top holdings include Wheaton Precious Metals, Pan American Silver (PAAS +"
      },
      {
        "title": "Beaten-down software stocks RingCentral and Five9 rally as earnings quell some AI concerns",
        "link": "https://www.cnbc.com/2026/02/20/ringcentral-ring-five9-fivn-rally-ai-sell-off.html",
        "published": "Fri, 20 Feb 2026 23:39:30 GMT",
        "source": "Earnings",
        "text": "Shares of RingCentral and Five9 surged on Friday after earnings from both software firms alleviated recent fears that artificial intelligence is eating away at their business models.\n\nRingCentral popped 34%, while Five9 rallied about 12% after topping Wall Street's estimates and issuing upbeat guidance. Both companies, which provide customer service solutions like voice integration, said accelerating AI adoption has boosted demand.\n\nNew AI tools, capable of building apps and websites in a matter of minutes, have spooked investors in recent weeks, leading to a massive selloff across the software sector.\n\nThe worry is that these products, emerging from the likes of Anthropic and OpenAI, will displace the software-as-a-service industry's longstanding business models as firms lean on quicker and more efficient AI tools.\n\nSo far this year, the iShares Expanded Tech-Software Sector ETF tracking the sector has plunged about 23%, led to the downside by Atlassian , Unity Software and Rapid7 , which have shed more than half their value.\n\nSoftware giants Salesforce and Microsoft have dropped 30% and 18%, respectively."
      },
      {
        "title": "VULCAN TO WEBCAST 2026 INVESTOR DAY",
        "link": "https://finance.yahoo.com/news/vulcan-webcast-2026-investor-day-140000005.html?.tsrc=rss",
        "published": "Mon, 23 Feb 2026 14:00:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "BIRMINGHAM, Ala., Feb. 23, 2026 /PRNewswire/ -- Vulcan Materials Company (NYSE: VMC), the nation's largest producer of construction aggregates, today announced that it will webcast its Investor Day event on Thursday, March 12, 2026 at 9:00 a.m. ET. The presentation will be led by Ronnie Pruitt, Vulcan's Chief Executive Officer, and will include presentations from other members of the Company's management team.\n\nInvestors and other interested parties are invited to join the virtual event by registering in advance at Vulcan's 2026 Investor Day. The event will be recorded and available for replay approximately two hours after its conclusion on the Company's website.\n\nVulcan Materials Company, a member of the S&P 500 Index with headquarters in Birmingham, Alabama, is the nation's largest producer of construction aggregates – primarily crushed stone, sand and gravel – and a major producer of aggregates-based construction materials, including asphalt mix and ready-mixed concrete. For additional information about Vulcan, visit www.vulcanmaterials.com.\n\nInvestor Contact: Mark Warren (205) 298-3220\n\nMedia Contact: Jack Bonnikson (205) 298-3220\n\nVulcan Materials Company, Birmingham, AL. (PRNewsFoto/Vulcan Materials Company) (PRNewsFoto/) (PRNewsFoto/)\n\nCision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/vulcan-to-webcast-2026-investor-day-302693975.html"
      },
      {
        "title": "Texas Roadhouse gets a pass from Wall Street. What's next might be out of its control",
        "link": "https://www.cnbc.com/2026/02/19/texas-roadhouse-gets-a-pass-from-wall-street-whats-next-might-be-out-of-its-control.html",
        "published": "Fri, 20 Feb 2026 00:04:26 GMT",
        "source": "Earnings",
        "text": "Texas Roadhouse missed Street estimates on both the top and bottom lines in the fourth quarter as high beef prices weighed on profits. But the restaurant chain's strong comparable restaurant sales through the first seven weeks of the first quarter of 2026 paired with no change in management's commodity inflation outlook for the year are keeping shares afloat Thursday evening. Revenue in the quarter ending Dec. 30 increased 3.1% year over year to $1.48 billion, missing the LSEG-complied Wall Street consensus estimate of $1.496 billion. Earnings per share dropped 26% on an annual basis to $1.28, missing expectations of $1.51, LSEG data showed. TXRH YTD mountain Texas Roadhouse YTD Shares of Texas Roadhouse rose about 2.5% in after-hours trading to around $187 per share. The move would erase Thursday's regular-hours trading losses. The stock was already off to a good start to 2026, gaining about 10% as of Thursday's close. Bottom line This was a weak quarter from Texas Roadhouse, but the market was giving it a pass because everyone knew beef costs were going to be an issue. On the surface, we were a little underwhelmed by the comp sales growth this quarter. After delivering 6.1% comp growth in the third quarter and guiding 5.4% growth through the first five weeks of the fourth quarter, sales growth slipped back to 4.2% for the entire quarter, missing analyst forecasts of about 5.2%. The 4.2% increase was driven by a 1.9% increase in traffic and 2.3% increase in average check. The results lagged due to a slowdown as the quarter progressed, with comps sales up 6.1%, 4.8% and 2.2% in October, November, and December, respectively. Adverse weather in December may have weighed on the results. Management also called out a negative impact from the timing of Christmas. Usually, this cadence would spell trouble for a restaurant chain or retailer. Positively, though, sluggishness was a temporary trend. One of the best things that came out of this earnings release was the company "
      },
      {
        "title": "IMG Wealth Sells $4 Million of First Trust Capital Strength ETF",
        "link": "https://www.fool.com/coverage/filings/2026/02/23/img-wealth-sells-4-million-first-trust-capital-strength-etf/?.tsrc=rss",
        "published": "Mon, 23 Feb 2026 13:54:53 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "First Trust Capital Strength ETF tracks U.S. companies with strong balance sheets and stable earnings for lower-volatility exposure.\n\nOn Feb. 5, 2026, IMG Wealth Management, Inc. disclosed in an SEC filing that it sold 48,466 shares of First Trust Capital Strength ETF (FTCS +0.33%).\n\nWhat happened\n\nAccording to a filing with the Securities and Exchange Commission dated Feb. 5, 2026, IMG Wealth Management, Inc. reduced its stake in First Trust Capital Strength ETF by approximately $4.5 million in the fourth quarter. The firm ended the quarter with a disclosed stake in FTCS of $2.3 million, representing 1.5% of its reported assets.\n\nExpand NASDAQ : FTCS First Trust Exchange-Traded Fund - First Trust Capital Strength ETF Today's Change ( 0.33 %) $ 0.32 Current Price $ 98.06 Key Data Points Day's Range $ 97.21 - $ 98.07 52wk Range $ 80.66 - $ 99.21 Volume 6.1\n\nWhat else to know\n\nTop holdings after the filing: NYSEMKT: BUFR: $16.4 million (10.4% of AUM) NYSEMKT: CGDV: $11.4 million (7.3% of AUM) NYSEMKT: BUFQ: $10.0 million (6.4% of AUM) NYSEMKT: BUFD: $8.3 million (5.3% of AUM) NYSEMKT: FTLS: $6.2 million (3.9% of AUM)\n\nAs of Feb. 4, 2026, shares of FTCS were priced at $98.04, up 10.4% over the prior year, underperforming the S&P 500 by 5.1 percentage points.\n\nFTCS carries an annualized dividend yield of 0.98%.\n\nETF overview\n\nMetric Value Total net assets $8.4 billion Price (as of market close 2/4/26) $98.04 Dividend yield 0.98% 1-year total return 10.4%\n\nETF snapshot\n\nInvestment strategy focuses on tracking an index of well-capitalized U.S. companies with strong balance sheets and stable earnings, aiming to deliver capital strength and lower volatility.\n\nPortfolio is primarily composed of common stocks and REITs, with companies selected for capital strength and profitability.\n\nStructured as a passively managed ETF with a transparent portfolio and regular rebalancing, expense ratios, and specific fee data are available in the fund's prospectus.\n\nFirst Trust Capital Stre"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nA fictional 2028 AI memo by Citrini Research imagines a future where AI transforms the economy, leading to mass layoffs and increased adoption of stablecoins. Meanwhile, the Supreme Court has ruled against Trump's tariffs, and Bitcoin's price initially dipped before rebounding. Austria's financial regulator has banned KuCoin's EU exchange from conducting new business due to breaches of Anti-Money Laundering requirements. Standard Chartered projects that the stablecoin market cap will reach $2 trillion by 2028, generating significant demand for US Treasury bills.\n\n## Market & Business Implications\n* Citrini Research's fictional 2028 AI memo suggests that AI could lead to mass layoffs and increased adoption of stablecoins, as companies cut staff and turn to more AI tools to defend profits (Article 1).\n* The Supreme Court's ruling against Trump's tariffs has had a limited impact on the market, with Bitcoin's price initially dipping before rebounding (Article 2).\n* Austria's financial regulator has prohibited KuCoin's EU exchange from conducting new business due to breaches of internal organizational requirements around Anti-Money Laundering (AML) and counter-terrorist financing (CTF) (Article 3).\n* Standard Chartered projects that the stablecoin market cap will reach $2 trillion by 2028, generating $0.8-$1 trillion in new US Treasury bill demand (Article 4).\n* Strategy has bought 592 Bitcoin for $39.8 million, marking its 100th purchase since adopting its Bitcoin-focused treasury strategy in August 2020 (Article 5).\n\n## Beginner-Friendly Summary\nThere's a idea about what the future might look like in 2028, where computers do more work and people lose jobs, which could lead to more people using a type of money called stablecoins. A big court decision didn't change the price of Bitcoin much. A company called KuCoin got in trouble with a regulator in Austria. Some experts think that stablecoins will become very popular and that will affect the way the government sells debt. A company called Strategy bought a lot of Bitcoin, which is a type of money that exists only on computers.",
    "articles": [
      {
        "title": "Fictional 2028 AI memo imagines mass layoffs and stablecoin adoption",
        "link": "https://cointelegraph.com/news/fictional-2028-ai-memo-mass-layoffs-stablecoin-adoption?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 23 Feb 2026 13:50:39 +0000",
        "source": "Cointelegraph.com News",
        "text": "Thematic equity and global macro analysis company Citrini Research has published a new post imagining the world of 2028 that sketches an economy transformed by artificial intelligence.\n\nIn Citrini’s version of near-future history, AI finally delivers on its productivity promise, as companies cut staff, profits surge and stocks roar. The post is framed as a macro memo from June 2028 and has been shared widely on X.\n\nIn Citrini’s scenario, equity markets initially celebrate the efficiency shock. The S&P 500 “flirted with 8000,” and the Nasdaq “broke above 30k,” as investors celebrated a new era of productivity.\n\nBut the mood shifts as laid-off workers stop spending, consumer demand collapses, and companies turn to more AI tools to defend profits. That triggers more layoffs and even weaker demand, becoming a self-reinforcing loop that squeezes the economy’s human core.\n\nNegative feedback loop with no natural brake\n\nIn the future fictional US economy, the top 10% of earners drive more than half of all consumer spending. Product managers and analysts, once making $180,000 a year, are replaced by software.\n\nCitrini calls the result “ghost GDP.” Output surges on paper while wages crumble in reality. Productivity data looks dazzling, yet restaurants and retail chains quietly wither in an economy that grows without paying anyone.\n\nRelated: Vitalik Buterin proposes using AI to strengthen DAO governance\n\nThe breaking point comes in housing, where roughly $13 trillion in mortgages hinge on the assumption of steady employment.\n\nIn 2008, the authors point out, loans were “bad on day one.” In 2028, they were perfectly fine until the world changed, joblessness spiked at 10.2%, and the S&P shed 40% to 60% from its peak. But markets barely flinch, as machine-driven liquidity masks human distress.\n\nAI pushes payments onto crypto rails\n\nCrypto investors are paying attention to where this leaves the world of payments, and what it implies for demand for stablecoins and other crypto asset"
      },
      {
        "title": "Morning Minute: Supreme Court Rules Against Trump Tariffs",
        "link": "https://decrypt.co/358820/morning-minute-supreme-court-rules-against-trump-tariffs",
        "published": "Mon, 23 Feb 2026 13:46:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nCreate an account to save your articles.\n\nCreate an account to save your articles.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors are red but rebounding after a Sunday selloff; BTC at 66.4k\n\nEthereum’s upcoming FOCIL upgrade will make it censorship-resistant\n\nTether’s USDT supply down nearly $4B from local peak\n\nThe Bitcoin ETFs saw nearly $300M in net outflows last week\n\nTokenWorks S2 to debut today\n\n🏛️ Supreme Court Rules Against Trump Tariffs\n\nThe ruling everyone has been waiting on finally dropped Friday.\n\nBut markets largely shrugged it off.\n\n📌 What Happened\n\nThe Supreme Court ruled 6-3 that President Trump’s sweeping “Liberation Day” tariffs exceeded his authority under the International Emergency Economic Powers Act.\n\nChief Justice Roberts wrote in the majority that the administration’s reading of IEEPA would represent a “transformative expansion of the President’s authority over tariff policy” with no precedent in US history.\n\nTrump called the ruling “anti-American” on Truth Social and within hours announced a new 15% global tariff under Section 122 of the Trade Act of 1974, a completely different legal authority.\n\nBitcoin initially dipped to $66,900 on the release, then climbed to nearly $67,800, before settling back near $67,000. Equities actually grinded higher.\n\nThen Sunday night, the selloff came. Bitcoin went as low as $64k, down nearly 5%, as ETH fell below $1,900 and SOL fell below $80.\n\nStock futures are opening red, with the Nasdaq down 0.7%.\n\n🗣️ What They’re Saying\n\n“A negative ruling on tariffs could potentially hurt Treasuries and the dollar, while favoring stocks and crypto.” - Stephen Coltman, Head of Macro, 21Shares\n\n“Reduced tariff revenues mean money printing and debasemen"
      },
      {
        "title": "Austria’s regulator slaps new business ban on KuCoin’s EU exchange",
        "link": "https://cointelegraph.com/news/austria-regulator-slaps-new-business-ban-kucoin-eu?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 23 Feb 2026 13:46:02 +0000",
        "source": "Cointelegraph.com News",
        "text": "Austria’s financial regulator has prohibited KuCoin EU Exchange from conducting new business, citing breaches of internal organizational requirements around Anti-Money Laundering (AML), counter-terrorist financing (CTF) and the observance of financial sanctions.\n\nThe Thursday decision by the Austrian Financial Market Authority (FMA) means KuCoin’s Vienna-based entity cannot onboard new customers or conclude new contracts or products within existing relationships until key compliance functions are “appropriately filled.”\n\nSabina Liu, managing director at KuCoin EU, told Cointelegraph that two compliance professionals holding designated AML and sanctions oversight functions in Austria had “recently departed,” and that such mobility was common in “any regulated industry.”\n\nShe said that KuCoin had already begun recruiting “before the notice was issued,” and had “voluntarily paused new user onboarding and certain trading activities.”\n\nLiu added that the matter remained “contained and limited in scope,” and that the exchange did not expect any “long-term structural impact on [its] European strategy.”\n\nKuCoin’s “compliance-first” Vienna hub\n\nThe move comes just months after Austria granted KuCoin EU a Markets in Crypto Assets Regulation (MiCA) licence, allowing the Seychelles‑headquartered exchange to passport crypto asset services across the European Union and European Economic Area.\n\nKuCoin’s new business ban. Source: FMA\n\nKuCoin has positioned Vienna as its European hub, appointing the former London Stock Exchange Group executive Liu as managing director in January to lead its MiCA-era expansion and pitching the bloc as a “regulatory-first” growth opportunity.\n\nRelated: How Europe’s blockchain sandbox finds innovation in regulation\n\nLiu told Cointelegraph that KuCoin remained “committed to operating strictly within the applicable supervisory framework,” and ensuring compliance with Austrian and EEA regulatory standards.\n\n“Compliance is a long-term commitment,” she said"
      },
      {
        "title": "Stablecoins Set to Scoop Up $1T in T-Bills by 2028: Standard Chartered",
        "link": "https://decrypt.co/358819/stablecoins-set-to-scoop-up-1t-in-t-bills-by-2028-standard-chartered",
        "published": "Mon, 23 Feb 2026 13:15:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Standard Chartered projects the stablecoin market cap will reach $2 trillion by the end of 2028.\n\nThat growth could generate $0.8–$1 trillion in new U.S. Treasury bill demand, rising to $2.2 trillion when including Fed purchases, the bank's analysts said.\n\nThe resulting $0.9 trillion excess demand could allow the Treasury to suspend 30-year bond auctions for three years.\n\nStablecoin issuers could become one of the largest structural buyers of short-term U.S. government debt within the next three years, according to a new report from international banking group Standard Chartered.\n\nGeoff Kendrick, Global Head of Digital Assets Research, and John Davies, U.S. Rates Strategist at Standard Chartered, project that stablecoin market capitalization will reach $2 trillion by the end of 2028, up from roughly $309 billion today, according to CoinGecko data.\n\nThat growth alone would generate roughly $0.8 trillion to $1.0 trillion in incremental demand for U.S. Treasury bills, as issuers hold short-dated government securities as reserves, the analysts said in a note shared with Decrypt.\n\nWhen combined with expected Federal Reserve purchases of $500 billion to $600 billion via Reserve Management Purchases and a similar amount from reinvesting maturing mortgage-backed securities, Kendrick and Davies estimate total new T-bill demand of around $2.2 trillion between now and 2028.\n\n“Our projections suggest USD 0.9tn of excess demand for T-bills if their share of outstanding debt is not increased – in other words, T-bills could become too scarce if no action is taken,” Kendrick and Davies wrote.\n\nThe analysts note that one way to offset the imbalance would be to increase T-bill issuance while reducing long-dated bond supply.\n\n“Shifting USD 0.9tn of T-bond supply to T-bills to cover the excess demand would effectively allow 30Y auctions to be suspended for the next three years,” they wrote.\n\nThe report"
      },
      {
        "title": "Strategy adds 592 BTC for $40M in 100th Bitcoin purchase",
        "link": "https://cointelegraph.com/news/strategy-100th-bitcoin-purchase-592-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 23 Feb 2026 13:42:27 +0000",
        "source": "Cointelegraph.com News",
        "text": "Strategy bought 592 Bitcoin for about $39.8 million last week, marking its 100th purchase since the company adopted its Bitcoin-focused treasury strategy in August 2020.\n\nThe latest purchase brings the company’s total holdings to 717,722 BTC, acquired at an aggregate cost of $54.56 billion, according to a US Securities and Exchange Commission filing on Monday. The newly acquired Bitcoin was purchased at an average price of $67,286 per BTC, inclusive of fees and expenses.\n\nThe purchases were funded through the sale of 297,940 shares of Strategy’s Class A common stock under its at-the-market (ATM) offering program between Tuesday and Sunday. The sales generated net proceeds of about $39.7 million, according to the filing.\n\nStrategy executive chairman Michael Saylor hinted at the milestone ahead of the announcement in a Sunday post on X, sharing a chart of the company’s previous purchases alongside the caption “The Orange Century,” a phrase he has used in reference to Bitcoin’s long-term outlook.\n\nNearly six years of accumulation\n\nAccording to the filing, Strategy did not sell any of its preferred stock under its ATM programs during the reporting period. The company has consistently used equity issuance and other capital market instruments to finance its Bitcoin accumulation.\n\nThe latest purchase extends a streak of weekly acquisitions in 2026, even as Bitcoin has traded below the company’s overall average purchase price of $76,020 per coin.\n\nRelated: Top crypto treasury companies Strategy and Bitmine add to BTC, ETH stacks\n\nStrategy began purchasing Bitcoin in August 2020 with an initial $250 million allocation. Since then, it has steadily expanded its holdings across multiple market cycles, becoming the largest publicly traded corporate holder of Bitcoin.\n\nWith 717,722 BTC now on its balance sheet worth around $47.5 billion at current prices, the company’s exposure to Bitcoin remains central to its corporate strategy and capital structure nearly six years after its f"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-23T14:08:49.031460+00:00"
  }
}