{
  "Tech": {
    "summary": "## Executive Summary\nSnapchat has launched a creator subscription feature in the US, allowing users to buy subscriptions to their favorite creators. Peak Design has introduced a lineup of mobile straps for carrying small gadgets and essentials. OpenAI has released a new coding model, GPT-5.3-Codex-Spark, which runs on non-Nvidia hardware and delivers code at over 1,000 tokens per second. Additionally, an online forum for Homeland Security Investigations officers has been found to contain discussions about their work and criticisms of their colleagues.\n\n## Market & Business Implications\n* Snapchat's creator subscription feature will allow creators to earn more money through exclusive content and priority replies, as stated in Article 1.\n* Peak Design's mobile straps are compatible with any Peak Design or Apple iPhone 17 case, and can carry items such as compact cameras, according to Article 2.\n* OpenAI's GPT-5.3-Codex-Spark model is available to ChatGPT Pro subscribers and select design partners through API access, as mentioned in Article 4.\n* The model delivers code at over 1,000 tokens per second, which is roughly 15 times faster than its predecessor, as reported in Article 4.\n* Rival company Meta also allows creators to offer subscriptions on platforms like Instagram and Facebook, giving users access to exclusive content and badges, as noted in Article 1.\n\n## Beginner-Friendly Summary\nSnapchat is letting users pay to subscribe to their favorite creators. This means creators can make more money by sharing special content with their subscribers. A company called Peak Design made some new straps to help people carry their phones and other small things. OpenAI made a new tool that can write code very quickly. There's also a website where some government workers talk about their jobs and sometimes criticize their coworkers.",
    "articles": [
      {
        "title": "Snapchat launches creator subscription in the U.S.",
        "link": "https://techcrunch.com/2026/02/17/snapchat-launches-creator-subscription-in-the-u-s/",
        "published": "Tue, 17 Feb 2026 14:07:49 +0000",
        "source": "TechCrunch",
        "text": "Social network Snapchat announced today it’s launching creator subscriptions in alpha with select people in the U.S. starting on February 23. The company noted that users will be able to buy subscriptions to creators, including Jeremiah Brown, Harry Jowsey, and Skai Jackson. This will allow users to unlock exclusive content while creating monetization opportunities for creators.\n\nCreators can set their own monthly prices for subscription within the app, while Snap will recommend different tiers to them. The subscription will unlock subscriber-only content, priority replies to a creator’s public Stories, and ad-free consumption for that creator’s Stories.\n\nSnap noted that this is a new way for creators to earn more money besides the existing programs.\n\n“Expanding on existing monetization offerings like the Unified Monetization Program and the Snap Star Collab Studio, Creator Subscriptions introduce a premium layer of connection directly into how Snapchatters already engage with creators across Stories, Chat, and replies,” the company said in a blog post.\n\nSnapchat reached 946 million daily active users, according to the company’s Q4 2025 results. The platform noted during its earnings that the number of U.S.-based users posting to Spotlight grew over 47% year-over-year. The company also spun out hardware to a new entity called Specs last month.\n\nThe company added that it plans to expand the program to Snap Stars in Canada, the U.K., and France in the coming weeks.\n\nRival company Meta also allows creators to offer subscriptions on platforms like Instagram and Facebook, which gives users access to exclusive content and badges."
      },
      {
        "title": "Peak Design has wearable gadget straps for people who hate bags",
        "link": "https://www.theverge.com/tech/879908/peak-design-crossbody-phone-strap-launch-price",
        "published": "2026-02-17T09:00:00-05:00",
        "source": "The Verge",
        "text": "is a news writer focused on creative industries, computing, and internet culture. Jess started her career at TechRadar, covering news and hardware reviews.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nPeak Design is launching a lineup of mobile straps for carrying small gadgets and other essentials around without dumping them into a bag. There are three versions available starting today: a $29.95 Mobile Cuff for your wrist, a $49.95 two-point Crossbody Strap, and a $59.95 Crossbody Multi-Strap that allows you to carry several items at once using anchor attachments.\n\nPeak Design’s straps feature a corded rope that was custom-developed for “strength, comfort, and stretch,” and are compatible with any Peak Design or Apple iPhone 17 case, and any third-party case if paired with the included adapter. The anchor attachments for the Crossbody Multi-Strap are each rated to withstand 50 pounds (23 kilograms) of force per attachment point, and can carry items like “compact, lightweight point-and-shoot cameras.” So, not heavier mirrorless or DSLR cameras.\n\nThe images of Peak Design’s Crossbody Multi-Strap make it look a little like climbing gear when multiple objects are hanging off it. Honestly, at that point, a small bag or sling probably makes more sense, especially for anyone carrying an AirPods case that could easily fling open.\n\nCarry straps for smartphones are already popular across Europe and Asia. Peak Design’s straps follow the launch of Apple’s $59 iPhone crossbody strap last year that features a flat design and magnetic length adjustment.\n\nPrevious Next\n\n\n\n1 / 3 Here’s a closer look at the Peak Design Crossbody Multi-Strap… Image: Peak Design"
      },
      {
        "title": "Undo in Vi and Its Successors",
        "link": "https://utcc.utoronto.ca/~cks/space/blog/unix/ViUndoMyViews",
        "published": "Tue, 17 Feb 2026 13:47:56 +0000",
        "source": "Hacker News: Front Page",
        "text": "You're using a tool with a too-generic User-Agent\n\nYou're probably reading this page because you've attempted to access some part of my blog (Wandering Thoughts) or CSpace, the wiki thing it's part of. Unfortunately whatever you're using to do so has a HTTP User-Agent header value that is too generic or otherwise excessively suspicious. Unfortunately, as of early 2025 there's a plague of high volume crawlers (apparently in part to gather data for LLM training) that behave like this. To reduce the load on Wandering Thoughts I'm experimenting with (attempting to) block all of them, and you've run into this.\n\nAll HTTP User-Agent headers should clearly identify what they are, and for non-browser user agents, they should identify not just the software involved but also who specifically is using that software. An extremely generic value such as \" Go-http-client/1.1 \" is not something that I consider acceptable any more.\n\nChris Siebenmann, 2025-02-17"
      },
      {
        "title": "OpenAI sidesteps Nvidia with unusually fast coding model on plate-sized chips",
        "link": "https://arstechnica.com/ai/2026/02/openai-sidesteps-nvidia-with-unusually-fast-coding-model-on-plate-sized-chips/",
        "published": "Thu, 12 Feb 2026 22:56:02 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "On Thursday, OpenAI released its first production AI model to run on non-Nvidia hardware, deploying the new GPT-5.3-Codex-Spark coding model on chips from Cerebras. The model delivers code at more than 1,000 tokens (chunks of data) per second, which is reported to be roughly 15 times faster than its predecessor. To compare, Anthropic’s Claude Opus 4.6 in its new premium-priced fast mode reaches about 2.5 times its standard speed of 68.2 tokens per second, although it is a larger and more capable model than Spark.\n\n“Cerebras has been a great engineering partner, and we’re excited about adding fast inference as a new platform capability,” Sachin Katti, head of compute at OpenAI, said in a statement.\n\nCodex-Spark is a research preview available to ChatGPT Pro subscribers ($200/month) through the Codex app, command-line interface, and VS Code extension. OpenAI is rolling out API access to select design partners. The model ships with a 128,000-token context window and handles text only at launch.\n\nThe release builds on the full GPT-5.3-Codex model that OpenAI launched earlier this month. Where the full model handles heavyweight agentic coding tasks, OpenAI tuned Spark for speed over depth of knowledge. OpenAI built it as a text-only model and tuned it specifically for coding, not for the general-purpose tasks that the larger version of GPT-5.3 handles.\n\nOn SWE-Bench Pro and Terminal-Bench 2.0, two benchmarks for evaluating software engineering ability, Spark reportedly outperforms the older GPT-5.1-Codex-mini while completing tasks in a fraction of the time, according to OpenAI. The company did not share independent validation of those numbers.\n\nAnecdotally, Codex’s speed has been a sore spot; when Ars tested four AI coding agents building Minesweeper clones in December, Codex took roughly twice as long as Anthropic’s Claude Code to produce a working game.\n\nThe coding agent arms race\n\nFor context, GPT-5.3-Codex-Spark’s 1,000 tokens per second represents a fairly dramatic"
      },
      {
        "title": "Inside the Homeland Security Forum Where ICE Agents Talk Shit About Other Agents",
        "link": "https://www.wired.com/story/hsi-forum-ice-agents/",
        "published": "Tue, 17 Feb 2026 14:00:00 +0000",
        "source": "WIRED",
        "text": "Every day, people log in to an online forum for current and former Homeland Security Investigations (HSI) officers to share their thoughts on the news of the day and complain about their colleagues in Immigration and Customs Enforcement (ICE).\n\n“ERO is too busy dressing up as Black Ops Commandos with Tactical body armor, drop down thigh rigs, balaclavas, multiple M4 magazines, and Punisher patches, to do an Admin arrest of a non criminal, non-violent EWI that weighs 90 pounds and is 5 foot 2, inside a secure Federal building where everyone has been screened for weapons,” wrote one user in July 2025. (ERO stands for Enforcement and Removal Operations; along with HSI, it’s one of the two major divisions of ICE and is responsible for detaining and deporting immigrants.)\n\nThe forum describes itself as a space for current and prospective HSI agents, “designed for the seasoned HSI Special Agent as well as applicants for entry level Special Agent positions.” HSI is the division within ICE whose agents are normally responsible for investigating crimes like drug smuggling, terrorism, and human trafficking.\n\nIn the forum, users discuss their discomfort with the US’s mass deportation efforts, debate the way federal agents have interacted with protesters and the public, and complain about the state of their working conditions. Members have also had heated discussions about the shooting of two protesters in Minneapolis, Renee Good and Alex Pretti, and the ways immigration enforcement has taken place around the US.\n\nThe forum is one of several related forums where people working in different parts of the Department of Homeland Security (DHS) share experiences and discuss specific details of their work. WIRED previously reported on a forum where current and former deportation officers from ICE and Customs and Border Protection (CBP) similarly complained about their jobs and discussed the way the agency was conducting immigration raids. The HSI forum appears to be linked, even incl"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nIndian startup Emergent has achieved an annual run-rate revenue of over $100 million in just eight months, driven by demand for its vibe-coding platform. Meanwhile, Adani Group has pledged $100 billion to build AI data centers in India, aiming to create a $250 billion AI infrastructure ecosystem. Additionally, AI is being used to help people manage diabetes and obesity, with companies like Twin Health using digital twins and AI-powered health coaching. The global AI race is also sparking controversy, with local residents in the UK protesting against the construction of large data centers. Emergent's rapid growth and Adani's investment highlight the increasing interest in AI and its applications.\n\n## Market & Business Implications\n* Emergent's vibe-coding platform has gained over 6 million users worldwide, with 40% being small businesses and 70% having no prior coding experience, as stated in Article 1.\n* Adani Group plans to invest $100 billion in building data centers specialized for AI across India, expecting to catalyze an additional $150 billion in related investments, as mentioned in Article 4.\n* Twin Health's approach to managing diabetes, prediabetes, and obesity using AI, wearables, and on-demand health coaching has led to medication savings for employers and helped users lose weight, as reported in Article 2.\n* The demand for data centers to support AI workloads is increasing, with companies like Equinix acquiring land to build large facilities, as noted in Article 5.\n* Laurie Spiegel's Music Mouse, an algorithmic music creation tool, is being reborn for modern machines with help from Eventide, as stated in Article 3.\n\n## Beginner-Friendly Summary\nA new Indian company called Emergent is doing very well, making over $100 million in just eight months. This is because many people want to use their special coding tool. Another big company, Adani, is investing a lot of money to build special computer centers for artificial intelligence in India. Some people are using artificial intelligence to help them get healthier. However, building these big computer centers is making some people unhappy because they don't want them in their area.",
    "articles": [
      {
        "title": "Just 8 months in, India’s vibe-coding startup Emergent claims ARR of over $100M",
        "link": "https://techcrunch.com/2026/02/17/emergent-hits-100m-arr-eight-months-after-launch-rolls-out-mobile-app/",
        "published": "Tue, 17 Feb 2026 14:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Indian vibe-coding platform Emergent was launched just eight months ago, and it now says it’s generating annual run-rate revenue of more than $100 million, thanks to surging demand by small businesses and non-technical users.\n\nThe startup on Tuesday said it had doubled its annual run-rate revenue to $100 million in the past month, and it now has more than 6 million users worldwide across 190 countries, of which about 150,000 are paying customers. Emergent claims its users have created over 7 million applications on its platform.\n\nNearly 40% of Emergent’s users are small businesses, and about 70% have no prior coding experience. People mostly use the platform to digitize operations previously run on spreadsheets, email or messaging apps, and to build custom software, co-founder and CEO Mukund Jha told TechCrunch.\n\nEmergent’s rapid growth comes as interest in “vibe-coding,” or using AI to code software, skyrockets around the world. The demand seems to be mostly driven by non-technical users who want to build production-ready applications using natural language and AI agents, though plenty of developers have turned to using such platforms to reduce their workloads.\n\nThe startup competes with the likes of Replit, Lovable, Rocket.new, Wabi, and Anything, among others.\n\nJha said most users on Emergent are building business-facing apps such as custom CRMs, ERPs, and inventory management and logistics tools. About 80% to 90% of new projects are focused on mobile apps, reflecting demand for software that can be deployed quickly and used on the go.\n\nEmergent generates revenue through a mix of subscriptions, usage-based pricing, and deployment and hosting fees, Jha said, adding that all three segments are growing rapidly and that the company’s gross margins are improving every month.\n\nTechcrunch event TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, exec"
      },
      {
        "title": "AI Digital Twins Are Helping People Manage Diabetes and Obesity",
        "link": "https://www.wired.com/story/ai-digital-twins-are-helping-people-manage-diabetes-and-obesity/",
        "published": "Tue, 17 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Rodney Buckley has lost 100 pounds in less than a year, not by using a GLP-1 drug but with the help of a digital twin. Last March, the 55-year-old retired firefighter turned village mayor of Third Lake, Illinois, was 376 pounds. He had tried different diets over the years and would typically lose some weight but eventually gain it back. When his wife’s employer started offering a program from startup Twin Health, he thought he would give it a try.\n\nWith demand for Ozempic and other GLP-1 drugs soaring, employers are grappling with their high costs. At around $1,000 to $1,500 a month per person, these medications represent a rapidly increasing health care expense. It’s why some employers are turning to non-medication alternatives to help people go off, reduce, or avoid GLP-1s entirely.\n\nMountain View, California–based Twin Health’s approach uses a combination of wearables, AI, and on-demand health coaching to help manage diabetes, prediabetes, and obesity. The company sends users a kit with a continuous glucose monitor, blood pressure cuff, smart scale, and fitness tracker. Together, the devices collect data points on blood sugar, weight, stress, blood pressure, sleep, and activity and feed them into a single app. Using a predictive AI model, the app analyzes all this information to generate a virtual replica of the user’s metabolism—the digital twin.\n\nA clinical trial found that Twin can help people with type 2 diabetes control their blood sugar with fewer medications and lose weight. The program has led to medication savings for asset manager Blackstone, which has been using Twin Health for several years, while helping employees there lose weight.\n\n“We are making an impact on people, and we are sustaining the health outcomes,” says Jahangir Mohammed, cofounder and CEO of Twin Health. He says he was inspired to start the company in 2018 because type 2 diabetes runs in his family.\n\nThe company has enrolled tens of thousands of people across nearly 200 employers. Twin"
      },
      {
        "title": "Laurie Spiegel on the difference between algorithmic music and ‘AI’",
        "link": "https://www.theverge.com/report/879819/laurie-spiegel-is-celebrating-40-of-music-mouse-with-a-modern-revival",
        "published": "2026-02-17T08:00:00-05:00",
        "source": "AI | The Verge",
        "text": "In 1986, electronic music pioneer Laurie Spiegel created Music Mouse, a way for those with a Mac, Atari, or Amiga computer to dabble in algorithmic music creation. Music Mouse is deceptively simple: Notes are arranged on an XY grid, and you play it by moving a mouse around. Back in 1986, the computer mouse was still a relatively novel device. While it can trace its origins back to the late ’60s, it wasn’t until the Macintosh 128K in 1984 that it started seeing widespread adoption.\n\nBy then Spiegel, was already an accomplished composer. Her 1980 album The Expanding Universe is generally considered among the greatest ambient records of all time. And her composition “Harmony of the Worlds” is currently tearing through interstellar space as part of the Voyager Golden Record, launched in 1977. But she is also a technical wizard who joined Bell Labs in 1973 and was instrumental in early digital synthesis experiments and worked on an early computer graphics system called Vampire.\n\nSpiegel was deeply drawn to algorithmic music composition and this new tool, the home computer. So, she created what she calls an “intelligent instrument” that enables the creation of complex melodies and harmonies with minimal music-theory knowledge. Music Mouse restricts you to particular scales, and then you explore them simply by pushing a mouse around.\n\nSpiegel gives the user some control, of course. You can choose if notes move in parallel or contrary to each other, there are options to play notes back as chords or arpeggios, and there is even a simple pattern generator.\n\nDespite being available for purchase until 2021, Spiegel never updated it to work on anything more current than Mac OS 9. Now, 40 years after its debut, it’s getting reborn for modern machines with help from Eventide.\n\nMusic Mouse is finally running on modern hardware. Image: Eventide\n\nWhile it would have been easy for Eventide and Spiegel to overload the 2026 version of Music Mouse with countless modern amenities and new "
      },
      {
        "title": "Adani pledges $100B to build AI data centers as India seeks bigger role in the global AI race",
        "link": "https://techcrunch.com/2026/02/17/adani-pledges-100b-for-ai-data-centers-as-india-seeks-bigger-role-in-global-ai/",
        "published": "Tue, 17 Feb 2026 13:08:46 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Indian conglomerate Adani Group said on Monday it would invest $100 billion over the next decade to build data centers specialized for AI across the country, a move that underscores India’s ambition to play a larger role in the global AI race.\n\nThe investment, which will run through 2035, is aimed at building renewable-energy-powered data centers designed to support AI workloads, the company said. It expects the plan to catalyze an additional $150 billion in related investments and result in a $250 billion AI infrastructure ecosystem in India over the decade.\n\nAdani is making this commitment against a backdrop of skyrocketing investments in AI infrastructure as companies increasingly look beyond the U.S. for computing power, energy and friendly regulation. India, with its expanding digital economy and growing renewable-energy capacity, has emerged as a major destination for data centers and AI-related infrastructure over the past couple of years.\n\nThe announcement coincides with India’s ongoing AI Impact Summit in New Delhi this week, where leaders from some of the world’s top AI companies, including OpenAI, Nvidia, Anthropic, Microsoft and Google, are meeting policymakers and industry executives.\n\nAdani Group chairman Gautam Adani (pictured above) described the plan as a long-term bet on the convergence of energy and computing. “India will not be a mere consumer in the AI age,” he said, adding that the group aims to help build a domestic AI infrastructure base.\n\nThe plan is to build atop Adani’s own existing data-center platform and its partnerships with companies like Google and Microsoft. The conglomerate is developing large-scale AI data-center campuses in Visakhapatnam and Noida, and has plans for more facilities in Hyderabad and Pune. An expanded partnership with Walmart-owned Flipkart will focus on another AI data center.\n\nAdani said the broader plan calls for deploying up to 5 gigawatts of data-center capacity. The company said the facilities will be develop"
      },
      {
        "title": "The Small English Town Swept Up in the Global AI Arms Race",
        "link": "https://www.wired.com/story/the-small-english-town-swept-up-in-the-global-ai-arms-race/",
        "published": "Tue, 17 Feb 2026 07:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "A short drive from London, the town of Potters Bar is separated from the village of South Mimms by 85 acres of rolling farmland segmented by a scribble of hedgerows. In one of the fields, a lone oak serves as a rest stop along a public footpath. Lately, the tree has become a site of protest, too. A poster tied to its trunk reads: “NO TO DATA CENTRE.”\n\nIn September 2024, a property developer applied for permission to build an industrial-scale data center—one of the largest in Europe—on the farmland. When locals caught wind, they started a Facebook group in hopes of blocking the project. More than 1,000 people signed up.\n\nThe local government has so far dismissed the group’s complaints. In January 2025, it granted planning permission. The following October, multinational datacenter operator Equinix acquired the land; it intends to break ground this year.\n\nOn a dismal Thursday afternoon in January, I huddled around a gate leading onto the farmland with Ros Naylor—one of the Facebook group’s admins—and six other local residents. They told me that they object to the data center on various grounds, but particularly to the loss of green space, which they see as an invaluable escape route from town to countryside and buffer against the highway and fuel stop visible on the horizon. “The beauty of walking in this area is coming through this space,” says Naylor. “It’s incredibly important for mental health and wellbeing.”\n\nAs the UK government races to meet the voracious demand for data centers that can be used to train AI models and run AI applications, similarly large facilities stand to be built across the country. For the people who live in closest proximity, though, the prospect that AI might buoy the economy or infuse new capabilities into their smartphone is thin consolation for what they consider a disruption to a countryside way of life.\n\nBonfire of Red Tape\n\nSince the mid-20th century, London has been hemmed in on all sides by a nearly contiguous patchwork of land kn"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nThe US stock market is experiencing a decline due to concerns about AI's impact on various industries. Iran has partially closed the Strait of Hormuz, a major oil chokepoint, citing security precautions. Goldman Sachs is planning to remove DEI hiring standards for its board of directors. Warner Bros. Discovery is restarting talks with Paramount Skydance over a potential deal, despite having a pending transaction with Netflix. The company has been granted a seven-day waiver by Netflix to explore Paramount's offer.\n\n## Market & Business Implications\n* Nasdaq 100 futures sank 0.8% and S&P 500 futures moved down roughly 0.5% due to AI concerns (Article 1).\n* Iran's partial closure of the Strait of Hormuz may cause \"minor nuisance and delays\" to inbound shipping, according to Jakob Larsen, chief safety and security officer at BIMCO (Article 2).\n* Goldman Sachs plans to remove DEI language in the criteria for its board members, following a request from the National Legal and Policy Center (Article 3).\n* Warner Bros. Discovery has been granted a seven-day waiver by Netflix to reopen deal talks with Paramount Skydance, with Paramount informing Warner that it would agree to pay $31 per share (Article 4 and Article 5).\n\n## Beginner-Friendly Summary\nThe US stock market is going down because people are worried about how artificial intelligence will affect different industries. Iran has closed part of a very important waterway called the Strait of Hormuz, which is used for oil transportation. A big company called Goldman Sachs is changing its rules for choosing board members. Another company, Warner Bros. Discovery, is talking to two different companies, Netflix and Paramount, about potential deals.",
    "articles": [
      {
        "title": "Stock market today: Dow, S&P 500, Nasdaq futures slide ahead of shortened week with AI fears in focus",
        "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-slide-ahead-of-shortened-week-with-ai-fears-in-focus-235251568.html",
        "published": "2026-02-16T23:52:51Z",
        "source": "Yahoo Finance",
        "text": "Tech led US stock futures lower on Tuesday, a sign that Wall Street is still suffering the AI jitters that have hammered markets in recent weeks.\n\nNasdaq 100 futures (NQ=F) sank 0.8%, while those on the S&P 500 (ES=F) moved down roughly 0.5%. Contracts on the Dow Jones Industrial Average (YM=F), which includes fewer tech names, fell 0.3%.\n\nThe tech sell-off looks set to resume after the break for Presidents Day, as AI concerns continue to simmer. Investors are on the lookout for the next potential victim after fresh worries about AI's ability to upend industries hit stocks in sectors from wealth management to transportation to logistics. The Dow and S&P 500 have fallen in four of the past five weeks amid that pressure.\n\nThis week, earnings season enters its final stretch. Results from Constellation Energy (CEG), Energy Transfer (ET) are in focus for signals on how AI's power demand is changing the energy business, with Medtronic (MDT), Palo Alto Networks (PANW) also on Tuesday's docket. But the week's highlight is Walmart's (WMT) quarterly report on Thursday, the first since the retail giant joined the trillion-dollar market cap club.\n\nElsewhere in corporates, Paramount Skydance (PSKY) stock rose 2% before the bell on Tuesday following the news that Warner Bros Discovery (WBD) has given the studio one week to come back with a better offer. Warner Bros rejected the latest bid from the Hollywood studio.\n\nThe holiday-shortened week also brings a flurry of economic readings delayed by the partial US shutdown. The December print of the Personal Consumption Expenditures index due Friday is in focus after the latest consumer inflation report came in cooler than expected.\n\nAn advance look at fourth quarter GDP, also on Friday, should provide an economic health check amid an ongoing debate about the pace of interest-rate cuts this year. Before that, minutes from the Federal Reserve's policy meeting in January will also feed into those calculations, as questions swirl around "
      },
      {
        "title": "Iran partially closes Strait of Hormuz, a vital oil chokepoint, as U.S. talks get underway",
        "link": "https://www.cnbc.com/2026/02/17/iran-us-strait-of-hormuz-oil-nuclear-talks-geneva.html",
        "published": "Tue, 17 Feb 2026 14:08:50 GMT",
        "source": "US Top News and Analysis",
        "text": "Iranian Navy soldiers at an armed speed boat in Persian Gulf near the strait of Hormuz about 1320km (820 miles) south of Tehran, April 30, 2019.\n\nIran partially closed the strategically vital Strait of Hormuz on Tuesday, state media reported, citing \"security precautions\" as Tehran's Revolutionary Guards conduct military drills in the waterway.\n\nIt comes as the U.S. and Iran hold talks in the Swiss city of Geneva, seeking to resolve an ongoing dispute over Tehran's nuclear program.\n\nIt marks the first time Iran has shut parts of the Strait of Hormuz, a major international waterway that links crude producers in the Middle East with key markets across the globe, since U.S. President Donald Trump threatened Tehran with military action in January.\n\nLocated in the Gulf between Oman and Iran, the strait is recognized as one of the world's most important oil chokepoints.\n\nAbout 13 million barrels per day of crude oil transited the Strait of Hormuz in 2025, accounting for roughly 31% of global seaborne crude flows, data provided by market intelligence firm Kpler showed.\n\nTuesday's temporary closure of the waterway was aimed at ensuring shipping safety as part of the Revolutionary Guards' \"Smart Control of the Strait of Hormuz\" drill. The exercise is designed to improve Iran's operational readiness and bolster its deterrence, among other objectives.\n\nEnergy market participants are closely watching the outcome of the U.S.-Iran talks, particularly as both sides have increased their military presence in the region.\n\nOil prices were last seen trading lower on Tuesday, erasing earlier gains. International benchmark Brent crude futures with April delivery fell 1.8% to $67.48 a barrel, while U.S. West Texas Intermediate futures with March delivery stood 0.4% lower at $62.65\n\nJakob Larsen, chief safety and security officer at BIMCO, which represents global shipowners, said the temporary closure of the Strait of Hormuz was likely to cause \"minor nuisance and delays\" to inbound shippi"
      },
      {
        "title": "Goldman Sachs to drop DEI board standards as Trump's anti-woke campaign spreads across corporate America",
        "link": "https://www.foxbusiness.com/economy/goldman-sachs-drop-dei-board-standards-trumps-anti-woke-campaign-spreads-across-corporate-america",
        "published": "Tue, 17 Feb 2026 07:00:05 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Goldman Sachs plans to remove DEI hiring standards for its board of directors, The Wall Street Journal reported Monday.\n\nThe company had removed a requirement for board diversity on companies it was taking public last year, but now plans to remove DEI language in the criteria for its own board members this month. The board's governing committee evaluates potential candidates based on four criteria, one of which is a more traditional understanding of diversity, encapsulating viewpoints, background, work and military service.\n\nThat section also has \"other demographics\" tagged on to the end, referring to race, gender identity, ethnicity and sexual orientation, according to the Journal. The board now reportedly plans to remove reference to \"other demographics.\"\n\nThe expected change comes after the National Legal and Policy Center, a conservative nonprofit that owns a small stake in the bank, requested the change in September, according to the Journal.\n\nHEGSETH ENDING MILITARY EDUCATION TIES WITH HARVARD AMID TRUMP FEUD: 'WE TRAIN WARRIORS, NOT WOKESTERS'\n\nGoldman Sachs struck a deal with the group under which the board would make the change of its own accord and the NLPC would not submit a formal request circulated to shareholders ahead of the company's annual shareholder meeting later this year, people familiar with the matter told the outlet.\n\nThe change comes as part of a wider rejection of DEI policies thanks in large part to President Donald Trump's return to the White House last year.\n\nTrump moved quickly to drop the hammer on DEI, signing an executive order on day one titled \"Ending Radical and Wasteful Government DEI Programs and Preferencing,\" which directed federal agencies to stamp out DEI-style programs across the federal government. The following day, Trump signed a second order aimed at \"restoring merit-based opportunity,\" including changes for federal contracting and related compliance.\n\nCORPORATE AMERICA HAS DECIDED THAT DEI NEEDS TO DIE\n\n\"We’ve ended th"
      },
      {
        "title": "Warner Bros. Discovery to restart Paramount deal talks as Netflix waits",
        "link": "https://finance.yahoo.com/news/warner-bros-discovery-restart-paramount-135745815.html",
        "published": "2026-02-17T13:57:45Z",
        "source": "Yahoo Finance",
        "text": "Warner Bros. Discovery said Tuesday that it would restart talks with Paramount Skydance over a deal for Paramount to buy the company, even as Warner's board recommended that shareholders vote to approve Netflix's offer to buy its streaming and studio businesses.\n\n\n\nThe Warner Bros. Discovery board unanimously recommended that shareholders vote to ratify the Netflix deal during a special shareholders meeting next month, reiterating that the Netflix deal \"offers superior value and certainty.\" But the company also said that Netflix had granted it a seven-day waiver to resume discussions with Paramount Skydance\" to seek a best and final offer.\"\n\n\"Throughout the entire process, our sole focus has been on maximizing value and certainty for WBD shareholders,\" Warner Bros. Discovery CEO David Zaslav said in a statement. \"We are engaging with [Paramount Skydance] now to determine whether they can deliver an actionable, binding proposal that provides superior value and certainty for WBD shareholders through their best and final offer.\"\n\nNetflix struck a deal with Warner Bros. Discovery in December to buy Warner's studio and streaming businesses for more than $80 billion, with Warner planning to spin off its TV networks into a separate company. Since then, Paramount Skydance has mounted a hostile bid to buy all of Warner Bros., even as Warner has raised questions about the financing behind the Paramount bid and maintained that Netflix's offer is a better and more certain one for shareholders.\n\nParamount has improved the terms of its offer multiple times, though it has not increased the amount per share it is offering to pay. Warner Bros. signaled that was changing, saying Tuesday that Paramount had informed Warner \"it would agree to pay $31 per share, a price not yet reflected in its latest written proposal.\"\n\nThe fight for Warner Bros. has been the subject of intense corporate and political wrangling in recent months, amid antitrust and other concerns.\n\nWarner Bros. Discovery"
      },
      {
        "title": "Netflix grants Warner Bros. Discovery 7-day waiver to reopen deal talks with Paramount Skydance",
        "link": "https://www.cnbc.com/2026/02/17/netflix-wbd-waiver-deal-talks-paramount-skydance.html",
        "published": "Tue, 17 Feb 2026 13:30:52 GMT",
        "source": "US Top News and Analysis",
        "text": "Warner Bros. Discovery on Tuesday said it will reopen deal talks with Paramount Skydance under a seven-day waiver from Netflix to explore \"deficiencies\" in Paramount's offer to buy the entirety of WBD.\n\nThe legacy media company has a pending transaction with Netflix for its streaming and studio businesses. Paramount launched a hostile tender offer straight to WBD shareholders at $30 per share after losing out to Netflix in a bidding war.\n\n\"Netflix has provided WBD a limited waiver under the terms of WBD's merger agreement with Netflix, permitting WBD to engage in discussions with Paramount Skydance (\"PSKY\") (NASDAQ: PSKY) for a seven-day period ending on February 23, 2026 to seek clarity for WBD stockholders and provide PSKY the ability to make its best and final offer,\" Warner Bros. Discovery said in a release.\n\n\"During this period, WBD will engage with PSKY to discuss the deficiencies that remain unresolved and clarify certain terms of PSKY's proposed merger agreement,\" it said.\n\nParamount leadership has repeatedly said its $30 per share, all-cash offer is not its \"best and final.\" Last week the company sweetened its offer with additional \"enhancements,\" but stopped short of raising the per-share value.\n\nWarner Bros. Discovery said Tuesday that a senior Paramount representative informed a WBD board member that it would pay $31 per share if deal talks were to reopen.\n\nTune in at 4:30pm ET as Netflix co-CEO Ted Sarandos joins CNBC TV. Watch in real time on CNBC+ or the CNBC Pro stream.\n\nAfter the limited waiver period, Netflix will retain its matching rights provided by the merger agreement, WBD said.\n\n\"Throughout the entire process, our sole focus has been on maximizing value and certainty for WBD shareholders,\" said WBD CEO David Zaslav in a statement. \"Every step of the way, we have provided PSKY with clear direction on the deficiencies in their offers and opportunities to address them. We are engaging with PSKY now to determine whether they can deliver an action"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nIndia's border villages along the China border are experiencing slow development, while China is rapidly building up its side. Meanwhile, the US and Iran are set to meet for high-stakes nuclear talks in Geneva. Kenyan authorities have been accused of using Israeli technology to break into an activist's phone. US civil rights leader Jesse Jackson has passed away at the age of 84. \n\n## Market & Business Implications\n* India's Vibrant Villages Programme aims to develop over 600 villages along its border with China, but progress has been slow due to bureaucratic issues (Article 1).\n* Warner Bros has rejected Paramount's revised offer and set a 7-day deadline for a better bid (Article 2).\n* Israeli technology company Cellebrite's products have been used by Kenyan authorities to break into an activist's phone, raising concerns about the company's technology being abused by government clients (Article 3).\n\n## Beginner-Friendly Summary\nThere's a big difference in how India and China are developing their shared border areas. India is moving slowly, while China is building quickly. The US and Iran are talking about nuclear issues. A company in Israel made a product that was used to hack into someone's phone in Kenya. A famous American civil rights leader named Jesse Jackson has died.",
    "articles": [
      {
        "title": "India has long promised 'vibrant' border villages, as China speedily builds up",
        "link": "https://www.npr.org/2026/02/17/nx-s1-5702816/india-china-border-villages-development",
        "published": "Tue, 17 Feb 2026 07:30:00 -0500",
        "source": "NPR Topics: World",
        "text": "India has long promised 'vibrant' border villages, as China speedily builds up\n\ntoggle caption Omkar Khandekar/NPR\n\nGANGTOK, India — Nearly four years ago, Indian Finance Minister Nirmala Sitharaman told the Parliament she had big plans for India's border villages.\n\n\"Border villages with sparse population, limited connectivity and infrastructure often get left out from developmental gains,\" she said, while announcing the government's spending budget for 2022-2023.\n\nShe unveiled the Vibrant Villages Programme, aiming to undo the neglect of thousands of communities on the border. Its first phase started with more than 600 villages along India's 2,100-mile-long border with China, many high up in the forbidding Himalayan plateau.\n\nThe finance minister didn't say it, but India's initiative appeared to be a response to China's decade-long buildup of troops and military and civilian infrastructure along their shared border.\n\nSponsor Message\n\nLoading...\n\nToday, there's a tale of two borderlands in the Himalayas. China has systematically fortified its borders with India, as well as neighboring Nepal and Bhutan, creating hundreds of villages next to these South Asian countries along Chinese-controlled Tibet, and moving tens of thousands of civilians there. Analysts say the authorities in Beijing hope they will act as the state's \"eyes and ears\" along the disputed border, and that many of the villages double as military bases.\n\nMeanwhile, many of India's development projects on the border sputter along without a deadline, often stymied by its slow-moving bureaucracy. As a result, youth are moving away from the villages to towns and cities downhill for jobs and education.\n\ntoggle caption Omkar Khandekar/NPR\n\nFor years, analysts have accused the Chinese army of \"salami slicing.\" It's a tactic in which one country occupies its rival's areas by chipping away at its borders. The emptying out of India's border villages, they say, could further embolden China to enter areas that Indi"
      },
      {
        "title": "Warner Bros rejects Paramount's revised offer, sets 7-day deadline for better bid - Reuters",
        "link": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxNN1lTLVVmSnJwU3lld0pWTVVmMHNvOWxITTFFekVPWnFydFVHVExqdVhGNTZ1ODFWemk1WThVT2paWHZLSDFtWXpTMnlfeDRZQU85UG4yM0x4YW5qNExRZHMxYkZydHZ3VWlhMWZCWG44LTRUejdzZ0E2d3pFVTVIVmVSVzZGM2RPZU9nTU93VmRvdkhNa2hqeERKSGd6T0p1bjNESFFnRk0tV3BwckFEXzNtS1lvUHBFUkFuWW03Y0xJU1lkNzFLaVB4N3lUTWFnNktYam4wellfMVdMR1BLV2Q1ZzNHNXlxZHp0SjQzV1NDdw?oc=5",
        "published": "Tue, 17 Feb 2026 12:02:51 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Kenyan authorities used Israeli tech to crack activist’s phone, report claims",
        "link": "https://www.theguardian.com/world/2026/feb/17/trim-slugs-to-kenya-authorities-israel-tech-crack-activists-phone-report",
        "published": "Tue, 17 Feb 2026 11:01:02 GMT",
        "source": "World news | The Guardian",
        "text": "When Boniface Mwangi, the prominent Kenyan pro-democracy activist who plans to run for president in 2027, had his phones returned to him by Kenyan authorities after his controversial arrest last July, he immediately noticed a problem: one of the phones was no longer password protected and could be opened without one.\n\nIt was Mwangi’s personal phone, which he used to communicate with friends and mentors, and contained photos of private family moments with his wife and children. Knowing that its contents could be in the hands of the Kenyan government made Mwangi – who has described harassment and even torture – feel unsafe and “exposed”, he told the Guardian.\n\nA report released on Tuesday by Citizen Lab, which tracks digital threats against civil society, has found with “high confidence” that Kenyan authorities used Israeli technology to break into Mwangi’s phone while he was under arrest last year, when the device was in police custody.\n\nAuthorities’ use of the technology, made by Cellebrite, “could have enabled the full extraction of all materials from Mwangi’s device, including messages, private materials, personal files, financial information, passwords, and other sensitive information”, Citizen Lab said.\n\nThe findings, researchers claimed, add to the growing body of evidence that Cellebrite’s technology is being “abused by its government clients, and the company is failing to prevent those abuses from happening”.\n\nIn a statement to the Guardian, Cellebrite said it maintained a “rigorous process for reviewing allegations of technology misuse” and that it took “decisive action”, including licence termination, when credible and substantiated evidence is presented to the company.\n\n“We do not respond to speculation and encourage any organisation with specific, evidence-based concerns to share them with us directly so we can act on them,” the company said.\n\nThe Guardian reached out to Kenya’s police spokesperson and the Kenyan embassy in Washington for comment but did "
      },
      {
        "title": "Watch: Key moments that defined Jesse Jackson's life",
        "link": "https://www.bbc.com/news/videos/cvg4y9ee16go?at_medium=RSS&at_campaign=rss",
        "published": "Tue, 17 Feb 2026 12:52:08 GMT",
        "source": "BBC News",
        "text": "Jesse Jackson, the US civil rights leader who later ran for president, has died aged 84.\n\nJackson, who died peacefully on Tuesday morning surrounded by his family, leaves a lasting legacy in civil rights, diplomacy, and politics.\n\nHere are some key moments that defined his career.\n\nREAD MORE: How Jesse Jackson paved way for Barack Obama - and helped change the US"
      },
      {
        "title": "Rev. Jesse Jackson has died. And, U.S. and Iran set for high-stakes nuclear talks",
        "link": "https://www.npr.org/2026/02/17/g-s1-110385/up-first-newsletter-iran-geneva-ice-shooting-texas-trial-jesse-jackson-alex-pretti",
        "published": "Tue, 17 Feb 2026 07:04:37 -0500",
        "source": "NPR Topics: World",
        "text": "Rev. Jesse Jackson has died. And, U.S. and Iran set for high-stakes nuclear talks\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nThe U.S. and Iran are expected to meet today in Geneva for negotiations. This marks the second round of talks to discuss limits on Iran's nuclear program. The U.S. wants concessions from Iran beyond its nuclear program and has paired the talks with a threat by building up its military forces in the region.\n\ntoggle caption Harold Cunningham/AFP via Getty Images\n\n🎧 Today's meeting is a good sign that both sides are still open to these talks, though the U.S. and Iran remain firm in their demands, NPR's Jackie Northam tells Up First. President Trump wants Iran to possess zero nuclear weapons and zero enrichment. Iran insists it has the right to enrich uranium for research and civilian uses. Iran indicated it could be open to curbing, not eliminating, its nuclear program, Northam says. Iran has brought a large technical team with it to Geneva as a gesture that shows its seriousness.\n\nNine people face trial today in a Fort Worth, Texas, federal court in connection to a nonfatal shooting that happened outside an ICE detention facility last July. Around a dozen people protested Trump's immigration crackdown and deportation efforts outside the Prairieland Detention Center in nearby Alvarado. At some point, police and prosecutors say shots were fired, injuring a local police officer.\n\n\n\nSponsor Message\n\n🎧 The case is unique due to the U.S. attorney's office calling the indictment against the defendants the first in the nation against \"violent Antifa cell members,\" Penelope Rivera with NPR network station KERA says. Eight of the individuals face charges of providing material support to terrorists, and one is accused of attempted murder of a federal officer. Jason Blazakis, executive director o"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nAnderson Cooper is leaving \"60 Minutes\" after two decades to spend more time with his family. Goldman Sachs plans to remove DEI hiring standards for its board of directors. The UK unemployment rate has hit its highest level in nearly five years. Additionally, investors are betting on the expansion of a birria restaurant chain, Mike's Red Tacos, across the US.\n\n## Market & Business Implications\n* Anderson Cooper's departure from \"60 Minutes\" comes amid a new evolution at CBS News, led by editor in chief Bari Weiss, who has undergone layoffs to make a mark on the network (Article 1).\n* Goldman Sachs plans to remove DEI language in the criteria for its board members, following a request from the National Legal and Policy Center, a conservative nonprofit (Article 2).\n* The UK unemployment rate has reached its highest level in nearly five years, with one individual reporting applying for over 50 roles with little success (Article 3).\n* Investors Bill Phelps and Andrew Feghali are supporting the nationwide expansion of Mike's Red Tacos, a birria chain, with plans to build hundreds of restaurants across the US (Article 4).\n* Supervisor jobs are disappearing across the country, with frontline managers being outnumbered by back-office managers, according to an analysis of census and American Community Survey responses (Article 5).\n\n## Beginner-Friendly Summary\nAnderson Cooper is leaving his job at \"60 Minutes\" to spend time with his family. A big bank called Goldman Sachs is making some changes to how it chooses its leaders. The UK is having a hard time with many people not having jobs. Some people are investing in a new kind of restaurant that serves a food called birria. Also, some jobs that used to be important are not as common anymore.",
    "articles": [
      {
        "title": "Anderson Cooper is leaving ‘60 Minutes’ after two decades",
        "link": "https://www.washingtonpost.com/business/2026/02/16/anderson-cooper-leaves-60-minutes/",
        "published": "Mon, 16 Feb 2026 23:32:35 +0000",
        "source": "Business",
        "text": "Anderson Cooper, one of the most recognizable figures in television, is leaving “60 Minutes” after two decades as a correspondent at CBS News’s weekly documentary program. Cooper, 58, joined the program in 2006 through an agreement with CNN, where he’s worked since 2001 and hosted the eponymous “Anderson Cooper 360°” since 2003. Through a CNN spokesperson, Cooper said he decided not to renew his CBS contract and that he planned to spend more time with his young children.\n\n“Being a correspondent at 60 Minutes has been one of the great honors of my career,” Cooper wrote in a statement. “I got to tell amazing stories, and work with some of the best producers, editors, and camera crews in the business. For nearly twenty years, I’ve been able to balance my jobs at CNN and CBS, but I have little kids now and I want to spend as much time with them as possible, while they still want to spend time with me.”\n\nThe decision was first reported Monday by the media newsletter Breaker.\n\n“For more than two decades, Anderson Cooper has taken 60 Minutes viewers on journeys to faraway places, told us unforgettable stories, reported consequential investigations and interviewed many prominent figures,” CBS News wrote in a statement. “We’re grateful to him for dedicating so much of his life to this broadcast, and understand the importance of spending more time with family. 60 Minutes will be here if he ever wants to return.”\n\nCooper’s ascent was part of a “generational transition,” the New York Times wrote in 2006. Katie Couric joined the program at the same time, just as CBS legends Dan Rather and Mike Wallace departed.\n\nNow, his exit comes amid a new evolution at CBS News.\n\nIt is led by a new editor in chief, Bari Weiss, the founder of the Free Press, an independent opinion site she has positioned as ‘anti-woke.’ Under Weiss, CBS News has undergone layoffs as the editor seeks to make a mark on the network. “Our strategy until now has been clinging to the audience that remains on broadca"
      },
      {
        "title": "Goldman Sachs to drop DEI board standards as Trump's anti-woke campaign spreads across corporate America",
        "link": "https://www.foxbusiness.com/economy/goldman-sachs-drop-dei-board-standards-trumps-anti-woke-campaign-spreads-across-corporate-america",
        "published": "Tue, 17 Feb 2026 07:00:05 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Goldman Sachs plans to remove DEI hiring standards for its board of directors, The Wall Street Journal reported Monday.\n\nThe company had removed a requirement for board diversity on companies it was taking public last year, but now plans to remove DEI language in the criteria for its own board members this month. The board's governing committee evaluates potential candidates based on four criteria, one of which is a more traditional understanding of diversity, encapsulating viewpoints, background, work and military service.\n\nThat section also has \"other demographics\" tagged on to the end, referring to race, gender identity, ethnicity and sexual orientation, according to the Journal. The board now reportedly plans to remove reference to \"other demographics.\"\n\nThe expected change comes after the National Legal and Policy Center, a conservative nonprofit that owns a small stake in the bank, requested the change in September, according to the Journal.\n\nHEGSETH ENDING MILITARY EDUCATION TIES WITH HARVARD AMID TRUMP FEUD: 'WE TRAIN WARRIORS, NOT WOKESTERS'\n\nGoldman Sachs struck a deal with the group under which the board would make the change of its own accord and the NLPC would not submit a formal request circulated to shareholders ahead of the company's annual shareholder meeting later this year, people familiar with the matter told the outlet.\n\nThe change comes as part of a wider rejection of DEI policies thanks in large part to President Donald Trump's return to the White House last year.\n\nTrump moved quickly to drop the hammer on DEI, signing an executive order on day one titled \"Ending Radical and Wasteful Government DEI Programs and Preferencing,\" which directed federal agencies to stamp out DEI-style programs across the federal government. The following day, Trump signed a second order aimed at \"restoring merit-based opportunity,\" including changes for federal contracting and related compliance.\n\nCORPORATE AMERICA HAS DECIDED THAT DEI NEEDS TO DIE\n\n\"We’ve ended th"
      },
      {
        "title": "UK unemployment hits highest rate for nearly five years",
        "link": "https://www.bbc.com/news/articles/c1l7pedyzjeo?at_medium=RSS&at_campaign=rss",
        "published": "Tue, 17 Feb 2026 11:37:50 GMT",
        "source": "BBC News",
        "text": "She says she has applied for more than 50 roles but only one has resulted in a face-to-face interview. Mostly, she says, she gets no reply at all or a fairly quick rejection."
      },
      {
        "title": "Dave's Hot Chicken investors bet on birria with national franchise expansion plan",
        "link": "https://www.cnbc.com/2026/02/17/daves-hot-chicken-investors-bet-on-birria-with-new-deal.html",
        "published": "Tue, 17 Feb 2026 14:00:01 GMT",
        "source": "Business News",
        "text": "Mike's Red Tacos, based in San Diego, is best known for its birria tacos, but its menu features more than just the buzzy regional Mexican food.\n\nThe restaurant investors behind the success of Dave's Hot Chicken are making a new nationwide bet on the next-hottest restaurant trend: birria.\n\nMike's Red Tacos, a San Diego-based birria chain with just two locations, plans to announce on Tuesday a new franchising initiative that will build hundreds of restaurants across the U.S., with support from early-stage backers Bill Phelps and Andrew Feghali, CNBC can report.\n\nFinancial terms of their investment, which took place in early 2025, were not disclosed.\n\n\"We just saw that this was a brand and a concept that really had legs to it,\" Phelps told CNBC. \"And then the critical thing is, we brought down prospective franchisees. ... Everyone gave it the thumbs up.\"\n\nPhelps said he had never heard of birria before Feghali introduced him to Mike's.\n\nTraditional birria is a beef or goat stew, slow cooked with spices and chiles to give the meat lots of flavor. Birria tacos, like those sold at Mike's, use the slow-cooked meat as a filling and usually include a consomme on the side as a dip for the taco.\n\nOnce known as a regional Mexican food, birria now appears on 3.7% of U.S. menus, according to Datassential. That's more than quadruple its menu penetration four years ago, based on the firm's data, but there's still a long runway before it reaches ubiquity.\n\nMexican-inspired fast-food brands such as Qdoba, El Pollo Loco, Del Taco and even Taco Bell have released their own versions of birria. And there's at least 478 restaurant operators running birria-focused restaurants, according to Datassential.\n\nMike's menu also includes burritos, loaded nachos and fries, and birria ramen.\n\n\"It appeals to a very broad range of guests — it's not just your millennials and Gen Zs,\" Phelps said, speaking about the customers in Mike's Red Tacos restaurants. \"There's older people in the restaurant, ther"
      },
      {
        "title": "Supervisor jobs are disappearing across the country. What happened?",
        "link": "https://www.washingtonpost.com/business/2026/02/16/jobs-manager-supervisor-disappearing/",
        "published": "Mon, 16 Feb 2026 10:00:28 +0000",
        "source": "Business",
        "text": "Around Y2K, the mighty American private sector hit a momentous milestone. For the first time on record, frontline managers — supervisors, team leads, foremen, forewomen, etc. — outnumbered back-office managers. That seemed significant, especially for the working-class folks for whom these noncommissioned-officer-style positions provided a rare path to the upper reaches of the career ladder. As quickly as the milestone was crossed, the trend reversed, according to our analysis of about 37 million responses to the census and American Community Survey from 1950 to 2024.\n\nOnce ascendant, supervisory jobs crop up all over our lists of the hardest-hit jobs of Americans’ working lives, even as white-collar management soars to new highs. What happened?\n\nHaving been burned by data-collection changes before, our first instinct was to take a long, hard look at how the Census Bureau classifies jobs. Or, more accurately, to spend 15 seconds emailing an extraordinarily talented economist and hoping they’ve already done the work for us.\n\nWe were in luck. Utrecht University economist Anna Salomons responded within an hour, even though the hour in question was already a wee one in the Netherlands. For her blockbuster 2024 analysis, Salomons and her collaborators collected and analyzed detailed Census Bureau job descriptions from 1930 to 2018 to figure out how our economy had evolved, mutated and automated.\n\nShe first mentioned that the change in occupational definitions around the 2000 Census was “notoriously large” and, like us, wondered if that might cause some of the shift we saw in the numbers.\n\nBut two factors argue against that thesis. First, as Salomons suggested, we’re using a system from our friends at IPUMS that carefully adjusts for all those changes in the raw census definitions.\n\nSecond, the changes come gradually after the inflection point — if a census definition change was the culprit, you’d expect a sudden swerve. But what if, Salomons suggested, those changes in de"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market is experiencing significant changes due to AI disruption, with software stocks being particularly affected. Instacart's strong earnings report has alleviated concerns about the company's competitiveness in the grocery delivery market. Meanwhile, DirectBooking Technology Co., Ltd. has announced a 16-for-1 share consolidation to meet the minimum bid price requirement for continued listing on The Nasdaq Capital Market. The market is also seeing a decline in exchange-traded funds and equity futures amid AI disruption fears. Software stocks have plunged 24% in the past three months, but earnings estimates have risen by 5%.\n\n## Market & Business Implications\n* According to Article 1, software stocks have plunged 24% in the past three months, but two-year forward earnings for the stocks have risen by 5%, indicating a potential disconnect between stock prices and earnings estimates.\n* As stated in Article 2, Instacart's CEO Chris Rogers called concerns about the company's competitiveness in the grocery delivery market \"overblown\", and the company's strong earnings report has alleviated worries about mounting competitive pressures.\n* Article 4 reports that Instacart's revenue grew 12% from $883 million a year ago, and the company expects gross transaction value to range between $10.13 billion and $10.28 billion in the first quarter, ahead of StreetAccount's estimate.\n* Article 1 quotes Goldman Sachs strategist Ben Snider, who points out that the broader group of industries perceived to face the most risk from AI disruption have experienced positive revisions to their 2026 EPS estimates.\n* Article 5 states that DirectBooking Technology Co., Ltd. has announced a 16-for-1 share consolidation to meet the minimum bid price requirement for continued listing on The Nasdaq Capital Market.\n\n## Beginner-Friendly Summary\nThe stock market is changing a lot because of artificial intelligence. Some companies that make software are having a hard time. But a company called Instacart had good news and made people less worried about its future. Another company, DirectBooking, is making some changes to its stocks. The market is also a little scared about what artificial intelligence might do to some companies. Some software companies have lost a lot of value, but people still think they will make a lot of money in the future.",
    "articles": [
      {
        "title": "Software stock bulls are still making a lethal assumption",
        "link": "https://finance.yahoo.com/news/software-stock-bulls-are-still-making-a-lethal-assumption-135728557.html?.tsrc=rss",
        "published": "Tue, 17 Feb 2026 13:57:28 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The future isn't guaranteed to be bright and profitable, for any one person or company.\n\nThat could prove especially true for one-time untouchable software companies currently being battered by frequent AI advances from the likes of OpenAI (OPAI.PVT), Google (GOOG), and Anthropic (ANTH.PVT).\n\nSoftware companies such as Workday (WDAY) and Salesforce (CRM) are facing existential crises to their stock prices — yet the Wall Street bulls still don't appear to be getting the ultimate picture.\n\nThat could quickly be seen by how slow-moving they have been to cut forward earnings estimates. In fact, earnings estimates for software companies have trended higher despite seemingly daily evidence that AI will crush future profits!\n\nCheck out this new nugget from Goldman Sachs strategist Ben Snider.\n\nSnider points out that software stocks — as measured by the iShares Expanded Tech Software Sector ETF (IGV) — have plunged 24% in the past three months, but two-year forward earnings for the stocks have risen by 5%. Likewise, the broader group of industries recently perceived to face the most risk from AI disruption — such as insurance brokers and advertisers — have experienced positive revisions to their 2026 EPS estimates.\n\nSoftware stock bulls still need a wakeup call. · Goldman Sachs\n\nWhile Wall Street analysts are normally a very optimistic bunch when it comes to modeling future earnings for companies they cover for clients, what they are doing here with software borders on non-sensical.\n\nPrice tends to be truth in markets, and the crashing stock prices of software companies suggests an ugly reveal in the years ahead due to the AI takeover.\n\nThe sooner Wall Street respects this and cuts estimates to more realistic levels, the sooner these stocks can bottom. Plain and simple.\n\n\"When we have a category [software] that just not too long ago were trading at about a 35 times PE multiple and now they're down below 20 times, that's a significant sell off. That's the dark side of AI. An"
      },
      {
        "title": "Instacart jumps 9% on strong results as CEO calls grocery competition fears 'overblown'",
        "link": "https://www.cnbc.com/2026/02/13/instacart-cart-stock-ceo-grocery.html",
        "published": "Fri, 13 Feb 2026 22:16:07 GMT",
        "source": "Earnings",
        "text": "Instacart 's stock surged 9% after the company's robust results alleviated worries over mounting competitive pressures in the grocery delivery market.\n\nDuring an earnings call with analysts, CEO Chris Rogers, who took the helm last year, called the concerns \"overblown\" and said the company monitors threats \"extremely closely.\"\n\n\"There is definitely a market for us here and we feel good about our points of differentiation,\" he said.\n\nInstacart is facing an increasingly competitive market as retailers like Amazon and food platforms such as Uber Eats and Doordash aggressively scale in grocery delivery. At the same time, the company is investing in new technology and artificial intelligence tools to drive more customers and businesses to its platform.\n\nWall Street analysts viewed Instacart's results as a wave of confidence for those worried about the company's moat. Analysts at Bernstein called the report a \"solid rebuttal\" to competitive pressures and AI threats.\n\n\"The clean beat-and-raise has been rare this internet earnings cycle and CART stands out from that perspective,\" wrote analysts at Barclays."
      },
      {
        "title": "Exchange-Traded Funds, Equity Futures Lower Pre-Bell Tuesday Amid AI Disruption Fears",
        "link": "https://finance.yahoo.com/news/exchange-traded-funds-equity-futures-135217246.html?.tsrc=rss",
        "published": "Tue, 17 Feb 2026 13:52:17 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The broad market exchange-traded fund SPDR S&P 500 ETF Trust (SPY) was down 0.4% and the actively tr\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      },
      {
        "title": "Instacart stock pops 14% on revenue beat, optimistic guidance",
        "link": "https://www.cnbc.com/2026/02/12/instacart-cart-q4-2025-earnings.html",
        "published": "Thu, 12 Feb 2026 23:32:31 GMT",
        "source": "Earnings",
        "text": "Instacart shares climbed 14% during extended trading on Thursday after the grocery delivery company reported strong fourth-quarter revenue and forecast upbeat guidance.\n\nHere's how the company did versus LSEG estimates:\n\nEarnings per share : 30 cents vs. 52 cents expected\n\n: 30 cents vs. 52 cents expected Revenue: $992 million vs. $974 million expected\n\nFor the first quarter, Instacart expects gross transaction value, which tracks the value of goods sold, to range between $10.13 billion and $10.28 billion. That was ahead of StreetAccount's $9.97 billion estimate. The company expects adjusted earnings before interest, taxes, depreciation and amortization in the range of $280 million and $290 million, versus $277 million expected by StreetAccount.\n\nRevenue grew 12% from $883 million a year ago. Net income totaled $81 million, or 30 cents per share. The company reported adjusted EBITDA of $303 million, topping the $292 million expected by StreetAccount.\n\nIn a letter to shareholders, CEO Chris Rogers said Instacart's technology and customer-oriented approach are driving more growth and engagement to the platform.\n\n\"Our execution on what matters most to customers is driving strong momentum on our marketplace, as well as our enterprise platform — which is a real, strategic advantage for us,\" he said.\n\nInstacart also said its operating expenses rose year over year \"due to higher general and administrative expense driven by non-recurring legal and regulatory matters.\" That included a $60 million refund settlement with the Federal Trade Commission over alleged deceptive practices\n\nGross transaction value grew 14% from a year ago to $9.85 billion, surpassing a StreetAccount estimate of $9.54 billion. Instacart said this was its strongest quarter of growth for the metric in three years. Orders totaled 89.5 million orders, beating a StreetAccount estimate of 87.8 million.\n\nFinance chief Emily Reuter told CNBC that strong gains in Instacart's enterprise platform, where the compa"
      },
      {
        "title": "DirectBooking Technology Co., Ltd. Announces 16-for-1 Share Consolidation",
        "link": "https://finance.yahoo.com/news/directbooking-technology-co-ltd-announces-133000760.html?.tsrc=rss",
        "published": "Tue, 17 Feb 2026 13:30:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "HONG KONG, Feb. 17, 2026 (GLOBE NEWSWIRE) -- DirectBooking Technology Co., Ltd. (“DirectBooking Technology” or the “Company”, Nasdaq: ZDAI) announced that its board of directors, by unanimous written resolutions dated January 23, 2026, approved the implementation of a share consolidation (the “Share Consolidation”) to enable the Company to meet the minimum bid price requirement for continued listing on The Nasdaq Capital Market, its current stock exchange. The Share Consolidation is scheduled to become effective on February 17, 2026. The Company’s Class A Ordinary Shares will continue to trade on the Nasdaq Capital Market under the symbol “ZDAI” and are expected to begin trading on a split-adjusted basis when the market opens on February 19, 2026.\n\nThe Share Consolidation will be implemented at a ratio of 16 for 1. Upon the Share Consolidation becoming effective: (i) every 16 issued and unissued Class A ordinary shares of the Company, with a par value of US$0.00005 per share, will be consolidated into one Class A ordinary share, and the par value of each Class A ordinary share will be adjusted to US$0.0008; and (ii) every 16 issued and unissued Class B ordinary shares of the Company, with a par value of US$0.00005 per share, will be consolidated into one Class B ordinary share, and the par value of each Class B ordinary share will be adjusted to US$0.0008.\n\nThe Company’s total authorized share capital will remain unchanged at US$250,000, but will be reclassified as follows: (i) 250,000,000 Class A ordinary shares with a par value of US$0.0008 each; and (ii) 62,500,000 Class B ordinary shares with a par value of US$0.0008 each.\n\nThe board has also resolved that no fractional shares will be issued in connection with the Share Consolidation. Any fractional share entitlement arising from the consolidation ratio will be rounded to the nearest whole share at the participant level.\n\nThe Share Consolidation is also intended to streamline the Company’s share capital structur"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nThe Monad Foundation has hired three senior executives from Optimism, FalconX, and BVNK to expand its focus on institutional adoption. Harvard has sold a portion of its Bitcoin holdings and invested in Ethereum, with experts suggesting this is a \"relative value trade\" and a \"recalibration toward assets with multiple return drivers\". Binance holds 65% of centralized exchange stablecoin reserves, with $47.5 billion in USDT and USDC. The Africrypt founders, Raees and Ameer Cajee, have returned to South Africa after the collapse of their crypto investment platform. Stablecoin outflows from centralized exchanges have slowed sharply.\n\n## Market & Business Implications\n* The Monad Foundation has hired Urvit Goel, Joanita Titan, and Sagar Sarbhai to focus on capital markets strategy, brand building, and institutional adoption across Asia-Pacific jurisdictions (Article 1).\n* Harvard has trimmed its Bitcoin holdings and opened a new position in Ethereum, with its combined spot crypto ETF exposure now over $352 million (Article 2).\n* Binance holds $47.5 billion in USDT and USDC, accounting for 65% of total USDT and USDC held across centralized exchanges (Article 3).\n* The Africrypt founders, Raees and Ameer Cajee, have returned to South Africa, with investors still seeking to recover their losses after the platform's collapse (Article 5).\n* Stablecoin outflows from centralized exchanges have slowed, with only $2 billion in outflows over the past month, compared to $8.4 billion in late 2025 (Article 3).\n\n## Beginner-Friendly Summary\nSome big changes are happening in the crypto world. A company called Monad is hiring new people to help it work with big institutions. Harvard, a famous university, is changing its investments in Bitcoin and Ethereum. A big crypto exchange called Binance is holding a lot of stablecoins. The people who ran a crypto platform called Africrypt have returned to South Africa after it collapsed. Also, people are not taking their stablecoins out of exchanges as much as they used to.",
    "articles": [
      {
        "title": "Monad hires former FalconX, BVNK and Optimism executives",
        "link": "https://cointelegraph.com/news/monad-hires-ex-falconx-bvnk-and-optimism-executives-to-drive-institutional-expansion-post-mainnet-embargo-feb-17?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 17 Feb 2026 14:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "The Monad Foundation has hired three senior executives from Optimism, FalconX and BVNK as it expands its focus on institutional adoption following its November mainnet launch.\n\nUrvit Goel joins as vice president of go-to-market from the Optimism Foundation, Joanita Titan becomes head of institutional growth after leading custody and staking at FalconX, and Sagar Sarbhai joins as head of institutions for Asia-Pacific, most recently at BVNK.\n\nThe three executives previously held roles at JP Morgan, Deutsche Bank, Anchorage Digital, Fireblocks and Amazon, bringing backgrounds in traditional finance and institutional crypto infrastructure.\n\nAccording to an announcement shared with Cointelegraph, the new hires are expected to focus on capital markets strategy, brand building and institutional adoption across Asia-Pacific jurisdictions including Hong Kong, Singapore, Japan and South Korea.\n\nMonad launched its public mainnet in November along with a token sale on Coinbase. Since launch, the network has reached about $450 million in stablecoin market capitalization and more than $200 million in total value locked across decentralized finance protocols, according to the foundation.\n\nThe network says it can process up to 10,000 transactions per second with sub-second finality while remaining compatible with the Ethereum Virtual Machine. The foundation said the design targets use cases such as high-frequency trading and payments.\n\nIn 2024, Monad Labs, the development company behind the network, raised $225 million in a funding round led by Paradigm. The Monad Foundation now oversees ecosystem growth following mainnet launch.\n\nRelated: Perp DEXs will ‘eat’ expensive TradFi in 2026: Delphi Digital\n\nRecent layer-1 launches see steep token declines\n\nWhile 2021–2023 saw a surge of layer-1 blockchain launches, including Avalanche (AVAX), Near (NEAR), Aptos (APT), Sui (SUI) and others, the pace of new mainnets has slowed over the past year. Even so, Monad is not the only layer-1 bloc"
      },
      {
        "title": "Morning Minute: Harvard Sells Bitcoin for Ethereum",
        "link": "https://decrypt.co/358291/morning-minute-harvard-sells-bitcoin-for-ethereum",
        "published": "Tue, 17 Feb 2026 13:32:31 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nCreate an account to save your articles.\n\nCreate an account to save your articles.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors slightly red ahead of weekly open; BTC at $67k\n\nHarvard rotates a portion of BTC holdings into ETH\n\nSteak ‘n’ Shake says Bitcoin adoption dramatically increased sales\n\nKraken to sponsor Trump Accounts in Wyoming\n\nAndre Cronje opens Flying Tulip sale to the public at $1B valuation\n\n🎓 Harvard Just Sold Bitcoin for Ethereum\n\nThe smartest money in the room is rotating.\n\n📌 What Happened\n\nIn a 13F filing with the SEC, Harvard disclosed that it trimmed 1.46M shares of BlackRock’s iShares Bitcoin Trust (IBIT) during Q4, bringing that position down to approximately $265M.\n\nAt the same time, it opened a brand-new position of 3,873,044 shares in BlackRock’s iShares Ethereum Trust, worth roughly $86.8M.\n\nOverall, their combined spot crypto ETF exposure at quarter-end topped just over $352M.\n\nHarvard first disclosed a $116M IBIT position in August 2025. By November, it had tripled those holdings to roughly $350M.\n\nNow they’ve trimmed BTC and rotated capital into ETH.\n\n🗣️ What They’re Saying\n\nSean Bill, co-founder and CIO of Bitcoin Standard Treasury Company, told Decrypt that Harvard is likely “making a relative value trade with the belief that ETH is undervalued relative to BTC.”\n\nJennifer Ouarrag, Head of Legal at institutional staking provider Twinstake, described it as a “recalibration toward assets with multiple return drivers,” noting that while Bitcoin remains “the primary institutional store-of-value proxy,” Ethereum “offers exposure to a broader smart-contract ecosystem.”\n\n🧠 Why It Matters\n\nHarvard selling Bitcoin? Not great.\n\nHarvard selling Bitcoin to buy ETH? Well, that’s"
      },
      {
        "title": "Binance holds 65% of CEX stablecoin reserves as outflows cool: CryptoQuant",
        "link": "https://cointelegraph.com/news/stablecoin-outflows-slow-binance-65-cex-usdt-usdc-reserves?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 17 Feb 2026 13:55:26 +0000",
        "source": "Cointelegraph.com News",
        "text": "Stablecoin outflows from centralized exchanges have slowed sharply even as CryptoQuant’s indicators continue to flag weak market conditions, a sign that investor capital is consolidating rather than leaving the sector, the market data provider said.\n\nFlows on centralized exchanges (CEXs) have stabilized, with outflows totaling just $2 billion over the past month, CryptoQuant said in a statement to Cointelegraph on Tuesday.\n\nBy contrast, late 2025 saw $8.4 billion in outflows at the start of the bear market, highlighting the moderation in redemptions, CryptoQuant’s marketing head Nick Pitto told Cointelegraph.\n\n“Capital isn’t rushing out of crypto right now; it’s consolidating, particularly on Binance,” Pitto said, adding that the trend would turn bullish only when reserves begin growing or are deployed into risk assets.\n\nBinance holds 65% of CEX stablecoin reserves in USDT and USDC\n\nAccording to CryptoQuant’s data, Binance remains the primary hub for stablecoin liquidity, holding $47.5 billion in Tether’s USDt (USDT) and Circle’s USDC (USDC), the two largest stablecoins by market capitalization.\n\nThe figure accounts for 65% of total USDT and USDC held across CEXs, and is up 31% from $35.9 billion a year ago.\n\nMajor exchanges such as OKX, Coinbase and Bybit lag Binance in stablecoin reserves, with OKX ranking best of the rest at 13% and $9.5 billion.\n\nCoinbase and Bybit account for 8% and 6%, respectively, with reserves of $5.9 billion and $4 billion.\n\nRelated: Arkham Exchange pivoting to fully decentralized platform, CEO says\n\nWith Binance dominating stablecoin liquidity even as bear market outflows slow, CryptoQuant concluded: “Capital isn’t leaving crypto, it’s concentrating.”\n\nBinance’s stablecoin liquidity is mainly driven by USDT\n\nBinance’s stablecoin reserves are overwhelmingly driven by USDT, with the exchange holding $42.3 billion in the stablecoin, compared to $5.2 billion in USDC.\n\nThe exchange has increased its USDT liquidity by 36% year-on-year, while US"
      },
      {
        "title": "Congressman Calls for Review of Overseas Support for Autonomous Vehicles",
        "link": "https://decrypt.co/358267/congressman-overseas-support-autonomous-vehicles",
        "published": "Tue, 17 Feb 2026 13:01:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief A House Republican is urging the DOT to investigate AV companies' use of foreign-based remote operators following a Senate testimony.\n\nRep. Buddy Carter's letter flags safety, English proficiency, passenger privacy, and national security risks from overseas operators on U.S. roads.\n\nCarter also asking regulators to review whether in-car audio and video data can be accessed by foreign personnel, raising passenger privacy concerns.\n\nA House Republican has urged the U.S. transport regulator to investigate autonomous-vehicle companies’ use of foreign-based remote assistance operators, escalating congressional scrutiny after recent Senate testimony revealed overseas human involvement in U.S. robotaxi operations.\n\nRep. Buddy Carter (R-GA) has sent a letter to Transportation Secretary Sean Duffy calling on the Department of Transportation to examine the use of foreign-based Remote Assistance Operators (RAOs) by AV companies on American public roads.\n\nThe push for the probe follows Waymo’s earlier claims of driverless autonomy, which drew scrutiny after Chief Safety Officer Dr. Mauricio Peña disclosed under oath before the Senate Commerce Committee that the company employs remote vehicle operators in the Philippines, raising questions about what “self-driving” actually means.\n\n<span data-mce-type=\"bookmark\" style=\"width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nIn the letter shared exclusively to and seen by Decrypt, Carter warned that decisions on U.S. roads \"may be influenced—or directly controlled—by individuals who are not Americans, are not subject to U.S. jurisdiction, and may not understand English, our road signs, and American traffic laws,\" adding that the arrangement raises \"serious and reasonable concerns about roadway safety, situational awareness, and national security.\"\n\n\"Users of autonomous vehicle services are currently in the dark about their saf"
      },
      {
        "title": "Africrypt founders back in South Africa years after platform collapse: Report",
        "link": "https://cointelegraph.com/news/bitcoin-brothers-return-south-africa-africrypt-cajee-carte-blanche?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 17 Feb 2026 13:29:19 +0000",
        "source": "Cointelegraph.com News",
        "text": "South Africa’s so-called “Bitcoin Brothers,” Raees and Ameer Cajee, have quietly returned to the country years after the collapse of their crypto investment platform Africrypt, according to a new TV investigation.\n\nA segment aired Sunday by investigative program “Carte Blanche” said the pair is residing inside the gated Zimbali Estate in KwaZulu-Natal, MyBroadband reported on Monday. According to the report, journalists attempted to approach the property but were blocked by private security.\n\nThe team also reportedly traced the brothers to a holiday location in Umhlanga and a recent address in Johannesburg, but failed to make direct contact.\n\nGerhard Botha, a lawyer representing an investor who claims to have lost about $50 million, said legal papers have still not been served. “They can protect themselves. They’ve got security. Because they have money,” Botha told the program.\n\nCointelegraph reached out to law firms representing duped investors for comment, but had not received a response by publication.\n\nRelated: Remittances ‘more important than aid’ as Africa turns to stablecoins\n\nAfricrypt pitched 13% monthly returns\n\nThe Cajees operated Africrypt between 2019 and 2021, promoting the platform as a high-yield crypto investment service. Investors were promised returns of up to 13% per month through a proprietary trading system said to rely on artificial intelligence. The company accepted deposits in both South African rand and cryptocurrency.\n\nAfricrypt unraveled on April 13, 2021, when the founders informed users that the platform had been hacked and its holdings stolen. Weeks later, the brothers left South Africa, eventually traveling through the Maldives before reaching Dubai amid pandemic travel restrictions.\n\nEarly media reports suggested as much as $3.6 billion had disappeared, but subsequent investigations placed the figure closer to $40 million to $50 million, according to MyBroadband. The exact amount of investor losses remains unknown.\n\nA fund manager cl"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-17T14:10:57.374898+00:00"
  }
}