{
  "Tech": {
    "summary": "## Executive Summary\nHarbinger has acquired autonomous driving software company Phantom AI to expand its technology portfolio. Amazon has introduced new personality style presets for Alexa, allowing users to customize their experience. A user's experience with a .online domain name ended in disaster due to safety concerns. Password managers' claims of being \"zero knowledge\" have been debunked by new research. Ailias is offering 3D hologram avatars of historical figures for educational and entertainment purposes.\n\n## Market & Business Implications\n* Harbinger's acquisition of Phantom AI is expected to generate \"millions\" of dollars in revenue this year, with more significant revenue expected in 2027 or 2028, according to Harbinger co-founder and CEO John Harris (Article 1).\n* Amazon has launched three new personality style presets for Alexa, including Brief, Chill, and Sweet, to allow users to customize their experience (Article 2).\n* Research has shown that password managers' claims of being \"zero knowledge\" are not entirely true, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups (Article 4).\n* Ailias is offering 3D hologram avatars of historical figures, including Isaac Newton, for educational and entertainment purposes, with pricing available on request (Article 5).\n* The use of .online domain names can lead to safety concerns, as one user's experience ended in disaster due to their site being removed from Google's Safe Search blacklist (Article 3).\n\n## Beginner-Friendly Summary\nSome big things happened in the tech world. A company called Harbinger bought another company to help with self-driving cars. Amazon made it so you can change how their voice assistant, Alexa, talks to you. Someone had a bad experience with a website because of safety concerns. It was also found out that some password keepers aren't as safe as they say. And a company is making holograms of famous people from history that you can talk to.",
    "articles": [
      {
        "title": "Harbinger acquires autonomous driving company Phantom AI",
        "link": "https://techcrunch.com/2026/02/25/harbinger-acquires-autonomous-driving-company-phantom-ai/",
        "published": "Wed, 25 Feb 2026 14:00:00 +0000",
        "source": "TechCrunch",
        "text": "Electric trucking startup Harbinger has acquired autonomous driving software company Phantom AI, in an effort to vertically integrate more technology and create new revenue streams for the young company.\n\nThe acquisition, which is Harbinger’s first, is part of the startup’s plan to steadily expand its portfolio beyond the electric truck chassis it’s been building and selling for the last year. Just last month, Harbinger announced it would start selling its battery packs for energy storage and auxiliary power, with Airstream as the first customer.\n\nHarbinger announced Wednesday it has already lined up a customer for Phantom’s advanced driver assistance tech that it just acquired. German automotive technology giant ZF Group has agreed to license that tech from Harbinger, and plans to sell it to automakers for use in their passenger cars. (Terms of the two deals were not disclosed.)\n\nHarbinger co-founder and CEO John Harris told TechCrunch in an exclusive interview that he expects this new software services business line to generate “millions” of dollars in revenue this year, which he said is mostly “not material” compared to the amount the company will make from selling its truck chassis. The startup recently raised $160 million in a funding round co-led by FedEx and THOR Industries, both of which are customers.\n\nHarris instead expects the ZF Group deal will bring in more significant revenue in 2027 or 2028.\n\n“The passenger car market is slower, but the volumes are very, very large,” he said.\n\nHarbinger was already using Phantom AI’s driver assistance tech, Harris said, and the acquisition will see the companies deepen that integration. Harris expects that to be a big win for Harbinger’s own customers.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the"
      },
      {
        "title": "You can now make Alexa’s AI personality more friendly, blunt, or chilled out",
        "link": "https://www.theverge.com/tech/884269/amazon-alexa-plus-personality-styles-availability",
        "published": "2026-02-25T09:00:00-05:00",
        "source": "The Verge",
        "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nAmazon is giving you more control over how Alexa behaves during conversations and responses. Three “personality style” presets are launching today for Alexa Plus users in the US that allow you to make the AI-powered voice assistant more concise, cheerful, or relaxed, depending on your personal preferences.\n\n“Alexa’s personality is one of the things customers tell us they love most about Alexa,” Amazon said in its press release. “That familiar voice and personality have become a part of so many customers’ daily lives, but here’s what we’ve learned from customers since launching Alexa Plus: everyone has their own communication style and preferences, and a truly personal assistant should adapt to match it.”\n\nThe new style presets are Brief, Chill, and Sweet. Contrary to how much people supposedly “love” Alexa’s current base personality, Amazon said the Brief option is being introduced in response to “customer requests for shorter, more direct responses,” providing a blunt communication style that “cuts straight to the point with no-nonsense.” Chill is described as having a relaxed energy that feels like chatting with a laid-back friend, while Sweet is designed to be “your biggest cheerleader” by providing more enthusiasm and encouragement.\n\nAs someone who finds overtly bubbly and affable robots annoying, I certainly see the appeal of the Brief personality style. The Sweet option feels like something that would make me want to throw my Echo speakers into the nearest river. There’s clearly a market for people who want their AI assistants to behave like an affectionate companion, however, which has prompted wider concerns about people getting unhealthily attached to the bots.\n\nThe new Alexa Plus personalities are supported for eight Alexa voice options. You can change the personality styles by saying “Alexa, change your personality style,” or heading into the Alexa app and selecting y"
      },
      {
        "title": "Never Buy A .online Domain",
        "link": "https://www.0xsid.com/blog/online-tld-is-pain",
        "published": "Wed, 25 Feb 2026 13:31:17 +0000",
        "source": "Hacker News: Front Page",
        "text": "I’ve been a .com purist for over two decades of building. Once, I broke that rule and bought a .online TLD for a small project.This is the story of how it went up in flames.\n\nUpdate: Within 40 minutes of posting this on HN, the site has been removed from Google's Safe Search blacklist. Thank you, unknown Google hero! I've emailed Radix to remove the darn serverHold .\n\nPost, for posterity, below.\n\nNamecheap's Alluring Offer\n\nEarlier this year, Namecheap was running a promo that let you choose one free .online or .site per account. I was working on a small product and thought, \"hey, why not?\" The app was a small browser, and the .online TLD just made sense in my head.\n\nAfter a tiny $0.20 to cover ICANN fees, and hooking it up to Cloudflare and GitHub, I was up and running. Or so I thought.\n\nThe Disappearing Act\n\nPoking around traffic data for an unrelated domain many weeks after the purchase, I noticed there were zero visitors to the site in the last 48 hours. Loading it up led to the dreaded, all red, full page \"This is an unsafe site\" notice. The site had a link to the App Store, some screenshots (no gore or violence or anything of that sort), and a few lines of text about the app, nothing else that could possibly cause this. [1]\n\nClicking through the disclaimers to load the actual site to check if it had been defaced, I was greeted with a \"site not found\" error. Uh oh.\n\nInitial Recon\n\nAfter checking that Cloudflare was still activated and the CF Worker was pointing to the domain, I went to the registrar first. Namecheap is not the picture of reliability, so it seemed like a good place to start. The domain showed up fine on my account with the right expiration date. The nameservers were correct and pointed to CF.\n\nPerplexed, I ran a quick dig NS getwisp.online +short . Empty.\n\nMaybe I had gotten it wrong, so I checked the WHOIS information online. Status: serverHold . Oh no...\n\nStuck in No-Man’s-Land\n\nAt this point, I double checked to make sure I hadn't received em"
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Talk to Your Own Personal Isaac Newton With Ailias’s Hologram Avatars",
        "link": "https://www.wired.com/story/ailias-hologram-avatars/",
        "published": "Wed, 25 Feb 2026 12:00:00 +0000",
        "source": "WIRED",
        "text": "It’s the classic awkward icebreaker: If you could invite anyone, dead or alive, to a dinner party, who would it be? Aristotle? Ailias is a company based in Surrey, UK, which promises to make that hypothetical a reality. It can reanimate historical and current legends with 3D hologram avatars that are fully conversational, knowledgeable, and can be delivered to you in a box.\n\nThe technology isn’t bespoke. Many companies provide life-size hologram displays for events and parties, everything from floating 3D displays of Santa’s sleigh or 3D Holo-Trucks. The physicist Dennis Gabor even won a Nobel Prize in 1971 for his work that led to holography, even though a life-size Elon Musk isn't probably the result that he (or anyone) had in mind.\n\nWhat sets Ailias apart is the company's playful focus on history and education, which the company describes as “ultra character creation.” The company focuses on animating dead notable personalities into real-feeling conversational holograms, designed for interaction rather than spectacle. Ailias' holograms can juggle, do squats, or even breakdance, making your party, exhibition or just about any event an extra special occasion.\n\nMan in the Box\n\nVideo: Dulcie Godfrey\n\nAilias offers pricing on request, with costs varying depending on whether clients opt for rental, purchase, or whether you’re seeking bespoke characters and activation. When I visited the offices, director Adrian Broadway noted that a minimum week's rental would run into the thousands of pounds, which includes software subscription costs, delivery, and installation.\n\nAilias’ current roster has over 70 characters that could be staged in their bespoke boxes, including Henry VIII, Beethoven, Julius Caesar, and a suspiciously sexy Cleopatra. That these are mostly historical figures is no coincidence—Broadway describes these boxes as great for educational settings or museum exhibitions, but admits it also has to do with copyright restrictions on characters as well.\n\nIn the Un"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nAdobe Firefly's video editor now features a Quick Cut tool that uses AI to create a first draft of a video based on user instructions. Amazon has introduced new personality styles for its Alexa AI assistant, allowing users to choose from Brief, Chill, and Sweet options. Ailias, a UK-based company, offers 3D hologram avatars of historical figures that can be conversational and interactive. Amazon's new Alexa personality styles are built on five dimensions of personality and can be changed through voice commands or the Alexa app. \n\n## Market & Business Implications\n* Adobe Firefly's Quick Cut feature aims to save users time by automatically editing footage and creating a first draft of a video, as stated by Mike Folgner, product lead for AI and next-generation video tools (Article 1).\n* Ailias offers pricing on request for its 3D hologram avatars, with costs varying depending on rental, purchase, or bespoke character options, and a minimum week's rental can run into the thousands of pounds (Article 2).\n* Amazon's new Alexa personality styles are available for Alexa Plus users in the US and can be changed through voice commands or the Alexa app, with three initial styles: Brief, Chill, and Sweet (Article 3 and Article 4).\n\n## Beginner-Friendly Summary\nAdobe has a new tool that helps make videos faster using artificial intelligence. Amazon's voice assistant, Alexa, now has different personality options that users can choose from. A company called Ailias is making interactive holograms of famous people from history. Amazon's new Alexa personalities can be changed easily.",
    "articles": [
      {
        "title": "Adobe Firefly’s video editor can now automatically create a first draft from footage",
        "link": "https://techcrunch.com/2026/02/25/adobe-fireflys-video-editor-can-now-automatically-create-a-first-draft-from-footage/",
        "published": "Wed, 25 Feb 2026 14:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "The video editor in Adobe Firefly is getting a new feature called Quick Cut that uses AI to edit footage and B-roll to create a first draft of the final video based on user instructions.\n\nTypically, you have to upload your footage and B-roll into a video editor, and manually arrange transitions. With Quick Cut, users can describe what they want the video to be in natural language, and the tool will automatically edit out irrelevant parts of the footage, and put together the different takes while using appropriate footage to make transitions between cuts.\n\nUsers can also pick frames from the B-roll and use one of the video models available within Firefly to create short transitions.\n\nYou can use the prompt box within the Firefly video editor to specify settings like aspect ratio and pacing between transitions, or add optional B-roll footage. Users can apply Quick Cut to the entire project, a particular timeline, or selected clips.\n\nLoading the player…\n\nAdobe stressed that the aim of Quick Cut is to deliver a first draft, so editors will still need to adjust elements, paste takes together, and work on transitions to put together the video.\n\n“As we talk to our users, who are creators and marketers, the biggest problem they actually communicate is the need for fast turnaround, the need for time-saving techniques that just let them get to their creative vision as fast as possible,” Mike Folgner, product lead for AI and next-generation video tools, told TechCrunch.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately.\n\n\n\nOffer ends March 13. Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunc"
      },
      {
        "title": "Talk to Your Own Personal Isaac Newton With Ailias’s Hologram Avatars",
        "link": "https://www.wired.com/story/ailias-hologram-avatars/",
        "published": "Wed, 25 Feb 2026 12:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "It’s the classic awkward icebreaker: If you could invite anyone, dead or alive, to a dinner party, who would it be? Aristotle? Ailias is a company based in Surrey, UK, which promises to make that hypothetical a reality. It can reanimate historical and current legends with 3D hologram avatars that are fully conversational, knowledgeable, and can be delivered to you in a box.\n\nThe technology isn’t bespoke. Many companies provide life-size hologram displays for events and parties, everything from floating 3D displays of Santa’s sleigh or 3D Holo-Trucks. The physicist Dennis Gabor even won a Nobel Prize in 1971 for his work that led to holography, even though a life-size Elon Musk isn't probably the result that he (or anyone) had in mind.\n\nWhat sets Ailias apart is the company's playful focus on history and education, which the company describes as “ultra character creation.” The company focuses on animating dead notable personalities into real-feeling conversational holograms, designed for interaction rather than spectacle. Ailias' holograms can juggle, do squats, or even breakdance, making your party, exhibition or just about any event an extra special occasion.\n\nMan in the Box\n\nVideo: Dulcie Godfrey\n\nAilias offers pricing on request, with costs varying depending on whether clients opt for rental, purchase, or whether you’re seeking bespoke characters and activation. When I visited the offices, director Adrian Broadway noted that a minimum week's rental would run into the thousands of pounds, which includes software subscription costs, delivery, and installation.\n\nAilias’ current roster has over 70 characters that could be staged in their bespoke boxes, including Henry VIII, Beethoven, Julius Caesar, and a suspiciously sexy Cleopatra. That these are mostly historical figures is no coincidence—Broadway describes these boxes as great for educational settings or museum exhibitions, but admits it also has to do with copyright restrictions on characters as well.\n\nIn the Un"
      },
      {
        "title": "You can now make Alexa’s AI personality more friendly, blunt, or chilled out",
        "link": "https://www.theverge.com/tech/884269/amazon-alexa-plus-personality-styles-availability",
        "published": "2026-02-25T09:00:00-05:00",
        "source": "AI | The Verge",
        "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nAmazon is giving you more control over how Alexa behaves during conversations and responses. Three “personality style” presets are launching today for Alexa Plus users in the US that allow you to make the AI-powered voice assistant more concise, cheerful, or relaxed, depending on your personal preferences.\n\n“Alexa’s personality is one of the things customers tell us they love most about Alexa,” Amazon said in its press release. “That familiar voice and personality have become a part of so many customers’ daily lives, but here’s what we’ve learned from customers since launching Alexa Plus: everyone has their own communication style and preferences, and a truly personal assistant should adapt to match it.”\n\nThe new style presets are Brief, Chill, and Sweet. Contrary to how much people supposedly “love” Alexa’s current base personality, Amazon said the Brief option is being introduced in response to “customer requests for shorter, more direct responses,” providing a blunt communication style that “cuts straight to the point with no-nonsense.” Chill is described as having a relaxed energy that feels like chatting with a laid-back friend, while Sweet is designed to be “your biggest cheerleader” by providing more enthusiasm and encouragement.\n\nAs someone who finds overtly bubbly and affable robots annoying, I certainly see the appeal of the Brief personality style. The Sweet option feels like something that would make me want to throw my Echo speakers into the nearest river. There’s clearly a market for people who want their AI assistants to behave like an affectionate companion, however, which has prompted wider concerns about people getting unhealthily attached to the bots.\n\nThe new Alexa Plus personalities are supported for eight Alexa voice options. You can change the personality styles by saying “Alexa, change your personality style,” or heading into the Alexa app and selecting y"
      },
      {
        "title": "Amazon’s AI-powered Alexa+ gets new personality options",
        "link": "https://techcrunch.com/2026/02/25/amazons-ai-powered-alexa-gets-new-personality-options/",
        "published": "Wed, 25 Feb 2026 14:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Amazon is introducing a new feature that will allow users to change the personality of its AI assistant, Alexa+. On Wednesday, the company launched three new Alexa+ personality styles — Brief, Chill, and Sweet — that will change the AI assistant’s tone.\n\nIn the Brief style, Alexa will respond with shorter, direct responses, while the Chill style will see Alexa answer more like a laid-back friend. Enabling the Sweet style, meanwhile, will have Alexa become warmer and more enthusiastic, offering encouragement and positivity, says Amazon.\n\nThe idea of infusing an AI with a personality has been a complicated issue for model makers.\n\nFor some chatbot users, a flattering and affirming AI model, like OpenAI’s GPT-4o, led some users to develop an unhealthy dependency on the technology. In a few cases, it even exacerbated the user’s existing mental health issues, leading to crises or even suicides, multiple lawsuits have alleged.\n\nStill, chatbot users have shown a preference for controlling how their AI responds, even writing custom instructions to dictate the AI’s personality. To address this need, OpenAI launched new ChatGPT features in December that allow users to adjust the AI’s base style and tone in terms of its warmth, enthusiasm and use of emoji, among other things. Despite this, some users are complaining that the latest model is too reassuring by default.\n\nAmazon says its new styles for Alexa have been built on five dimensions that contribute to its personality: expressiveness, emotional openness, formality, directness, and humor. Each style represents specific levels of all five factors. For instance, Brief isn’t just concise, it’s also casual, direct, and uses minimal humor, the company says.\n\nTo change Alexa’s style, you can either speak to the AI assistant via a device, like an Echo speaker, or access the feature in the Alexa app’s Device Settings under “Personality Style.”\n\nThe company notes that these three styles are only the first to ship, and others will b"
      },
      {
        "title": "AI Will Never Be Conscious",
        "link": "https://www.wired.com/story/book-excerpt-a-world-appears-michael-pollan/",
        "published": "Tue, 24 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "The Blake Lemoine incident is remembered today as a high‑water mark of AI hype. It thrust the whole idea of conscious AI into public awareness for a news cycle or two, but it also launched a conversation, among both computer scientists and consciousness researchers, that has only intensified in the years since. While the tech community continues to publicly belittle the whole idea (and poor Lemoine), in private it has begun to take the possibility much more seriously. A conscious AI might lack a clear commercial rationale (how do you monetize the thing?) and create sticky moral dilemmas (how should we treat a machine capable of suffering?). Yet some AI engineers have come to think that the holy grail of artificial general intelligence—a machine that is not only supersmart but also endowed with a human level of understanding, creativity, and common sense—might require something like consciousness to attain. In the tech community, what had been an informal taboo surrounding conscious AI—as a prospect that the public would find creepy—suddenly began to crumble.\n\nCourtesy of Penguin Press Buy This Book At: Amazon\n\nBookshop.org\n\nTarget If you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\n\nThe turning point came in the summer of 2023, when a group of 19 leading computer scientists and philosophers posted an 88‑page report titled “Consciousness in Artificial Intelligence,” informally known as the Butlin report. Within days, it seemed, everyone in the AI and consciousness science community had read it. The draft report’s abstract offered this arresting sentence: “Our analysis suggests that no current AI systems are conscious, but also suggests that there are no obvious barriers to building conscious AI systems.”\n\nThe authors acknowledged that part of the inspiration behind convening the group and writing the report was “the case of Blake Lemoine.” “If AIs can give the impression of consciousness,” a coauth"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nNvidia's earnings are anticipated, and tech stocks are rebounding. David Tepper, a billionaire founder of Appaloosa Management, sent a letter to Whirlpool's board, criticizing the company for destroying shareholder value. AerCap Holdings reported solid results in Q4, and its stock performed well. President Trump delivered a State of the Union address, focusing on the economy and proposing a government-backed 401(k)-like plan. American Airlines found possible bullet holes on one of its planes after a flight from Colombia.\n\n## Market & Business Implications\n* Dan Ives, a tech analyst at Wedbush, stated that new AI tools will not replace existing software ecosystems, as mentioned in Article 1.\n* David Tepper's letter to Whirlpool's board criticized the company's decision to issue equity, which resulted in a 14% drop in the company's shares, as reported in Article 2.\n* AerCap Holdings' stock closed at $148.06 per share on February 24, 2026, with a one-month return of 3.80% and a 52-week return of 44.67%, according to Article 4.\n* American Airlines found possible bullet holes on one of its planes after a flight from Colombia, and the incident is under investigation, as stated in Article 3.\n* President Trump proposed a government-backed 401(k)-like plan for U.S. workers who don't receive a retirement match from their employer, as mentioned in Article 5.\n\n## Beginner-Friendly Summary\nThere are some big things happening in the world of money and business. A big tech company called Nvidia is about to share its earnings, and that's making some people excited. A rich man named David Tepper is upset with a company called Whirlpool because he thinks they're making bad decisions. A company that leases airplanes had a good quarter and made some money. The President of the United States gave a big speech and talked about the economy, and also proposed a new idea for helping people save money for retirement. And finally, an American Airlines plane was found with some mysterious holes in it after a flight from Colombia.",
    "articles": [
      {
        "title": "Tech news today: Nvidia earnings on deck as tech stocks rebound, Anthropic relieves some AI fears",
        "link": "https://finance.yahoo.com/news/live/tech-news-today-nvidia-earnings-on-deck-as-tech-stocks-rebound-anthropic-relieves-some-ai-fears-140009329.html",
        "published": "2026-02-25T14:00:09Z",
        "source": "Yahoo Finance",
        "text": "Anthropic on Tuesday announced a new suite of enterprise offerings, the latest in a series of new capabilities boasted by AI labs like Google, Anthropic, and OpenAI that have shaken investor confidence in a variety of software solutions that may see their core product replaced by an AI facsimile.\n\nBut some Wall Street analysts aren't so sure the process will be quite that simple.\n\nDan Ives, high profile tech bull at Wedbush, wrote in a note Tuesday after Anthropic's announcement that, \"While these use cases are impressive, the reality is that these new AI tools will not rip and replace existing software ecosystems and data environments with these AI tools only as useful as the data it can reach.\"\n\nIn Ives' view, there are three things investors who view these demos as a sign of AI outcompeting legacy solutions might be missing.\n\nOne — \"The market is conflating foundation model capability with full enterprise software replacement and the fear that generative AI will 'rewrite legacy systems overnight' ignores enterprise reality.\"\n\nTwo — \"AI agents and autonomous workflows dramatically increase the attack surface — more APIs, more machine identities, more lateral movement risk, and more cloud-native workloads. AI doesn’t reduce the need for endpoint, identity, cloud, and SOC automation, it multiplies it.\"\n\nThree — \"Anthropic/OpenAI do not have 20-year enterprise distribution networks, CIO relationships, or embedded vertical workflows. CRM, NOW, and MSFT sit at the application layer where business logic lives. The model layer will commoditize faster than the workflow layer.\"\n\nThe key point that I think Ives raises is that model advances — or other signs of what we might call technical brilliance — are not the same as an in-market product that gets customers to change their spending habits.\n\nObviously, as we saw with the market's reaction to a Substack post on Monday that was explicitly a thought experiment, there are lots of investor nerves about which advances could dr"
      },
      {
        "title": "David Tepper sends scathing letter to Whirlpool for destroying shareholder value, pushes for changes",
        "link": "https://www.cnbc.com/2026/02/25/david-tepper-sends-scathing-letter-to-whirlpool.html",
        "published": "Wed, 25 Feb 2026 14:09:54 GMT",
        "source": "US Top News and Analysis",
        "text": "David Tepper, billionaire founder of hedge fund Appaloosa Management, sent a strongly worded letter to Whirlpool 's board, accusing the appliance maker of destroying shareholder value and calling for sweeping changes to its strategy and leadership.\n\nTepper said in the letter obtained by CNBC's Andrew Ross Sorkin that he watched \"with astonishment\" as the company issued equity in what he called a large and unnecessary dilution of shareholders. He argued the capital raise came at a cost exceeding 10%, far higher than the company's tax-adjusted debt cost of below 5% in public markets, despite management's stated goal of reducing leverage.\n\nWhirlpool shares tanked 14% on Tuesday amid the secondary share sale, which will $454.9 million from the common stock offering and $508.1 million from the depositary share offering, according to the company. Whirlpool also sold Guangdong Whirlpool Electrical Appliances 435,000 shares at a discounted $69 a share in a private placement.\n\n\"Enough is enough. There can be no more excuses,\" Tepper's letter said.\n\nWhirlpool was the eighth-biggest holding in Appaloosa Management's portfolio at the end of the fourth quarter, worth $282 million, according to Verity data.\n\nShares of Whirlpool rose nearly 1% after the news. The stock has tumbled nearly 36% from its 52-week high from July.\n\nThe hedge fund manager also faulted Whirlpool for failing to capitalize on tariffs instituted under the Trump administration, saying the company should explore partnerships or potential mergers with disadvantaged foreign competitors to strengthen its strategic position. Tepper urged directors to uphold their fiduciary duties and not allow management to act purely in its own self interest.\n\nThis is breaking news. Please refresh for updates."
      },
      {
        "title": "Possible bullet holes mysteriously appear on American Airlines plane after flight from Colombia",
        "link": "https://www.foxbusiness.com/lifestyle/possible-bullet-holes-mysteriously-appear-american-airlines-plane-after-flight-from-colombia",
        "published": "Tue, 24 Feb 2026 23:34:17 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "An American Airlines jet was found Monday with possible bullet holes on its exterior after completing a flight from Medellin, Colombia, to Miami.\n\nThe damage was discovered during a routine postflight inspection of the Boeing 737 MAX 8 at Miami International Airport.\n\nAccording to Airlive.net , the puncture marks resembled bullet holes and were found on the plane’s right wing assembly.\n\nAmerican Airlines confirmed to FOX Business that the plane was impacted and is currently undergoing inspection.\n\nAMERICA’S AIRPORT AFFORDABILITY GAP: CITIES WHERE TRAVEL COSTS ARE CRUSHING FAMILIES\n\n\"Following a routine inspection, our teams identified a puncture to the exterior of one of our aircraft in Medellín, Colombia,\" the airline said.\n\n\"The aircraft was immediately removed from service for further inspection and repair. We will work closely with all relevant authorities to investigate this incident.\"\n\n'SECURITY-RELATED SITUATION' GROUNDS FIGHT TO VACATION HOT SPOT, PASSENGERS CONFINED FOR HOURS\n\nThe plane, registered as N342SX, first departed Miami Sunday as Flight AA923 for Medellín’s José María Córdova International Airport, where it stayed overnight in Colombia, according to AirNavRadar.\n\nThe next morning, it completed its return leg as Flight AA924, landing in Miami at approximately 10:33 a.m.\n\nThe flight cruised without any issues during its three-hour journey over the Caribbean, and no one was reported injured, the airline told FOX Business.\n\nDuring the inspection, maintenance crews noticed puncture marks on the right aileron, the part of the wing that controls roll and allows the airplane to turn, Airlive.net reported.\n\nTicker Security Last Change Change % AAL AMERICAN AIRLINES GROUP INC. 13.15 +0.22 +1.70%\n\nWhile the cause of the possible gunfire remains under investigation, the incident has raised concerns about safety in Medellín. The city, now a popular and vibrant destination for tourists, was once notorious in the 1990s for high levels of violence and drug-relate"
      },
      {
        "title": "Solid Results Lifted AerCap Holdings (AER) in Q4",
        "link": "https://finance.yahoo.com/news/solid-results-lifted-aercap-holdings-140005950.html",
        "published": "2026-02-25T14:00:05Z",
        "source": "Yahoo Finance",
        "text": "The London Company, an investment management company, released its fourth-quarter 2025 investor letter for its “The London Company Mid Cap Strategy”. A copy of the letter can be downloaded here. In Q4 2025, US equities posted the third consecutive quarter of higher returns, with the Russell 3000 Index rising 2.4%. The market highlighted how investors balanced the optimism on earnings growth and concerns regarding AI returns and cooling macroeconomic factors. In the quarter, the portfolio returned 3.2% (3.0% net) compared to a 0.2% increase in the Russell Midcap Index. Both stock selection and sector exposure contributed to the relative performance of the portfolio in the quarter. In addition, please check the Strategy’s top five holdings to know its best picks in 2025.\n\nIn its fourth-quarter 2025 investor letter, London Company Mid Cap Strategy highlighted AerCap Holdings N.V. (NYSE:AER). AerCap Holdings N.V. (NYSE:AER) is a leading aviation leasing company headquartered in Dublin, Ireland. On February 24, 2026, AerCap Holdings N.V. (NYSE:AER) stock closed at $148.06 per share. One-month return of AerCap Holdings N.V. (NYSE:AER) was 3.80%, and its shares gained 44.67% over the past 52 weeks. AerCap Holdings N.V. (NYSE:AER) has a market capitalization of $25.27 billion.\n\nLondon Company Mid Cap Strategy stated the following regarding AerCap Holdings N.V. (NYSE:AER) in its fourth quarter 2025 investor letter:\n\n\"AerCap Holdings N.V. (NYSE:AER) – AER shares performed well all year after reporting solid quarterly results. We believe the company is sitting in the enviable position of owning the largest portfolio of aircraft in a seller’s market. The insurance recoveries during the year were a nice windfall, which was used to repurchase shares. The company should be able to continue growing book value per share via large purchase leasebacks or M&A, given its historically low leverage.\"\n\nIs AerCap Holdings N.V. (AER) Top Stock Pick in Billionaire George Soros' Portfolio?\n\nAe"
      },
      {
        "title": "5 takeaways from Trump's State of Union address",
        "link": "https://www.cnbc.com/2026/02/25/takeaways-trump-state-of-the-union-2026.html",
        "published": "Wed, 25 Feb 2026 07:30:58 GMT",
        "source": "US Top News and Analysis",
        "text": "watch now\n\nPresident Donald Trump delivered a nearly two-hour State of the Union address on Tuesday, focusing largely on the economy that he declared was set to boom. The president delivered the signature annual address as he sees his poll numbers on the economy plummet ahead of the 2026 midterms, which loom less than nine months away. Those elections threaten to shift control of Congress from Republicans and Trump's control of Washington along with it. Here are five takeaways from Trump's State of the Union:\n\n1. 401(k)'s for everybody\n\nTrump called for the creation of a government-backed 401(k)-like plan for U.S. workers who don't receive a retirement match from their employer. \"My administration will give these oft-forgotten American workers, great people, the people that built our country, access to the same type of retirement plan offered to every federal worker,\" Trump said. \"We will match your contribution with up to $1,000 each year.\" Trump said the plan would \"ensure that all Americans can profit from a rising stock market.\" Trump and his administration have often caught flak for touting stock market gains as evidence of a booming economy, while millions of Americans are not invested in the market. A White House official granted anonymity to discuss the plan said it would grant eligible workers access to savings vehicles similar to the Thrift Savings Plan available to federal workers, which they said \"provides for an efficient savings program that includes a government match and offers diversified, index‑based, investment options and portfolio choices.\" The plan would tap an existing program known as the \"Savers Match\" tax credit that was enacted under the 2022 Secure 2.0 law to provide an annual match of up to $1,000 to low-income workers beginning in 2027.\n\n2. Trump reiterates his call to bar private equity from gobbling up homes\n\nThe president reiterated his call on Congress to pass legislation barring large institutional investors from buying up single-f"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nAmerican tourists in Mexico are sharing their experiences after the death of a powerful cartel leader. The US has been accused of \"shameless exploitation\" over a proposed health aid deal with Zambia. China has restricted exports to 40 Japanese entities with ties to the military, citing concerns over Japan's \"remilitarization\". The US has also ordered diplomats to fight data sovereignty initiatives, according to a Reuters report. \n\n## Market & Business Implications\n* The US has accused Zambia of potentially accepting terms worse than health financing agreements the US has reached with 16 other African countries, including a commitment to give Washington access to its health data for 10 years, as stated in a leaked draft of a memorandum of understanding (Article 3).\n* China has restricted exports to 20 Japanese companies, including Mitsubishi Heavy Industries and Kawasaki Heavy Industries, and placed 20 others on a watchlist, requiring individual export license applications (Article 5).\n* The US has ordered diplomats to fight data sovereignty initiatives, according to a Reuters report, although details of the initiative are not provided (Article 2).\n\n## Beginner-Friendly Summary\nThere's been some big news around the world. Some American tourists are talking about what it's like in Mexico after a big cartel leader died. The US is also making a deal with Zambia to help with health care, but some people think it's not a fair deal. China is not allowing some Japanese companies to buy certain things from them because they're worried about Japan's military. The US is also telling its diplomats to do something about data, but we don't know all the details.",
    "articles": [
      {
        "title": "American tourists in Mexico share their experience after cartel leader's death",
        "link": "https://www.npr.org/2026/02/25/nx-s1-5724007/american-tourists-in-mexico-share-their-experience-after-cartel-leaders-death",
        "published": "Wed, 25 Feb 2026 04:41:19 -0500",
        "source": "NPR Topics: World",
        "text": "American tourists in Mexico share their experience after cartel leader's death Americans visiting a Mexican resort city share what they're seeing and experiencing following the killing of a powerful cartel leader.\n\nWorld American tourists in Mexico share their experience after cartel leader's death American tourists in Mexico share their experience after cartel leader's death Listen · 2:12 2:12 Americans visiting a Mexican resort city share what they're seeing and experiencing following the killing of a powerful cartel leader. Sponsor Message Sponsor Message"
      },
      {
        "title": "Exclusive: US orders diplomats to fight data sovereignty initiatives - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxNRnNNNlNrWjh6LUVvYlpnTEcxT2tBU0Vtc2w5enZIS3RmZ1Zhc0E0R1F3el9kbFVUakhOTTd1LV9rNWczc2pnRTVYWDU1TC12dmVTa1Qzbll5MlNvUFNsLWtYYUtrWUdKal91OUw3ODFHT1RBS3ZHb3BBUkZYMllFVnN0MlR1SE1yTDMxdzB3cldPR0wwSTI4TkE1bVRsWHFzOHVZN2V1WmVPUHlqUGt6aUs5dXRvN0J2aFFXOEp6b1U5TF9rTlItNlB3?oc=5",
        "published": "Wed, 25 Feb 2026 11:03:32 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "US accused of ‘shameless exploitation’ over proposed Zambian health aid deal",
        "link": "https://www.theguardian.com/global-development/2026/feb/25/zambia-us-health-aid-deal-exploitation-mining-concessions-data-sharing-targets",
        "published": "Wed, 25 Feb 2026 13:00:36 GMT",
        "source": "World news | The Guardian",
        "text": "The US has been accused of “shameless exploitation” over a health financing agreement with Zambia worth more than $1bn (£740m), amid warnings that the country is getting a raw deal from the Trump administration.\n\nA leaked draft of a five-year memorandum of understanding (MOU) between the two countries, seen by the Guardian, reveals that Zambia may accept terms worse than health financing agreements the US has reached with 16 other African countries.\n\nThe terms include a commitment to give Washington access to its health data for 10 years – far longer than other countries have negotiated. Zambia’s deal also predicates any health financing on an even more covert arrangement that could open up the country’s mining industry to US interests.\n\nAsia Russell, director of the HIV advocacy organisation Health Gap, said: “These terms are vastly worse than other deals. [The US] is conditioning life-saving health services on plundering the mineral wealth of the country.\n\n“It’s shameless exploitation, which is immoral. It’s also dangerous – when health programmes are treated like a bargaining chip by a rapacious administration, everyone suffers,” she said.\n\nThe Trump administration is pursuing these bilateral global health deals after dismantling most of the federal development agency, USAID.\n\nThe new strategy channels health financing directly to governments, rather than through aid organisations, while also requiring increased investments from partner countries.\n\nIn Zambia’s case, Washington is offering $1.012bn in health funding in exchange for Lusaka’s commitment to hire 40,000 new health workers and contribute an additional $400m in health services over five years, while improving the health sector’s performance, according to the leaked draft. The country’s 2026 budget for health services is roughly $1.3bn.\n\nIf Zambia faltered on any of these fronts, Washington could terminate the agreement and withdraw its funds.\n\nJulius Kachidza, chair of Zambia’s Civil Society Self-coordi"
      },
      {
        "title": "Commons Speaker passed Mandelson flight risk information to police ahead of arrest",
        "link": "https://www.bbc.com/news/articles/c8d5792yj9qo?at_medium=RSS&at_campaign=rss",
        "published": "Wed, 25 Feb 2026 13:27:19 GMT",
        "source": "BBC News",
        "text": "The BBC understands that Lord Mandelson's position is he has not acted in any way criminally and that he was not motivated by financial gain. Lawyers for the peer say he intends to co-operate with police to \"clear his name\"."
      },
      {
        "title": "China restricts exports to 40 Japanese entities with ties to military",
        "link": "https://www.npr.org/2026/02/25/g-s1-111441/china-restricts-exports-to-40-japanese-entities-with-ties-to-military",
        "published": "Wed, 25 Feb 2026 01:53:58 -0500",
        "source": "NPR Topics: World",
        "text": "China restricts exports to 40 Japanese entities with ties to military\n\ntoggle caption Andy Wong/AP\n\nBANGKOK — China on Tuesday restricted exports to 40 Japanese entities it says are contributing to Japan's \"remilitarization,\" in the latest escalation of tensions with Tokyo.\n\nBeijing has shown continued displeasure with Tokyo since Japanese Prime Minister Sanae Takaichi in November implied Japan could intervene if China used military force against Taiwan, an island democracy China claims as its own.\n\nThe Chinese Commerce Ministry put 20 Japanese companies on an export control list and 20 others on a separate watchlist.\n\nCompanies on the export control list will not be able to import from China dual-use goods, which can be used for civilian and military purposes. They include multiple business subsidiaries of Mitsubishi Heavy Industries involved in shipbuilding and the production of aircraft engines and maritime machinery, as well as some of Kawasaki Heavy Industries and Fujitsu, among others.\n\nForeign organizations or individuals are also banned from providing dual-use items originating in China to the 20 entities, the ministry said.\n\nSponsor Message\n\n\"All ongoing related activities must cease immediately,\" its statement read.\n\nThe separate watchlist has 20 Japanese companies for which Chinese exporters are required to submit individual export license applications, along with risk assessment reports and written pledges that the dual-use items will not be used by Japan's military. It includes Subaru Corporation, Mitsubishi Materials Corporation and the Institute of Science Tokyo, among others.\n\nThe Chinese Commerce Ministry said the measures, aiming to curb Japan's remilitarization and nuclear ambitions, \"are entirely legitimate, reasonable, and legal.\"\n\nThe restrictions \"are only aimed at a small number of Japanese entities, and the relevant measures only target dual-use items,\" it added. \"They will not affect normal economic and trade exchanges between China and Jap"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nScammers are using AI deepfakes to steal money from taxpayers by making fake calls claiming to be from the IRS. An American Airlines plane was found with possible bullet holes after a flight from Colombia. Household energy bills are expected to fall in April due to a charges shake-up. The restaurant reservation market is becoming increasingly competitive with DoorDash, Uber, and American Express entering the scene. \n\n## Market & Business Implications\n* The Federal Trade Commission reported that consumers lost more than $12.5 billion to fraud in 2024, with impostor fraud being the second-highest reported loss, as stated in Article 1.\n* American Airlines confirmed that one of its planes was found with possible bullet holes after a flight from Colombia, and the plane is currently undergoing inspection, as reported in Article 2.\n* DoorDash announced its $1.2 billion acquisition of SevenRooms, a reservation platform, to compete in the restaurant reservation market, as mentioned in Article 4.\n* The reservation market is becoming more competitive, with companies like Uber and American Express also entering the scene, as stated in Article 4.\n* Household energy bills are expected to fall in April due to a charges shake-up, with energy companies offering different tariffs and support, as reported in Article 3.\n\n## Beginner-Friendly Summary\nThere are people pretending to be from the government to trick others out of money. A plane was found with holes in it after flying from Colombia. Some people's energy bills might go down soon because of changes in how energy companies charge. There's a lot of competition between big companies to help people make restaurant reservations.",
    "articles": [
      {
        "title": "How scammers are using AI deepfakes to steal money from taxpayers",
        "link": "https://www.washingtonpost.com/business/2026/02/25/how-scammers-are-using-ai-deepfakes-steal-money-taxpayers/",
        "published": "Wed, 25 Feb 2026 11:00:00 +0000",
        "source": "Business",
        "text": "My husband and I owe the IRS absolutely nothing. Yet in the last two weeks, I’ve been getting calls to my mobile number that make it seem as if the government has an issue with our tax situation. The implication is that we owe Uncle Sam, and there’s help available to sort it all out.\n\n“Hello, this is Parker Ashland calling from the account review and compliance with the tax mediation and account support center,” a woman’s voice says.\n\nMy account is “listed for verification,” she says, and she’s making a “courtesy outreach” to assist me.\n\nIf I want, “this center can review IRS payment options, abatement programs, or resolution solutions,” the message says.\n\nA few days earlier, a Martha Jennings called from the “verification services department with the tax help and mediation office.”\n\nA review would help with “unresolved” tax items. “Many people find this step helpful just to better understand their current standing.”\n\nI ignored the voicemails from vague-sounding companies about a tax problem I didn’t have.\n\nYou may have received similar calls recently that are probably using generative artificial intelligence to create more convincing scams, including deepfakes. Ask The Post AIDive deeper\n\nLast month, the Federal Trade Commission warned that the agency has seen a “big wave” of reports about phone scams in which fraudsters claim to be from the IRS or another official-sounding government agency, or use a company name like “Tax Resolution Oversight Department.”\n\nYou may be told that you haven’t paid your taxes or be offered an opportunity to connect with a “tax resolution officer,” who can help you apply for an “IRS liability reduction program.”\n\n“Those aren’t real programs,” the FTC said.\n\nIt’s a scam intended to steal either your identity or your money.\n\nThe FTC reported that consumers lost more than $12.5 billion to fraud in 2024, a 25 percent increase from the prior year. The second-highest reported loss, after investment scams, was impostor fraud, with $2.95 billi"
      },
      {
        "title": "Possible bullet holes mysteriously appear on American Airlines plane after flight from Colombia",
        "link": "https://www.foxbusiness.com/lifestyle/possible-bullet-holes-mysteriously-appear-american-airlines-plane-after-flight-from-colombia",
        "published": "Tue, 24 Feb 2026 23:34:17 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "An American Airlines jet was found Monday with possible bullet holes on its exterior after completing a flight from Medellin, Colombia, to Miami.\n\nThe damage was discovered during a routine postflight inspection of the Boeing 737 MAX 8 at Miami International Airport.\n\nAccording to Airlive.net , the puncture marks resembled bullet holes and were found on the plane’s right wing assembly.\n\nAmerican Airlines confirmed to FOX Business that the plane was impacted and is currently undergoing inspection.\n\nAMERICA’S AIRPORT AFFORDABILITY GAP: CITIES WHERE TRAVEL COSTS ARE CRUSHING FAMILIES\n\n\"Following a routine inspection, our teams identified a puncture to the exterior of one of our aircraft in Medellín, Colombia,\" the airline said.\n\n\"The aircraft was immediately removed from service for further inspection and repair. We will work closely with all relevant authorities to investigate this incident.\"\n\n'SECURITY-RELATED SITUATION' GROUNDS FIGHT TO VACATION HOT SPOT, PASSENGERS CONFINED FOR HOURS\n\nThe plane, registered as N342SX, first departed Miami Sunday as Flight AA923 for Medellín’s José María Córdova International Airport, where it stayed overnight in Colombia, according to AirNavRadar.\n\nThe next morning, it completed its return leg as Flight AA924, landing in Miami at approximately 10:33 a.m.\n\nThe flight cruised without any issues during its three-hour journey over the Caribbean, and no one was reported injured, the airline told FOX Business.\n\nDuring the inspection, maintenance crews noticed puncture marks on the right aileron, the part of the wing that controls roll and allows the airplane to turn, Airlive.net reported.\n\nTicker Security Last Change Change % AAL AMERICAN AIRLINES GROUP INC. 13.15 +0.22 +1.70%\n\nWhile the cause of the possible gunfire remains under investigation, the incident has raised concerns about safety in Medellín. The city, now a popular and vibrant destination for tourists, was once notorious in the 1990s for high levels of violence and drug-relate"
      },
      {
        "title": "Household energy bills to fall in April after charges shake-up",
        "link": "https://www.bbc.com/news/articles/cx2lpl9lxw2o?at_medium=RSS&at_campaign=rss",
        "published": "Wed, 25 Feb 2026 12:11:57 GMT",
        "source": "BBC News",
        "text": "\"They are giving them different tariffs, extra help and support, offer white goods such as efficient fridges, but they can only do this if they know who is in your household and what your circumstances are,\" she said."
      },
      {
        "title": "Restaurant reservation wars heat up as DoorDash enters the arena with Resy, OpenTable",
        "link": "https://www.cnbc.com/2026/02/25/doordash-resy-opentable-restaurant-reservation-wars.html",
        "published": "Wed, 25 Feb 2026 12:00:01 GMT",
        "source": "Business News",
        "text": "In this article DASH\n\nUBER\n\nBKNG\n\nAXP Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nNow available on your favorite food delivery app: restaurant reservations. The still-simmering reservation wars of the last decade could fully reignite this year, as a shifting tech landscape pits some of the biggest players against each other to capture businesses and users alike. Reservation incumbents, delivery app newcomers and premium credit card partnerships are all ramping up the fight for a shrinking pool of diners. Delivery giant DoorDash announced in June its $1.2 billion acquisition of SevenRooms, a reservation platform focused on direct bookings through a restaurant's own website. Several months earlier, UberEats and Booking Holdings' OpenTable announced a partnership to integrate reservations on Uber's app. And in 2024, American Express , already the owner of Resy, bought Tock, a reservation platform focused on upscale restaurants, for $400 million. \"It's three very large, very ambitious, very well-resourced companies all vying for the same exact piece of real estate, which is high-demand restaurants,\" Resy and Eater founder Ben Leventhal told CNBC. Leventhal still acts as an advisor to Resy, which was bought by AmEx in 2019, although today he focuses on Blackbird Labs, a loyalty program for independent restaurants that he founded in 2022.\n\nBringing restaurants online\n\nThe reservation wars initially kicked off more than 10 years ago. Leventhal's Resy burst onto the scene in 2014 and won market share, undercutting OpenTable's legacy business, by charging eateries a simple monthly fee. At the time, OpenTable, which was founded in 1998, charged restaurants both a monthly fee and a cover for each diner who booked through the platform. These days, the company still sometimes charges a variable cover fee for seated diners, depending on the establishment.\n\nThomas Barwick | Digitalvision | Getty Images\n\nDespite Resy's rise and buzzy partnerships with high-profile r"
      },
      {
        "title": "Voice of America is covering Iran’s protests, but not its best-known dissident",
        "link": "https://www.washingtonpost.com/business/2026/02/25/reza-pahlavi-iran-protests-voa/",
        "published": "Wed, 25 Feb 2026 10:00:00 +0000",
        "source": "Business",
        "text": "When Sahar Tahvili, a professor at a Swedish university, sat for an interview with Voice of America’s Persian service on Jan. 9, she discussed the security concerns for Iranian viewers using Starlink satellites to circumvent the government’s internet blackouts. But it was a greeting at the start of the interview that crossed a line with the company’s top brass. She thanked the network for having her before invoking the name of Reza Pahlavi, the son of Iran’s deposed shah: “Let me first pass my greetings to our compatriots in Iran, a nation that, by standing on the right side of history and by responding in the millions to Crown Prince Reza Pahlavi’s call, is shaping historic days for the freedom of our country.”\n\nLater that day, Tahvili received a phone call from the VOA producer who arranged her interview, complaining that she had violated Voice of America’s new policy barring mentions of Pahlavi’s name — which she said she didn’t know about.\n\n“He called me in a very angry way and said, ‘Why did you mention his name?’” Tahvili, adjunct associate professor of AI industrial systems at Sweden’s Mälardalen University, said in an interview. “No one is allowed to mention Pahlavi’s name.” Because she had mentioned him, Tahvili said she was told her interview, which aired live, would not be reposted to social media and she would no longer be welcome on the network.\n\nCritics including Tahvili allege that since the mass protests broke out in the final days of last year, the U.S. government has systematically censored the best-known Iranian opposition figure by banning his name from its broadcasts. They also claim that, in the process, U.S. Agency for Global Media Deputy CEO Kari Lake and the new head of the Persian service, Ali Javanmardi, have exerted control over a government broadcaster that’s long been editorially independent of the U.S. government.\n\nIn a January interview with Reuters, President Donald Trump questioned whether Pahlavi has enough support to take over in "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe US equity markets reached new all-time highs in Q4 2025, with the S&P 500 Index rising 2.66%. Aristotle Growth Equity Fund highlighted Snowflake Inc. as a leading data cloud platform, despite its one-month return being -25.44%. Lowe's topped Wall Street's quarterly revenue and earnings expectations, with sales growing more than 10% year over year. HSBC reported an annual pre-tax profit of $29.91 billion, beating analysts' estimates. Nvidia's earnings are upcoming, with tech stocks rebounding.\n\n## Market & Business Implications\n* Aristotle Growth Equity Fund's fourth-quarter 2025 investor letter stated that the fund returned 0.95%, underperforming the Russell 1000 Growth Index’s 1.12% (Article 1).\n* Lowe's expects total sales for the full current fiscal year to range between $92 billion and $94 billion, which would be a roughly 7% to 9% increase over the prior year (Article 2).\n* HSBC's revenue gained 4% year on year, and its fourth-quarter profit before tax rose to $6.8 billion, up $4.5 billion from a year earlier (Article 4).\n* Anthropic announced a new suite of enterprise offerings, which may alleviate some AI-related concerns for investors (Article 5).\n* The Aristotle Growth Equity Fund highlighted Snowflake Inc. as a leading data cloud platform, with a market capitalization of $55.115 billion (Article 1).\n\n## Beginner-Friendly Summary\nThe stock market did well in the last part of 2025. A company called Aristotle Growth Equity Fund talked about a company called Snowflake Inc. being good at storing data in the cloud. Another company, Lowe's, made more money than expected. A bank called HSBC made a lot of money too. There's also a big company called Nvidia that is going to share its earnings soon, and people are waiting to see how it did.",
    "articles": [
      {
        "title": "Aristotle Growth Equity Fund: Snowflake (SNOW) Stands Out as a Leading Data Cloud Platform",
        "link": "https://finance.yahoo.com/news/aristotle-growth-equity-fund-snowflake-140652743.html?.tsrc=rss",
        "published": "Wed, 25 Feb 2026 14:06:52 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Aristotle Funds, an investment advisor, released its “Growth Equity Fund” fourth-quarter 2025 investor letter. A copy of the letter can be downloaded here. U.S. equity markets reached new all-time highs in Q4 2025, with the S&P 500 Index rising 2.66% and the Bloomberg U.S. Aggregate Bond Index increasing by 1.10%. Within the Russell 1000 Growth Index, healthcare, communication services, and financials were the top-performing sectors, while utilities, real estate, and materials lagged. The U.S. economy showed resilience. However, consumer confidence deteriorated toward year-end, raising concerns about future spending and the labor market. Against this backdrop, the Aristotle Growth Equity Fund (Class I-2) returned 0.95%, underperforming the Russell 1000 Growth Index’s 1.12%. Poor security selection in the information technology and consumer discretionary sectors detracted from performance, while positive contributions from healthcare and industrials improved relative performance. In addition, please check the Fund’s top five holdings to know its best picks in 2025.\n\nIn its fourth-quarter 2025 investor letter, Aristotle Growth Equity Fund highlighted stocks like Snowflake Inc. (NYSE:SNOW). Based in Bozeman, Montana, Snowflake Inc. (NYSE:SNOW) is a cloud-based data platform company. On February 24, 2026, Snowflake Inc. (NYSE:SNOW) stock closed at $161.06 per share. One-month return of Snowflake Inc. (NYSE:SNOW) was -25.44%, and its shares lost 3.09% over the past 52 weeks. Snowflake Inc. (NYSE:SNOW) has a market capitalization of $55.115 billion.\n\nAristotle Growth Equity Fund stated the following regarding Snowflake Inc. (NYSE:SNOW) in its fourth quarter 2025 investor letter:"
      },
      {
        "title": "Lowe's earnings beat as sales jump more than 10% despite sluggish housing market",
        "link": "https://www.cnbc.com/2026/02/25/lowes-low-q4-2025-earnings.html",
        "published": "Wed, 25 Feb 2026 14:00:29 GMT",
        "source": "Earnings",
        "text": "Lowe's topped Wall Street's quarterly revenue and earnings expectations on Wednesday, as the retailer's sales grew more than 10% year over year.\n\nThe home improvement company said it expects total sales for the full current fiscal year to range between $92 billion and $94 billion, which would be a roughly 7% to 9% increase over the prior year. It said it projects adjusted earnings per share to be between $12.25 and $12.75 for the full year. Lowe's said it expects comparable sales, a metric that takes out one-time factors, to be approximately flat to up 2%.\n\nIn a news release, CEO Marvin Ellison said the company's strategy is resonating with its do-it-yourself customers and home professionals, even as higher mortgage rates and slower real estate sales challenge its industry.\n\n\"While the housing macro remains pressured, we are focused on directing what is within our control, which includes our ongoing productivity initiatives,\" he said. \"We remain confident that we are well-positioned to take share regardless of the macro environment.\"\n\nShares of Lowe's fell in premarket trading as the company's earnings per share projections for the year fell short of analysts' consensus expectations of $12.95, according to LSEG.\n\nHere's what Lowe's reported for the fiscal fourth quarter compared with Wall Street's estimates, according to a survey of analysts by LSEG:\n\nEarnings per share: $1.98 adjusted vs. $1.94 expected\n\n$1.98 adjusted vs. $1.94 expected Revenue: $20.58 billion vs. $20.34 billion expected\n\nLowe's net income for the three-month period that ended Jan. 30 dropped to $999 million, or $1.78 per share, from $1.13 billion, or $1.99 per share, in the year-ago quarter. Excluding one-time factors, including expenses associated with recent acquisitions, Lowe's reported adjusted earnings per share of $1.98.\n\nRevenue rose from $18.55 billion in the year-ago period.\n\nComparable sales for the quarter climbed 1.3%, higher than the 0.2% that analysts were expecting, according to St"
      },
      {
        "title": "Looming Nvidia Earnings in Focus, Driving Narrow Premarket Gains for US Equity Futures",
        "link": "https://finance.yahoo.com/news/looming-nvidia-earnings-focus-driving-140411075.html?.tsrc=rss",
        "published": "Wed, 25 Feb 2026 14:04:11 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "US equity futures were up before Wednesday's opening bell as traders looked ahead to earnings from c\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      },
      {
        "title": "HSBC annual pre-tax profit drops over 7%, revenue jumps as bank's results top estimates",
        "link": "https://www.cnbc.com/2026/02/25/hsbc-2025-full-year-earnings-results.html",
        "published": "Wed, 25 Feb 2026 05:31:51 GMT",
        "source": "Earnings",
        "text": "A view of the logo of HSBC bank on a wall outside a branch in Mexico City, Mexico, on June 14, 2024.\n\nEurope's largest lender HSBC on Wednesday reported annual pre-tax profit of $29.91 billion, beating analysts' estimates on the back of a strong performance in its wealth division and Hong Kong businesses.\n\nWhile annual profit declined 7.4%, HSBC's revenue gained 4%, year on year, and both exceeded estimates.\n\nHere are HSBC's full-year results compared with the consensus estimates compiled by the bank.\n\nPre-tax profit: $29.91 billion vs. $28.86 billion\n\n$29.91 billion vs. $28.86 billion Revenue: $68.27 billion vs. $67.36 billion\n\nThe lender's fourth-quarter profit before tax rose to $6.8 billion, up $4.5 billion from a year earlier, largely due to favorable one-off items linked to business disposals. Operating expenses rose 8% to $9.3 billion, reflecting restructuring costs, technology investment and higher performance-related pay.\n\nIts revenue for the final quarter jumped 42% year on year to $16.4 billion.\n\nHSBC Group CEO Georges Elhedery said in a statement that 2025 marked a year of \"decisive action and swift execution,\" with all four of the bank's businesses performing well and building strong momentum.\n\nThe lender now aims to deliver a return on average tangible equity — a measure of profitability — of 17% or more, excluding notable items, in between 2026 and 2028. RoTE was 13.3% in 2025.\n\nThe results come close on the heels of HSBC completing the privatization of Hang Seng Bank on Jan. 26, with the latter's shares subsequently delisted from the Hong Kong Stock Exchange.\n\nHSBC said last year that the deal would be add to its earnings and was a better use of capital than buybacks.\n\n\"We do anticipate revenue and cost synergies between the two brands, but we expect that to come through gradually in the medium term,\" Morningstar's equity analyst Kathy Chan said.\n\nThe take private offer was \"an exciting opportunity to grow both Hang Seng and HSBC,\" Elhedery said last"
      },
      {
        "title": "Tech news today: Nvidia earnings on deck as tech stocks rebound, Anthropic relieves some AI fears",
        "link": "https://finance.yahoo.com/news/live/tech-news-today-nvidia-earnings-on-deck-as-tech-stocks-rebound-anthropic-relieves-some-ai-fears-140009329.html?.tsrc=rss",
        "published": "Wed, 25 Feb 2026 14:00:09 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Anthropic on Tuesday announced a new suite of enterprise offerings, the latest in a series of new capabilities boasted by AI labs like Google, Anthropic, and OpenAI that have shaken investor confidence in a variety of software solutions that may see their core product replaced by an AI facsimile.\n\nBut some Wall Street analysts aren't so sure the process will be quite that simple.\n\nDan Ives, high profile tech bull at Wedbush, wrote in a note Tuesday after Anthropic's announcement that, \"While these use cases are impressive, the reality is that these new AI tools will not rip and replace existing software ecosystems and data environments with these AI tools only as useful as the data it can reach.\"\n\nIn Ives' view, there are three things investors who view these demos as a sign of AI outcompeting legacy solutions might be missing.\n\nOne — \"The market is conflating foundation model capability with full enterprise software replacement and the fear that generative AI will 'rewrite legacy systems overnight' ignores enterprise reality.\"\n\nTwo — \"AI agents and autonomous workflows dramatically increase the attack surface — more APIs, more machine identities, more lateral movement risk, and more cloud-native workloads. AI doesn’t reduce the need for endpoint, identity, cloud, and SOC automation, it multiplies it.\"\n\nThree — \"Anthropic/OpenAI do not have 20-year enterprise distribution networks, CIO relationships, or embedded vertical workflows. CRM, NOW, and MSFT sit at the application layer where business logic lives. The model layer will commoditize faster than the workflow layer.\"\n\nThe key point that I think Ives raises is that model advances — or other signs of what we might call technical brilliance — are not the same as an in-market product that gets customers to change their spending habits.\n\nObviously, as we saw with the market's reaction to a Substack post on Monday that was explicitly a thought experiment, there are lots of investor nerves about which advances could dr"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nThe UK's Financial Conduct Authority has selected four companies to test stablecoin services in a regulatory sandbox. Meanwhile, stablecoins are gaining traction, with Meta confirming plans to re-enter the payments space with a stablecoin strategy. In South Korea, a new rule is being proposed to require social media influencers to disclose their holdings and compensation when promoting cryptocurrencies and stocks. The crypto market has also seen a surge, with altcoins such as Polkadot and Solana leading the rally. Additionally, FG Nexus has sold another $14 million in Ether, locking in losses on its treasury bet.\n\n## Market & Business Implications\n* The UK's Financial Conduct Authority has chosen four companies, including Revolut, to test stablecoin services in a regulatory sandbox, with a focus on stablecoin issuance and use cases such as payments and crypto trading (Article 1).\n* Meta is re-entering the payments space with a stablecoin strategy, targeting 3 billion users across Facebook, WhatsApp, and Instagram, and is seeking a third-party partner to administer stablecoin-based payments (Article 2).\n* A new rule is being proposed in South Korea to require social media influencers to disclose their holdings and compensation when promoting cryptocurrencies and stocks, with the goal of reducing conflicts of interest and improving transparency (Article 3).\n* The crypto market has seen a surge, with altcoins such as Polkadot and Solana leading the rally, and the total crypto market cap increasing by 3.7% to $2.34 trillion (Article 4).\n* FG Nexus has sold 7,550 ETH worth about $14 million, adding to a series of disposals that have locked in more than $80 million in losses on its treasury bet (Article 5).\n\n## Beginner-Friendly Summary\nThe UK government has chosen some companies to test a new kind of money called stablecoins. At the same time, a big company called Meta is planning to use stablecoins to help people make payments. In South Korea, the government wants to make sure people who talk about investments on social media are honest about what they own. The price of some cryptocurrencies has gone up, and a company called FG Nexus has sold some of its cryptocurrency because it's not doing well.",
    "articles": [
      {
        "title": "Revolut among four firms chosen to test stablecoins in UK sandbox",
        "link": "https://cointelegraph.com/news/uk-fca-names-first-4-firms-to-test-stablecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 25 Feb 2026 13:59:55 +0000",
        "source": "Cointelegraph.com News",
        "text": "The United Kingdom’s Financial Conduct Authority (FCA) has selected four companies to join a dedicated stablecoin cohort within its long‑running Regulatory Sandbox.\n\nIn a Wednesday press release, the FCA said it chose Monee Financial Technologies, ReStabilise, Revolut and VVTX from a pool of 20 applicants to test how their stablecoin services perform under the UK’s proposed rules in a “safe environment.”\n\nThe UK regulator said that its testing would focus primarily on stablecoin issuance and that the four companies would pilot a range of use cases, including payments, wholesale settlement and crypto trading, with findings intended to inform the UK’s final stablecoin rules.\n\nMatthew Long, director of payments and digital assets at the FCA, said that the regulator would support UK stablecoin issuers to ensure that they could “be trusted for payments, settlement and trading.”\n\nHe said that the FCA’s involvement would “benefit consumers and financial transactions,” and that it would help to “deliver the FCA's strategy and the Government's National Payments Vision.”\n\nSandbox permits testing in controlled environment\n\nThe FCA’s sandbox was launched in 2016 under Project Innovate, and the stablecoin‑specific cohort opened for applications in November 2025, aimed at prospective UK stablecoin issuers wanting to pilot pound or other fiat‑backed tokens and related payment use cases while the country’s permanent stablecoin regime is being finalized.\n\nFirst four firms selected for FCA’s regulatory sandbox. Source: FCA\n\nThe four companies chosen for the cohort are expected to begin testing in the first quarter of 2026, and their findings will “help shape the UK’s final stablecoin rules later in 2026,” the release states.\n\nRelated: Gemini exit a ‘blow for policymakers’ with UK crypto hub ambitions\n\nAll companies will need to be authorized under the new regime once it goes live in October 2027.\n\nThe regulator had previously flagged sterling‑denominated stablecoin payments as a prio"
      },
      {
        "title": "Morning Minute: Stablecoins Are Eating Everything",
        "link": "https://decrypt.co/359101/morning-minute-stablecoins-are-eating-everything",
        "published": "Wed, 25 Feb 2026 12:59:33 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors rebound sharply, up 4-8%; BTC at $65.7k\n\nMeta confirms plans to re-enter stablecoins across Facebook, Whatsapp and IG\n\nCoinbase launches 24/5 stock trading with no fees & fractional shares\n\nTether teased an upcoming product, with speculation of card or neobank\n\nVirtual rebounds 20% as Base continues to drive the onchain AI meta\n\n💰 Stablecoins Are Eating Everything\n\nForget crypto winter.\n\nThe stablecoin market doesn’t care.\n\n📌 What Happened\n\nOn the same day, Stripe announced a $159B valuation driven largely by its stablecoin infrastructure, Meta confirmed it is re-entering the payments space with a stablecoin strategy targeting 3B users.\n\nMeta sent RFPs to crypto infrastructure firms seeking a third-party partner to administer stablecoin-based payments across Facebook, WhatsApp, and Instagram, targeting a launch early in H2 2026.\n\nStripe, which acquired stablecoin platform Bridge last year and whose CEO Patrick Collison sits on Meta’s board, is the leading candidate. This comes after Stripe processed $1.9 trillion in total payment volume last year, up 34%. Bridge volume quadrupled. Stripe also received a national bank trust charter from the OCC last week, letting it custody crypto and manage stablecoin reserves directly.\n\nMeta is not issuing its own token, wanting a “stablecoin agnostic” integration and a new in-app wallet. Meta spokespeople clarified the project is about enabling payments, calling it “enabling people and businesses to pay using their preferred method.”\n\n🗣️ What They’re Saying\n\n“It may be a crypto winter, but it’s a stablecoin summer.”\n\n“Stablecoin payments are advancing quietly and inexorably as real-world uptake continues apace.” - Pat"
      },
      {
        "title": "South Korea moves to require crypto, stock influencers to disclose holdings: Report",
        "link": "https://cointelegraph.com/news/south-korea-finfluencer-crypto-stock-disclosure-bill?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 25 Feb 2026 12:43:02 +0000",
        "source": "Cointelegraph.com News",
        "text": "South Korea is reportedly preparing new rules that would force social-media personalities promoting cryptocurrencies and stocks to reveal what they own and whether they are being paid.\n\nDemocratic Party lawmaker Kim Seung-won, a member of the National Assembly’s Political Affairs Committee, is drafting amendments to the Capital Market and Financial Investment Business Act and the Act on the Protection of Virtual Asset Users, according to a report from Korean-language business news website Herald Business.\n\nUnder the proposal, individuals who repeatedly offer advice or receive compensation to encourage the public to buy or sell financial products or virtual assets must disclose the compensation received and the type and quantity of assets they hold. The requirement would apply to advice delivered through publications, online communications and broadcasts, with detailed criteria to be set by presidential decree.\n\nViolations may carry penalties similar in severity to those for market manipulation or insider trading, per the report.\n\nRelated: Victim of a crypto scam? Here’s what to do next\n\nLawmaker warns on “finfluencer” investor risks\n\nThe initiative is aimed at reducing conflicts of interest and improving transparency in online investment promotion. “So-called fin-influencers are emerging, offering investment advice to unspecified individuals without compensation from positions of significant public influence,” Kim reportedly said.\n\n“These individuals are providing inappropriate information and creating conflicts of interest. However, their opinions have significant influence on the public, causing unpredictable losses to investors,” he added.\n\nKim Seung-won, Democratic Party of Korea member. Source: National Assembly Library\n\nThe move comes as Financial Supervisory Service data shows reports involving quasi-investment advisors (QIAB), entities in Korea that provide general investment advice to people via media, jumped from 132 in 2018 to 1,724 in 2024, according to "
      },
      {
        "title": "Polkadot, Solana Lead Altcoin Surge Ahead of Nvidia Earnings Call",
        "link": "https://decrypt.co/359098/polkadot-solana-lead-altcoin-surge-ahead-of-nvidia-earnings-call",
        "published": "Wed, 25 Feb 2026 12:20:36 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Solana led majors with 8.1% gains as total liquidations hit $324M\n\nNvidia faces a $65.7 billion revenue forecast as traders wait for the earnings calls.\n\nAnalyst warns structural bear market remains despite short-term rally\n\nCryptocurrencies including Polkadot, Solana, Bittensor, and Uniswap led a broad altcoin rally Wednesday ahead of Nvidia's highly anticipated earnings report, with the tech-focused bounce extending across major tokens.\n\nAmong the top 50 cryptocurrencies by market cap, Polkadot led with gains of 11.5% in the past 24 hours, while Solana jumped 8.1%, \"AI-proxy\" token Bittensor rose 6.8% and high-beta major coin Uniswap gained 7.7%, per CoinGecko data.\n\nThe move was mirrored across the \"big-cap\" landscape, with leading altcoins such as Avalanche and World Liberty Financial posting gains of over 6%, pushing the total crypto market cap up 3.7% to $2.34 trillion.\n\nThe surge liquidated over $325 million in positions across the market, according to CoinGlass data.\n\nWhile the timing aligns with a broader relief in equities, Andri Fauzan Adziima, Research Lead at Bitrue, told Decrypt the move is a cocktail of \"institutional dip-buying, short liquidations, and easing tariff fears,\" rather than a direct bet on Nvidia’s specific balance sheet.\n\nThe rally comes as traders position for Nvidia's fiscal 2026 fourth-quarter earnings, due after Wednesday's close. The chipmaker has become a bellwether for AI-driven tech sentiment, with implications that increasingly spill into crypto markets.\n\nThe earnings release lands one day after the State of the Union address, around the same time as Bitcoin surged over $2,000, Decrypt previously reported.\n\n\"This is the single most important catalyst in the window,\" Derek Lim, head of research at Caladan, told Decrypt. \"The entire equity market, and crypto by extension, was positioning around this event.\"\n\nHe expects Nvidia to report revenue of "
      },
      {
        "title": "FG Nexus sells another $14M in Ether as losses mount on treasury bet",
        "link": "https://cointelegraph.com/news/fg-nexus-offloads-14m-in-eth-corporate-ethereum-treasuries?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 25 Feb 2026 12:34:46 +0000",
        "source": "Cointelegraph.com News",
        "text": "FG Nexus, a publicly listed Ethereum treasury and infrastructure company, liquidated another chunk of its Ether treasury on Tuesday, offloading 7,550 ETH worth about $14 million.\n\nThe latest sale adds to a series of disposals that have locked in more than $80 million in losses on a position built near Ether (ETH) 2025 highs.\n\nOnchain data from Arkham shows that the company accumulated 50,770 ETH worth about $196 million between August and September 2025 at an average price of $3,860 per coin.\n\nOn Oct. 22, the company doubled down on its ETH accumulation strategy, announcing its intention to sell its Quebec property to accumulate more ETH.\n\nFG Nexus sells 7,550 ETH. Source: Arkham\n\nAs the market turned and the ETH price fell from its October highs of over $4,600 per coin to around $2,700 in November, the company began selling.\n\nFG Nexus has offloaded just over 21,000 ETH for about $55 million, and netted a loss of more than $80 million.\n\nThe company has also seen its share price for FGNX drop roughly 52% over the past month.\n\nFG Nexus share price takes a beating. Source: Google Finance\n\nFG Nexus remains one of the largest publicly traded owners of ETH, with holdings of 37,594 ETH, according to Arkham.\n\nETH treasury companies under fire\n\nFG Nexus isn’t alone in feeling the pain from an Ether downturn that has left many large corporate treasuries deep underwater.\n\nBitmine Immersion Technologies, by far the largest listed ETH holder with 4,422,659 ETH on its books, is sitting on paper losses estimated at around $8.8 billion as Ether trades well below its average acquisition price, even as the company continues to add to its stash.\n\nRelated: ETHZilla liquidates $74.5M in Ether to redeem convertible debt\n\nPeter Thiel’s Founders Fund exited its stake in Ethereum treasury firm ETHZilla entirely last week, with ETHZilla’s stock now down about 97% from its all‑time high, as equity markets punish aggressive Ether‑heavy strategies, with other companies actively unwinding.\n\nTren"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-25T14:10:57.495445+00:00"
  }
}