{
  "Tech": {
    "summary": "## Executive Summary\nCanva has reached $4 billion in revenue with a 20% increase in monthly active users, driven in part by its AI tools. Meanwhile, Meta CEO Mark Zuckerberg is testifying in a social media trial, where the design of social media products is being scrutinized. Password managers' claims of being \"zero knowledge\" have been debunked by new research, showing that their promises are not always true. Additionally, Olympic choreographer Benoît Richaud has gone viral for changing jackets to support his figure skaters, and Zep AI is hiring engineers.\n\n## Market & Business Implications\n* Canva's annual recurring revenue has reached $4 billion, with its B2B business growing by 100% and reaching $500 million in ARR, according to Article 1.\n* Meta and Google-owned YouTube are facing a social media trial, where the design of their products is being questioned, as reported in Article 2.\n* Research has shown that password managers' \"zero knowledge\" claims are not always true, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups, according to Article 4.\n* Zep AI is hiring engineers, with current employees citing the company's unique position and opportunities for growth and learning, as stated in Article 3.\n* Canva is integrating with chatbots like ChatGPT and Claude, with over 26 million conversations between users and the Canva app on ChatGPT by October 2025, as mentioned in Article 1.\n\n## Beginner-Friendly Summary\nCanva, a company that makes design tools, has made a lot of money - $4 billion. The CEO of Meta, a big social media company, is in court because of how their products are designed. Some password managers, which are tools that help you keep your passwords safe, are not as secure as they claim. A man named Benoît Richaud, who helps figure skaters with their routines, has become famous for wearing different jackets to support his skaters. A company called Zep AI is looking for new engineers to work with them.",
    "articles": [
      {
        "title": "Canva gets to $4B in revenue as LLM referral traffic rises",
        "link": "https://techcrunch.com/2026/02/18/canva-gets-to-4b-in-revenue-as-llm-referral-traffic-rises/",
        "published": "Wed, 18 Feb 2026 14:00:00 +0000",
        "source": "TechCrunch",
        "text": "Creative company Canva ended 2025 on a high note with a 20% increase in monthly active users, growth that was partially propelled by adoption of its AI tools.\n\nCanva had more than 265 million monthly active users and over 31 million paid users in 2025, according to the company. That user base helped push its annual recurring revenue to $4 billion by the end of year, Canva co-founder and COO Cliff Obrecht told TechCrunch on the sidelines of Web Summit Qatar. The subscription-based company also saw its B2B business, which accounts for companies with more than 25 seats, grow by 100% with $500 million in ARR.\n\nThe company still sees the majority of its business from North America, with continued growth in international markets. To increase paying users, Canva has introduced lower-priced subscriptions in countries like Pakistan, Uruguay, Morocco, and Jamaica.\n\nCanva’s AI investments are paying off, according to Obrecht. The company debuted a tool that lets users create mini apps and websites using AI last year. Obrecht noted the tool has more than 10 million monthly active users now. It’s been successful enough that the company is thinking about putting AI at the center and acting like a “design agency in your pocket,” Obrecht said.\n\nThat shift to AI comes as Canva faces competition from the likes of Adobe, Freepik, and Apple, which has pushed to become a full-packaged creator suite by bundling apps like Final Cut Pro, Logic Pro, Pixelmator Pro, Motion, Compressor, and MainStagewith into a $12.99 per month Creator Studio.\n\n“Where we started was… we got the Canva platform, and we’re giving the Canva platform a bunch of AI tools. We’re inverting that now. We’re becoming an AI platform with a bunch of design tools. So you can think of it more like a cursor for design,” he said.\n\nCanva is also actively integrating with chatbots like ChatGPT and Claude. It said that by October 2025, users had more than 26 million conversations with the Canva app on ChatGPT. It also claimed th"
      },
      {
        "title": "Mark Zuckerberg is taking the stand as social media goes on trial",
        "link": "https://www.theverge.com/policy/880375/meta-ceo-mark-zuckerberg-testimony-los-angeles-social-media-addiction-trial",
        "published": "2026-02-18T08:00:00-05:00",
        "source": "The Verge",
        "text": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nLori Schott didn’t care what it took to haul her way from her small town in Eastern Colorado to show up to a Los Angeles courtroom where Meta CEO Mark Zuckerberg is set to testify Wednesday. “I don’t care if I had to hire a pack mule to get me here, I was going to be here,” she told The Verge outside the courthouse Tuesday.\n\nSchott’s daughter Annalee died by suicide at age 18 in 2020, after struggling with body image issues that her mother says were heightened by social media. After her death, Schott found journal entries where Annalee disparaged her own looks and compared herself to other girls’ profiles. “I was so worried about what my child was putting out online, I didn’t realize what she was receiving,” Schott said.\n\nThe way that Meta and Google-owned YouTube designed their products — allegedly luring users into a nonstop loop of taps and scrolling — is at the heart of this month’s bellwether social media trial, which sets the stage for thousands of similar lawsuits. The companies have generally denied the claims. Schott and several other self-described survivor parents have made it their mission to be in the courtroom during the several-week trial in downtown LA.\n\n“I was so worried about what my child was putting out online, I didn’t realize what she was receiving.”\n\nLast week, the parents heard from Instagram CEO Adam Mosseri, who used his time to carve a distinction between clinical addiction to social media and what he called “problematic use.” On the stand, Mosseri testified that using Instagram “too much” is a relative thing that can vary person-to-person, and he wouldn’t use the term addiction for using social media up to 16 hours a day. Mosseri explained why Meta had modified a prior ban on image filters that altered users’ appearance, aft"
      },
      {
        "title": "Zep AI (Building the Context Graph, YC W24) Is Hiring Engineers",
        "link": "https://www.ycombinator.com/companies/zep-ai/jobs",
        "published": "Wed, 18 Feb 2026 12:00:50 +0000",
        "source": "Hacker News: Front Page",
        "text": "We’re in an exciting and unique position, and our momentum continues to grow! Daniel is a great leader; he brings technical wisdom and truly wants you to succeed and grow. I’ve learned an incredible amount here, and it's been fulfilling to have genuine ownership over projects and company direction.\n\nWhy should somebody consider working at Zep AI?\n\nWhat do you love most about working at Zep AI?\n\nThe privilege of working on products for developers and giving back to the open source community. Also I enjoy working as part of the team of very seasoned engineers; I never feel stagnant and I always feel challenged to become a better engineer."
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Why Olympic Choreographer Benoît Richaud Went Viral Just for Changing Jackets",
        "link": "https://www.wired.com/story/why-olympic-choreographer-benoit-richaud-went-viral-just-for-changing-jackets/",
        "published": "Wed, 18 Feb 2026 12:00:00 +0000",
        "source": "WIRED",
        "text": "Benoît Richaud might be one of the most visible people at the 2026 Winter Olympic Games. Not because he’s a star athlete, but because he is coaching 16 figure skaters from 13 different countries. Each time one of them is on the ice, he stands on the rink’s edge, changing into the jacket of their team.\n\nRichaud has become somewhat famous for this move. Olympics viewers began catching on to the French coach’s antics just a few days into the Games when they noticed the same slender bald man sitting next to so many different skaters. He always had on the jacket of the team he was sitting with in the “kiss and cry,” but his stoic, thoughtful expression remained the same. Soon his omnipresence went viral.\n\nBut, as Richaud tells WIRED Italia, he could have been even more of a presence around the ice. He’s currently coaching 16 Olympians, but that’s just the number of them that qualified. “I actually coach a lot more of them,” he says.\n\nHaving such a large roster of athletes to coach is not the easiest thing in the world. Yet Richaud makes it look natural. It’s all about planning, he says. Much of his choreography work has to be done after the World Championships, which are typically held in March. So from April until July he has a “big window” to create new choreography. From there he starts to work with the skaters he’s coaching, to take stock of where they are and what they want to be doing.\n\nSometimes Richaud’s skaters travel to him, sometimes he travels to them. If he needs to update the choreography, he can do so via the internet. “It is very useful because today, with the phone and new technologies, we can do much more and do it much faster,” he says. “I get almost all of my skaters’ programs every day, and this helps me understand what I need to improve to make the program more effective.”\n\nCoaching so many athletes comes with several challenges. One is simply remembering the choreography and details of every skater’s program. The other is riding the emotional rolle"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nWorld Labs has secured a $200 million investment from Autodesk to collaborate on integrating AI models into 3D workflows. Meanwhile, Perplexity is distancing itself from ads, focusing on producing content that users are willing to pay for. RentAHuman, a new online marketplace, enables AI agents to connect with humans to carry out tasks in the physical world. Sarvam, an Indian AI company, plans to deploy its AI models on feature phones, cars, and smart glasses. Meta and other tech firms have put restrictions on the use of OpenClaw due to security fears.\n\n## Market & Business Implications\n* World Labs has secured a $200 million investment from Autodesk, with the two companies collaborating to explore how World Labs' models can work alongside Autodesk's tools (Article 1).\n* Perplexity is phasing out ads, focusing on producing content that business customers and high-powered users are willing to pay for (Article 3).\n* RentAHuman has launched an online marketplace that enables AI agents to connect with humans to carry out tasks in the physical world, with over 518,284 humans offering their labor (Article 2).\n* Sarvam is teaming up with HMD to bring a conversational AI assistant to Nokia and HMD phones, using edge models that take up only megabytes of space (Article 4).\n* Meta and other tech firms have restricted the use of OpenClaw due to security fears, with some executives warning employees to keep it off company hardware and away from work-linked accounts (Article 5).\n\n## Beginner-Friendly Summary\nSome big companies are working together on new AI projects. World Labs got a lot of money from Autodesk to help make 3D models better. Perplexity is stopping ads because they don't think they're a good idea. There's a new website where AI computers can hire people to do tasks. An Indian company called Sarvam wants to put AI on old phones and other devices. Some companies are being careful with a new AI tool called OpenClaw because they're worried it might not be safe.",
    "articles": [
      {
        "title": "World Labs lands $200M from Autodesk to bring world models into 3D workflows",
        "link": "https://techcrunch.com/2026/02/18/world-labs-lands-200m-from-autodesk-to-bring-world-models-into-3d-workflows/",
        "published": "Wed, 18 Feb 2026 14:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Fei-Fei Li’s World Labs has secured a $200 million investment from software design giant Autodesk. The partnership will see the two companies collaborating to explore how World Labs’ models — AI systems that can generate and reason about immersive 3D environments — can work alongside Autodesk’s tools, and vice versa, starting with a focus on entertainment use cases.\n\nThe deal is part of a larger round for World Labs, according to Autodesk, which declined to disclose further details. World Labs, which emerged from stealth in 2024 with $230 million at a $1 billion valuation, is reportedly now in talks to raise capital at a $5 billion valuation.\n\nWorld Labs did not immediately return a request for more details.\n\nFor World Labs, Autodesk’s investment is a signal that its product has commercial appeal. The startup’s first world model product, Marble, released last November, lets users create editable, downloadable 3D environments.\n\nAutodesk is one of the biggest developers of 3D CAD (computer-aided design) software. Its platform underpins architectural, engineering, construction, manufacturing, and entertainment workflows. That focus on the built world makes investment in advanced spatial AI a natural extension of its core business.\n\nOr as Li put it in a statement: “Autodesk has long helped people think spatially and solve real-world problems and, together, we share a clear purpose: building physical AI that augments human creativity and puts more powerful tools in the hands of designers, builders, and creators.”\n\nAs part of the deal, Autodesk will serve as an advisor to World Labs, and the two will collaborate at the “research and model level.”\n\nTechcrunch event TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar gr"
      },
      {
        "title": "The Rise of RentAHuman, the Marketplace Where Bots Put People to Work",
        "link": "https://www.wired.com/story/ai-agent-rentahuman-bots-hire-humans/",
        "published": "Wed, 18 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "For centuries, people have catastrophized about robots taking away jobs. On February 1, the paradigm shifted: bots are creating jobs. Now, 518,284 humans—and rapidly counting—are offering their labor to AI agents on a new online marketplace called RentAHuman. There are classifieds to count pigeons in Washington ($30/hour); deliver CBD gummies ($75/hour); play exhibition badminton ($100/hour); and anything else you could possibly imagine that a disembodied agent couldn’t do.\n\nThe provocatively titled platform enables users to connect AI agents like Clawdbot or Claude to its Model Context Protocol server so they can search, book, and pay for humans to carry out tasks in “meatspace.” Think of it like Fiverr, but doing away with the human recruiter and letting autonomous bots do the hiring instead.\n\nFollowing the release of OpenClaw in November, Alexander Liteplo, a 26-year-old crypto engineer at UMA Protocol currently working in Argentina, identified a pain point. The humanoid robot army is expected to reach 13 million strong by 2035, but right now, physical AI is relatively scarce. Most AI bots are brains in a jar—they cannot move through space in a meaningful way.\n\nThe inception of RentAHuman stems from Liteplo's obsession with AI, forged while studying computer science at the University of British Columbia. “Dude, I wrote down in my journal, ‘AI is a train that has already left the station.’ If I don't fucking sprint, I'm not gonna be able to get on it,” he says. It was at UBC that he met RentAHuman cofounder Patricia Tani, then an art student, building in the background thanks to encouragement from her high school computer science teacher. Her passion for coding led her to sneak into a founders event, schmooze with a billionaire entrepreneur, and get invited to his talk with computer science whiz kids (including Liteplo). She has since sunsetted a startup (Lemon AI) and dropped an offer at AI cloud platform Vercel to take RentAHuman skyward.\n\nLiteplo was also inspi"
      },
      {
        "title": "Perplexity joins anti-ad camp as AI companies battle over trust and revenue",
        "link": "https://www.theverge.com/ai-artificial-intelligence/880562/perplexity-ditches-ai-ads",
        "published": "2026-02-18T06:02:22-05:00",
        "source": "AI | The Verge",
        "text": "is a London-based reporter at The Verge covering all things AI and Senior Tarbell Fellow. Previously, he wrote about health, science and tech for Forbes.\n\nAI search startup Perplexity is distancing itself from ads amid fears users won’t trust chatbots with an agenda to upsell. The move highlights an emerging crossroads for the AI industry as the sector’s biggest players hunt for stable sources of income to bankroll massive spending, with giants like OpenAI leaning into ads and others like Anthropic promising to keep them out.\n\nPerplexity began phasing out ads late last year and isn’t exploring any new ad deals at the moment, executives said on Monday at a roundtable event, according to Business Insider and the Financial Times. It is a noteworthy U-turn for the US startup, which became one of the first generative AI companies to test ads on its platform in 2024.\n\n“The challenge with ads is that a user would just start doubting everything . . . which is why we don’t see it as a fruitful thing to focus on right now,” said an unnamed executive cited by the FT. Instead, the company will focus on producing something consumers are “willing to pay for,” in particular business customers and high-powered users like finance professionals, lawyers, doctors, and CEOs.\n\nAnother executive did not rule out a return to advertising in the future, but said serving ads was “misaligned with what the users want” and may not be needed for the company to thrive. “We are in the accuracy business, and the business is giving the truth, the right answers,” they said.\n\nThe pivot sets Perplexity firmly on the anti-ad side of the industry’s emerging divide over how AI should make money. Some, like Perplexity, are hoping subscriptions will be enough and Anthropic has committed to keeping its chatbot Claude ad-free. Others, like OpenAI, have embraced ads, and last week, the company started testing advertising for free ChatGPT users. The dispute has moved into the public arena as well, with Anthropi"
      },
      {
        "title": "India’s Sarvam wants to bring its AI models to feature phones, cars and smart glasses",
        "link": "https://techcrunch.com/2026/02/18/indias-sarvam-wants-to-bring-its-ai-models-to-feature-phones-cars-and-smart-glasses/",
        "published": "Wed, 18 Feb 2026 13:01:04 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Indian AI company Sarvam plans to bring its newly released AI models to users by deploying them on Nokia feature phones, cars and its own smart glasses.\n\nThe company, backed by the likes of Lightspeed, PeakXV, and Khosla Ventures, said at the ongoing India AI Impact Summit in New Delhi that it is using edge models that take up only megabytes of space, can run on most phones with existing processors, and can work offline.\n\nThe company is teaming up with HMD to bring a conversational AI assistant to Nokia and HMD phones. A video demo showed a user clicking a dedicated AI button on a feature phone to converse with an AI assistant in a local language to get guidance on government schemes or local markets. It is not clear if all the AI features showcased at the event will work offline.\n\n“Through edge AI, we want to bring intelligence to every phone, laptop, car, and even a new generation of devices,” Tushar Goswamy, head of Edge AI at Sarvam, said during a presentation.\n\nHe said that the company has worked with Qualcomm to tune its models for the latter’s chipsets. Sarvam didn’t provide details on which devices the models will be deployed to. Qualcomm said that it is developing a “Sovereign AI Experience Suite” that would work across a range of devices, including phones, PCs, laptops, cars, and IoT devices.\n\n“Our collaboration with Qualcomm Technologies can accelerate how we take sovereign AI from research to deployment,” Sarvam co-founder and CEO Vivek Raghwan said in a statement.\n\n“This will allow Sarvam to design models and applications that run closer to the edge, safeguard data, and are ready for adoption, at scale.”\n\nTechcrunch event TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away w"
      },
      {
        "title": "Meta and Other Tech Firms Put Restrictions on Use of OpenClaw Over Security Fears",
        "link": "https://www.wired.com/story/openclaw-banned-by-tech-companies-as-security-concerns-mount/",
        "published": "Tue, 17 Feb 2026 20:10:12 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Last month, Jason Grad issued a late-night warning to the 20 employees at his tech startup. “You've likely seen Clawdbot trending on X/LinkedIn. While cool, it is currently unvetted and high-risk for our environment,\" he wrote in a Slack message with a red siren emoji. “Please keep Clawdbot off all company hardware and away from work-linked accounts.”\n\nGrad isn’t the only tech executive who has raised concerns to staff about the experimental agentic AI tool, which was briefly known as MoltBot and is now named OpenClaw. A Meta executive says he recently told his team to keep OpenClaw off their regular work laptops or risk losing their jobs. The executive told reporters he believes the software is unpredictable and could lead to a privacy breach if used in otherwise secure environments. He spoke on the condition of anonymity to speak frankly.\n\nPeter Steinberger, OpenClaw’s solo founder, launched it as a free, open source tool last November. But its popularity surged last month as other coders contributed features and began sharing their experiences using it on social media. Last week, Steinberger joined ChatGPT developer OpenAI, which says it will keep OpenClaw open source and support it through a foundation.\n\nOpenClaw requires basic software engineering knowledge to set up. After that, it only needs limited direction to take control of a user’s computer and interact with other apps to assist with tasks such as organizing files, conducting web research, and shopping online.\n\nSome cybersecurity professionals have publicly urged companies to take measures to strictly control how their workforces use OpenClaw. And the recent bans show how companies are moving quickly to ensure security is prioritized ahead of their desire to experiment with emerging AI technologies.\n\n“Our policy is, ‘mitigate first, investigate second’ when we come across anything that could be harmful to our company, users, or clients,” says Grad, who is cofounder and CEO of Massive, which provides inte"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nSonoco has reported a net income of $332.2m in the fourth quarter of 2025, rebounding from a loss in the same period last year. Oil prices have risen over 2% after Vice President JD Vance stated that Iran did not address key US demands in nuclear talks. Bayer has proposed a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer. The FDA is considering making more prescription medicines available over-the-counter. Financial catfishing, or misrepresenting one's wealth to impress a romantic partner, is a growing concern.\n\n## Market & Business Implications\n* Sonoco's quarterly net sales totalled $1.8bn, representing a 29.7% rise, with acquisition activity as the main driver, as stated in Article 1.\n* Oil prices rose more than 2% after Vice President JD Vance said Iran did not address US red lines in nuclear talks, according to Article 2.\n* Bayer is proposing a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer, and expects a negative free cash flow in 2026, as reported in Article 3.\n* The FDA is looking to make changes to allow more companies to make their prescription medicines available over-the-counter, with FDA Commissioner Marty Makary stating that \"everything should be over-the-counter\" unless a drug is unsafe, addictive, or requires monitoring, as stated in Article 5.\n* Financial catfishing is a phenomenon where someone fakes their wealth to impress a date or partner, and can have serious emotional and financial consequences, as discussed in Article 4.\n\n## Beginner-Friendly Summary\nSome big companies have been in the news lately. Sonoco made a lot of money in the last part of 2025. Oil prices went up because of some problems with Iran. A company called Bayer is trying to settle some lawsuits about a weedkiller that might cause cancer. The people in charge of food and medicine are thinking about making some medicines available without a prescription. Some people are also pretending to be richer than they are to impress their dates, which can cause problems.",
    "articles": [
      {
        "title": "Sonoco returns to profit in Q4 2025",
        "link": "https://finance.yahoo.com/news/sonoco-returns-profit-q4-2025-140432373.html",
        "published": "2026-02-18T14:04:32Z",
        "source": "Yahoo Finance",
        "text": "Sonoco has posted an attributable net income of $332.2m in the fourth quarter of 2025, rebounding from a $43m loss in the same period last year.\n\nThe packaging business’s operating profit increased to $520.2m for the three months to December 2025, from $56.1m a year earlier.\n\nDiluted earnings per share stood at $3.33, from a loss of $0.44 per share, largely reflecting gains from the sale of a business.\n\nQuarterly net sales totalled $1.8bn, representing a 29.7% rise, with acquisition activity as the main driver.\n\nThe consumer segment’s net sales saw growth of 62.1%, attributed to Sonoco's Metal Packaging EMEA business, following the completion of the Eviosys acquisition, along with pricing actions.\n\nNet sales for the industrial segment were steady at $568m; price increases were offset by reduced sales from prior divestitures and minor volume declines.\n\nOperating cash flow was reported at $413m for the quarter and $690m for the full year, including one-time tax payments of $196m related to asset sales.\n\nIn November 2025, Sonoco finalised the sale of its ThermoSafe business unit to Arsenal Capital Partners, generating gross proceeds of $656m.\n\nDuring the quarter, net debt was reduced by $965m and by $2.7bn for the year overall, bringing net leverage to approximately three times net debt to adjusted EBITDA.\n\nFull-year results showed net income of $1bn in 2025, an increase of 511.8% from $164m in 2024. In addition, total net sales grew by 41.7% across 2025.\n\nNet sales of the consumer packaging division nearly doubled, increasing 92.5% to reach $4.8bn, while industrial packaging's net sales slipped by 2.1% to $2.2bn.\n\nFor 2026, Sonoco expects adjusted diluted earnings per share between $5.80 and $6.20 and adjusted EBITDA in the range of $1.25bn to $1.35bn. Operating cash flow is forecast at between $700m and $800m.\n\nSonoco also plans changes to its reporting structure in 2026, with industrial plastics packaging included under Industrial Paper Packaging moving forward.\n\nTh"
      },
      {
        "title": "Oil jumps more than 2% after Vance says Iran ignored key U.S. demand, military strikes on the table",
        "link": "https://www.cnbc.com/2026/02/18/oil-prices-today-iran-trump-nuclear-talks.html",
        "published": "Wed, 18 Feb 2026 13:53:58 GMT",
        "source": "US Top News and Analysis",
        "text": "Oil prices rose more than 2% on Wednesday, after Vice President JD Vance said Iran did not address U.S. red lines in nuclear talks this week and President Donald Trump reserves the right to use military force.\n\nU.S. crude oil rose $1.56, or 2.5%, to $63.89 per barrel. Global benchmark Brent was up $1.61, or 2.4%, to $69.04 per barrel.\n\nU.S. envoys Steve Witkoff and Jared Kushner held nuclear talks with Iran in Geneva on Tuesday. Iran's Foreign Minister Abbas Araghchi described the discussions as \"constructive,\" according to Iranian media. Araghchi said the talks yielded a general agreement on guiding principles.\n\nOil prices closed lower Tuesday as traders interpreted the foreign minister's comments as a sign that the U.S. and Iran could still reach a settlement.\n\nBut Vance said Tehran had failed to address core U.S. demands.\n\n\"In some ways it went well, they agreed to meet afterwards,\" the vice president told Fox News Tuesday evening. \"But in other ways it is very clear that the president has set some red lines that the Iranians are not yet willing to actually acknowledge and work through.\"\n\nTrump reserves the right to use force if diplomacy does not succeed in stopping Iran's nuclear program, Vance said. \"We do have a very powerful military — the president has shown a willingness to use it,\" the vice president told Fox News.\n\nSources told Axios, meanwhile, that a U.S. military campaign against Iran would likely be massive, last weeks and look more like a full-fledged war than the raid that captured Venezuelan President Nicolás Maduro in January.\n\nIran's Revolutionary Guard conducted war games this week in the Strait of Hormuz, a vital trade chokepoint for global oil flows. About one third of all waterborne crude exports pass through the narrow waterway, according to data from energy consulting firm Kpler.\n\nThe oil market is worried those oil flows would be disrupted if the U.S. and Iran go to war. Iranian state media said traffic in part of the strait was closed Tu"
      },
      {
        "title": "Bayer proposes $7.25B plan to settle Roundup cancer lawsuits",
        "link": "https://www.foxbusiness.com/industrials/bayer-proposes-7-25b-plan-settle-roundup-cancer-lawsuits",
        "published": "Wed, 18 Feb 2026 08:50:35 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Bayer is proposing a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer — a high-stakes effort to cap years of mounting legal exposure that will pressure the company’s finances in the near term.\n\n\"This is a choice for speed and containment over a protracted legal battle,\" CEO Bill Anderson said Tuesday, describing the agreement as a pivotal step toward limiting long-running litigation tied to the herbicide.\n\nBayer said it is increasing its total litigation reserves to nearly $12 billion and expects about $6 billion in legal payouts in 2026 alone — enough to push free cash flow into negative territory this year.\n\nTRUMP ADMINISTRATION BACKS BAYER AS ROUNDUP FIGHT MOVES TOWARD SUPREME COURT\n\n\"Under the proposed class settlement agreement, the largest of the annual payments would be funded this year,\" CFO Wolfgang Nickl said. \"Therefore, we are expecting a negative free cash flow in 2026.\"\n\nTo finance the resolution, the company has secured an $8 billion loan facility.\n\nThe German pharmaceuticals and agriculture giant said its Monsanto unit filed a proposed nationwide class settlement in St. Louis that would create a long-term compensation program for people who say they developed non-Hodgkin lymphoma after using Roundup at home or on the job.\n\nESTÉE LAUDER SUES WALMART OVER ALLEGED COUNTERFEIT BEAUTY SALES\n\nThe plan would fund payouts through capped annual payments over as many as 21 years. People exposed to Roundup before mid-February 2026 who have already been diagnosed – or who receive a diagnosis within 16 years after court approval – could qualify. Payments would be determined by a tiered system based on exposure and medical factors, with some individuals potentially receiving up to about $198,000 or more.\n\nBayer is facing about 65,000 plaintiffs in U.S. courts. The deal requires a judge’s approval and enough participation from claimants. The company can walk away if too many opt out.\n\n\"We would anticipate that the vas"
      },
      {
        "title": "What is financial catfishing? Warning signs and how to avoid becoming a victim.",
        "link": "https://finance.yahoo.com/personal-finance/banking/article/financial-catfishing-140047468.html",
        "published": "2026-02-18T14:00:47Z",
        "source": "Yahoo Finance",
        "text": "You’ve probably heard of catfishing, or using a fake identity to trick someone into a relationship. But there’s another phenomenon to be aware of in the dating world, and it could be a threat to your money as well as your heart.\n\n\"Financial catfishing\" is when someone fakes their wealth to impress a date or partner. Like traditional catfishing, it can take a major emotional toll.\n\nWhile a slight exaggeration may seem harmless, financial catfishing can easily spiral into lost trust, rocky relationships, strained marriages — and even divorce or financial ruin. Learn more about financial catfishing, common signs, and how to protect yourself from financial and emotional harm.\n\nWhat is financial catfishing, and why do people do it?\n\nFinancial catfishing is similar to traditional catfishing, but with a financial angle: It involves misrepresenting your wealth in an effort to deceive someone else. The goal of financial catfishing may be to impress, deceive, or even scam a romantic partner.\n\nIn today’s dating world, your financial reputation carries weight. According to a survey from Credit One Bank, more than half of millennials and Gen Z say a good credit score makes someone more attractive. Further, 20% of survey respondents would like dating profiles to include individuals’ credit scores and financial habits.\n\nThat growing interest in a potential partner’s financial situation may influence how people want to appear. When financial responsibility is considered attractive and even worthy of a dating profile, some people may feel the need to exaggerate or falsify their financial reality.\n\nRead more: 4 common financial mistakes couples make that lead to divorce (and how to avoid them)\n\nHow prevalent is financial catfishing?\n\nIn a world of highlight reels and curated feeds, faking appearances is easier and more prevalent than ever. Credit One Bank’s survey found that more than half of respondents have faked wealth or success at some point.\n\nAnd it’s not just talk: 37% of resp"
      },
      {
        "title": "FDA chief Marty Makary says 'everything should be over-the-counter' unless drug is unsafe or addictive",
        "link": "https://www.cnbc.com/2026/02/18/fda-chief-marty-makary-more-drugs-should-be-over-the-counter.html",
        "published": "Wed, 18 Feb 2026 13:56:49 GMT",
        "source": "US Top News and Analysis",
        "text": "Food and Drug Administration Commissioner Marty Makary told CNBC that he believes \"everything should be over-the-counter\" unless a drug is unsafe, addictive or requires monitoring – doubling down on a push that some in the pharmaceutical industry have questioned.\n\nIn an interview on Wednesday in Washington, D.C., Makary said the FDA's aims to make changes this year that allow more companies to make their prescription medicines available over-the-counter, or OTC. He noted that the agency is going through \"the proper regulatory processes\" to update OTC monographs – the rulebooks that determine which drugs can be sold without a prescription.\n\nMakary said the FDA is looking at \"basic, safe\" prescription drugs like nausea medications and vaginal estrogen, which is used to treat menopausal symptoms like dryness and pain.\n\n\"In my opinion, everything should be over-the-counter and not requiring a prescription, unless it's unsafe, unless you need laboratory test to monitor how it's being received by your body, or if it could be used for some nefarious purpose or it's addictive,\" Makary told CNBC after the PhRMA Forum, a one-day event organized by the pharmaceutical industry's largest lobbying group.\n\n\"If it doesn't meet those criteria, why shouldn't a drug be over the counter? So we should be asking, why not? Instead of, 'Oh, you want to move over the counter, you got to go through a long, tedious process,'\" he added."
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe US and Iran have agreed to continue nuclear talks, despite both countries building up their military forces. Meanwhile, India has told a university to leave an AI summit after it presented a Chinese robot as its own. Kenyan authorities have been accused of using Israeli technology to crack an activist's phone. Inflation has decreased to 3% due to lower food and fuel prices. \n\n## Market & Business Implications\n* The US and Iran are continuing nuclear talks, with both sides ramping up their military forces, as stated in Article 1.\n* A university was asked to leave an AI summit after presenting a Chinese robot as its own, according to Article 2.\n* Kenyan authorities used Israeli technology, specifically Cellebrite, to break into an activist's phone, as reported in Article 3.\n* Inflation has decreased to 3% due to lower food and fuel prices, as stated in Article 4.\n* A former Pentagon official discussed the latest talks between the US and Iran, as reported in Article 5.\n\n## Beginner-Friendly Summary\nThe US and Iran are talking about nuclear issues, but they are also getting ready for a fight. A university in India did something wrong at a big meeting about artificial intelligence. The government in Kenya got into an activist's phone using special technology from Israel. Food and fuel prices are lower, so inflation is down to 3%.",
    "articles": [
      {
        "title": "US and Iran say they'll continue nuclear talks as both build up their military forces",
        "link": "https://www.npr.org/2026/02/18/nx-s1-5717095/us-and-iran-say-theyll-continue-nuclear-talks-as-both-build-up-their-military-forces",
        "published": "Wed, 18 Feb 2026 06:40:38 -0500",
        "source": "NPR Topics: World",
        "text": "US and Iran say they'll continue nuclear talks as both build up their military forces The second round of U.S.-Iran talks ended with a pledge to continue talking, but both sides are ramping up their military forces.\n\nWorld US and Iran say they'll continue nuclear talks as both build up their military forces US and Iran say they'll continue nuclear talks as both build up their military forces Listen · 3:28 3:28 The second round of U.S.-Iran talks ended with a pledge to continue talking, but both sides are ramping up their military forces. Sponsor Message Sponsor Message"
      },
      {
        "title": "India tells university to leave AI summit after presenting Chinese robot as its own, sources say - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPYUtrYzJaVnVoeUlsdzdoVkI0bWtCaFBvR3hXbU9sUDNHWjVzX0VvWWdrdkpvNXJ4dzdJcFUxWkloeW1FbkpQaHVzdDdacnA0UVhIM2s3U3M4ZWNBQ1lIVVF1eWNtZ0UycXBXLTc4Q244bVZFdTNVSEcyOXdtc2oyd2hvTFNETlRTUDlBZDB2WFVBMWFWa2w0RUJ6MFNtZWFtZTEyOGp6bGZkOWprMmNWT3ZRa0dXQjZNVFhzTTFUVEZ2N1k?oc=5",
        "published": "Wed, 18 Feb 2026 07:53:41 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Kenyan authorities used Israeli tech to crack activist’s phone, report claims",
        "link": "https://www.theguardian.com/world/2026/feb/17/trim-slugs-to-kenya-authorities-israel-tech-crack-activists-phone-report",
        "published": "Tue, 17 Feb 2026 11:01:02 GMT",
        "source": "World news | The Guardian",
        "text": "When Boniface Mwangi, the prominent Kenyan pro-democracy activist who plans to run for president in 2027, had his phones returned to him by Kenyan authorities after his controversial arrest last July, he immediately noticed a problem: one of the phones was no longer password protected and could be opened without one.\n\nIt was Mwangi’s personal phone, which he used to communicate with friends and mentors, and contained photos of private family moments with his wife and children. Knowing that its contents could be in the hands of the Kenyan government made Mwangi – who has described harassment and even torture – feel unsafe and “exposed”, he told the Guardian.\n\nA report released on Tuesday by Citizen Lab, which tracks digital threats against civil society, has found with “high confidence” that Kenyan authorities used Israeli technology to break into Mwangi’s phone while he was under arrest last year, when the device was in police custody.\n\nAuthorities’ use of the technology, made by Cellebrite, “could have enabled the full extraction of all materials from Mwangi’s device, including messages, private materials, personal files, financial information, passwords, and other sensitive information”, Citizen Lab said.\n\nThe findings, researchers claimed, add to the growing body of evidence that Cellebrite’s technology is being “abused by its government clients, and the company is failing to prevent those abuses from happening”.\n\nIn a statement to the Guardian, Cellebrite said it maintained a “rigorous process for reviewing allegations of technology misuse” and that it took “decisive action”, including licence termination, when credible and substantiated evidence is presented to the company.\n\n“We do not respond to speculation and encourage any organisation with specific, evidence-based concerns to share them with us directly so we can act on them,” the company said.\n\nThe Guardian reached out to Kenya’s police spokesperson and the Kenyan embassy in Washington for comment but did "
      },
      {
        "title": "Lower food and fuel prices drive inflation down to 3%",
        "link": "https://www.bbc.com/news/articles/c5yg04jg1n5o?at_medium=RSS&at_campaign=rss",
        "published": "Wed, 18 Feb 2026 09:16:19 GMT",
        "source": "BBC News",
        "text": "Speaking to the BBC's Today programme, he said the last time the Bank met, its vote to hold the rate at 3.75% was so finely split that it will take just a \"little bit of additional evidence\" of slowing inflation to \"pip one of those members to shift their vote\"."
      },
      {
        "title": "Former Pentagon official on the latest talks between the US and Iran",
        "link": "https://www.npr.org/2026/02/18/nx-s1-5717003/former-pentagon-official-on-the-latest-talks-between-the-us-and-iran",
        "published": "Wed, 18 Feb 2026 06:40:28 -0500",
        "source": "NPR Topics: World",
        "text": "Former Pentagon official on the latest talks between the US and Iran NPR's Michel Martin speaks with former Pentagon official Dana Stroul about the latest round of Iran talks and the potential for military action.\n\nWorld Former Pentagon official on the latest talks between the US and Iran Former Pentagon official on the latest talks between the US and Iran Listen · 5:30 5:30 NPR's Michel Martin speaks with former Pentagon official Dana Stroul about the latest round of Iran talks and the potential for military action. Sponsor Message Sponsor Message"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nBayer has proposed a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer. Meanwhile, Walmart and Target are heading in different directions under new CEOs, with Walmart's stock rising and Target's stock falling. Lower fuel prices and airfares have also contributed to a decrease in inflation. Additionally, Stephen Colbert has been feuding with CBS over the network's handling of his interview with a Texas Democrat. Bayer's proposal is a significant development in the company's efforts to resolve the ongoing litigation.\n\n## Market & Business Implications\n* Bayer is proposing a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer, which will pressure the company's finances in the near term (Article 2).\n* Walmart's stock has shot up by about 163% over the past five years, while Target's stock has tumbled by about 40% over the same period (Article 4).\n* Lower fuel prices and airfares have helped drive inflation down, according to a statement made to the BBC's Today programme (Article 3).\n\n## Beginner-Friendly Summary\nThere's a big company called Bayer that's trying to settle some lawsuits about a product that might have caused cancer. Two other big companies, Walmart and Target, have new leaders and are doing differently. Walmart is doing well, but Target is not. Also, prices for some things like fuel and flights are going down, which is helping to make inflation lower. And there's a TV host named Stephen Colbert who's arguing with his company, CBS.",
    "articles": [
      {
        "title": "Stephen Colbert uses his show to roast CBS in feud over FCC rules",
        "link": "https://www.washingtonpost.com/business/2026/02/18/colbert-james-talarico-fcc-segment-cbs/",
        "published": "Wed, 18 Feb 2026 12:55:57 +0000",
        "source": "Business",
        "text": "Late-night host Stephen Colbert laid into executives at CBS and its parent company for the second night running Tuesday, rebuking his bosses for their handling of his interview with a Texas Democrat. In an on-air segment, Colbert suggested the network was caving to pressure by trying to apply the Federal Communications Commission’s equal-time rule, which requires broadcasters to provide equal opportunity to political candidates but has traditionally not applied to news and talk show interviews.\n\nColbert was already set to depart from the network in May, after CBS said it was canceling “The Late Show” for financial reasons last summer.\n\nOn Monday Colbert accused lawyers for the network’s parent company, Paramount Skydance, of blocking his interview with Texas state Rep. James Talarico (D), a U.S. Senate candidate, over concerns it would violate the equal-time rule. Ask The Post AIDive deeper\n\nCBS pushed back against that account in a statement Tuesday, suggesting its executives hadn’t prohibited the interview but instead had informed Colbert of legal guidance that it could trigger the FCC equal-time rule.\n\nLast month, the FCC said it would require network talk shows to offer equal airtime to all candidates intending to run for the same office, changing course on a long-running policy and resurfacing free-speech concerns.\n\nColbert’s interview with Talarico was posted on the show’s YouTube channel, where it has so far received more than 5 million views.\n\nThe CBS statement rankled Colbert. In his show Tuesday, he told his audience that he had never before been asked to abide by the equal-time rule in over two decades of hosting late night shows.\n\n“I was ready to let the whole thing go, until a few hours ago,” he said, holding up CBS’s statement. “This is a surprisingly small piece of paper considering how many butts it’s trying to cover,” he said, also criticizing the company for publishing it without consulting him first.\n\n“For the record, I’m not mad. I really don’t w"
      },
      {
        "title": "Bayer proposes $7.25B plan to settle Roundup cancer lawsuits",
        "link": "https://www.foxbusiness.com/industrials/bayer-proposes-7-25b-plan-settle-roundup-cancer-lawsuits",
        "published": "Wed, 18 Feb 2026 08:50:35 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Bayer is proposing a $7.25 billion plan to settle thousands of lawsuits claiming its Roundup weedkiller caused cancer — a high-stakes effort to cap years of mounting legal exposure that will pressure the company’s finances in the near term.\n\n\"This is a choice for speed and containment over a protracted legal battle,\" CEO Bill Anderson said Tuesday, describing the agreement as a pivotal step toward limiting long-running litigation tied to the herbicide.\n\nBayer said it is increasing its total litigation reserves to nearly $12 billion and expects about $6 billion in legal payouts in 2026 alone — enough to push free cash flow into negative territory this year.\n\nTRUMP ADMINISTRATION BACKS BAYER AS ROUNDUP FIGHT MOVES TOWARD SUPREME COURT\n\n\"Under the proposed class settlement agreement, the largest of the annual payments would be funded this year,\" CFO Wolfgang Nickl said. \"Therefore, we are expecting a negative free cash flow in 2026.\"\n\nTo finance the resolution, the company has secured an $8 billion loan facility.\n\nThe German pharmaceuticals and agriculture giant said its Monsanto unit filed a proposed nationwide class settlement in St. Louis that would create a long-term compensation program for people who say they developed non-Hodgkin lymphoma after using Roundup at home or on the job.\n\nESTÉE LAUDER SUES WALMART OVER ALLEGED COUNTERFEIT BEAUTY SALES\n\nThe plan would fund payouts through capped annual payments over as many as 21 years. People exposed to Roundup before mid-February 2026 who have already been diagnosed – or who receive a diagnosis within 16 years after court approval – could qualify. Payments would be determined by a tiered system based on exposure and medical factors, with some individuals potentially receiving up to about $198,000 or more.\n\nBayer is facing about 65,000 plaintiffs in U.S. courts. The deal requires a judge’s approval and enough participation from claimants. The company can walk away if too many opt out.\n\n\"We would anticipate that the vas"
      },
      {
        "title": "Lower fuel prices and airfares help drive inflation down",
        "link": "https://www.bbc.com/news/articles/c5yg04jg1n5o?at_medium=RSS&at_campaign=rss",
        "published": "Wed, 18 Feb 2026 09:16:19 GMT",
        "source": "BBC News",
        "text": "Speaking to the BBC's Today programme, he said the last time the Bank met, its vote to hold the rate at 3.75% was so finely split that it will take just a \"little bit of additional evidence\" of slowing inflation to \"pip one of those members to shift their vote\"."
      },
      {
        "title": "As Walmart and Target head in different directions, all eyes are on their new CEOs",
        "link": "https://www.cnbc.com/2026/02/18/walmart-target-earnings-new-ceos-furner-fiddelke.html",
        "published": "Wed, 18 Feb 2026 12:52:44 GMT",
        "source": "Business News",
        "text": "Walmart CEO John Furner, left, and Target CEO Michael Fiddelke. Walmart (L) | Getty Images (R)\n\nWhen Walmart and Target report holiday earnings this quarter, investors may quickly brush off those results. Instead, they will likely focus more on the two big-box retailers' futures under new CEOs and the outlook for U.S. consumers in 2026. Both companies had leadership changes this month: Walmart CEO John Furner and Target CEO Michael Fiddelke, both longtime company insiders, took on their roles on Feb. 1. The rival retailers have contended with the same economic challenges. U.S. consumers are still spending, but buying selectively, as inflation and tariffs fuel higher prices for groceries and other essentials and cause some shoppers to think twice about discretionary purchases. Yet while both Walmart and Target have new CEOs, their paths forward look distinctly different. Walmart's stock has shot up by about 163% over the past five years and has risen about 24% over the last year, as of Tuesday's market close. It hit a 52-week high Tuesday. Shares of Target, on the other hand, have tumbled by about 40% over the past five years and dropped 9% over the past year. The retailers' stock market performances reflect their sharp divergence in sales results. Walmart is attracting shoppers across incomes and gaining momentum with online sales and higher-margin businesses like advertising. Target is struggling with slower sales and weaker store traffic. Walmart expects its full-year net sales to rise by 4.8% and 5.1%. Target, on the other hand, is on track for a full-year sales decline. Walmart CEO John Furner inherited a business that's \"fundamentally sound\" and \"on a great trajectory,\" said Neil Saunders, managing director and retail analyst at GlobalData. \"In many ways, his job is to keep the ship steady and see what he can do to add to the speed,\" he said. On the other hand, Target CEO Michael Fiddelke has to \"sell the Target of the future\" after four years of roughly flat a"
      },
      {
        "title": "How the Rev. Jesse Jackson taught me to keep hope alive",
        "link": "https://www.washingtonpost.com/business/2026/02/18/singletary-jackson/",
        "published": "Wed, 18 Feb 2026 11:00:00 +0000",
        "source": "Business",
        "text": "I am who I am today in part because of a speech I heard in fifth grade at Matthew A. Henson Elementary School in Baltimore. It was 1970, and the auditorium was full of little Black boys and girls, fidgeting, waiting for the speaker to begin. “I am somebody,” a voice boomed from the stage, shaking us to attention.\n\nI have never forgotten that day when the Rev. Jesse Jackson spoke life into me, eventually inspiring me to go to college. His words pushed me to overcome the feeling of being unwanted. At 4, I had to go live with my grandmother, Big Mama. My four siblings and I — one older, three younger — arrived at my grandmother’s West Baltimore home, disheveled, hungry and sick. We only had the clothes on our backs. Had it not been for my grandmother, we would have been placed in foster care.\n\nMy grandmother provided a secure home, but didn’t want me to dream too big and be disappointed. She wanted the best for me, but the granddaughter of enslaved individuals knew all too well the obstacles I would face.\n\nMy aspirations to be a writer were motivated by Jackson’s call-and-response keynote.\n\n“Say it after me,” Jackson coaxed us.\n\n“I am somebody!”\n\nThe hundreds of little voices shouting those words still stick with me. I yelled it at the top of my voice.\n\n“I may be poor, but I am somebody,” Jackson said. “I must be respected, protected, never rejected.”\n\nThat hit home.\n\nI was a weepy child, craving the love of parents who abandoned me. I grew up watching my grandmother drive from one bar to another on Fridays, searching for my grandfather before he drank away his paycheck. My mother drifted in and out of my life, breaking one promise after another. The first time I recall seeing my father was in a prison visiting room.\n\n“I may be on welfare, but I am somebody,” Jackson said during the assembly.\n\nI received free lunch, and my grandmother would get boxes of powdered milk and large blocks of government-issued cheese. I was embarrassed that we needed the assistance.\n\n“I may "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nGator Capital Management released its fourth-quarter 2025 investor letter, highlighting its performance and top holdings, including TFS Financial Corporation and Robinhood Markets, Inc. Palo Alto Networks reported strong quarterly earnings but fell short of guidance, causing its stock to drop. The company also announced the acquisition of Israeli cybersecurity startup Koi. Gator Capital Management sold its position in PayPal Holdings, Inc. due to continued challenges in the business.\n\n## Market & Business Implications\n* Gator Capital Management's Gator Financial Partners, LLC returned 4.14% in Q4 2025, outperforming the S&P 500 Total Return Index (Article 1).\n* Palo Alto Networks' revenue grew 15% from $2.3 billion a year ago, and the company forecasted revenue of $2.94 billion to $2.95 billion for the fiscal third quarter (Article 4).\n* Robinhood Markets, Inc.'s one-month return was -28.78%, and its shares are up 27.37% over the past twelve months (Article 3).\n* PayPal Holdings, Inc.'s one-month return was -26.98%, and its shares are down 47.92% over the past twelve months (Article 5).\n* Palo Alto Networks acquired Israeli cybersecurity startup Koi to secure AI agents (Article 4).\n\n## Beginner-Friendly Summary\nSome big companies in the stock market had some news. Gator Capital Management talked about how well they did last quarter and what companies they like. Palo Alto Networks had good earnings, but their stock went down because they didn't do as well as expected. They also bought a new company to help with cybersecurity. Gator Capital Management sold their shares of PayPal because the company is having some problems.",
    "articles": [
      {
        "title": "Gator Capital Management’s Investment Thesis for TFS Financial Corporation (TFSL)",
        "link": "https://finance.yahoo.com/news/gator-capital-management-investment-thesis-135034704.html?.tsrc=rss",
        "published": "Wed, 18 Feb 2026 13:50:34 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Gator Capital Management, an investment management company, released its fourth-quarter 2025 investor letter. A copy of the letter can be downloaded here. In Q4 2025, Gator Capital Management’s Gator Financial Partners, LLC returned 4.14%, Gator Offshore Partners, Ltd. returned 3.96%, and Gator Qualified Partners, LLC returned 6.10%. These compare to the S&P 500 Total Return Index 2.65% return and the S&P 1500 Financials Index’s 1.95% return. In 2025, Gator Funds returned 31.94%, 30.90%, and 16.92%, respectively, significantly outperforming both the broader market and the Financials sector benchmark. Please review the firm’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Gator Capital Management highlighted stocks such as TFS Financial Corporation (NASDAQ:TFSL). TFS Financial Corporation (NASDAQ:TFSL) is a US-based retail consumer banking services provider. The one-month return of TFS Financial Corporation (NASDAQ:TFSL) was 5.51%, and its shares gained 13.56% of their value over the last 52 weeks. On February 17, 2026, TFS Financial Corporation (NASDAQ:TFSL) stock closed at $15.33 per share, with a market capitalization of $4.302 billion.\n\nGator Capital Management stated the following regarding TFS Financial Corporation (NASDAQ:TFSL) in its fourth quarter 2025 investor letter:"
      },
      {
        "title": "We cut our Palo Alto price target, but view the post-earnings drop as an opportunity",
        "link": "https://www.cnbc.com/2026/02/17/we-cut-our-palo-alto-price-target-but-view-the-post-earnings-drop-as-an-opportunity.html",
        "published": "Wed, 18 Feb 2026 01:49:39 GMT",
        "source": "Earnings",
        "text": "Palo Alto Networks on Tuesday evening delivered a strong quarter. But in a market with no room for error, the cybersecurity giant stumbled on guidance, and the stock sank. Revenue for the company's fiscal 2026 second quarter ended Jan. 31 increased 15% to $2.59 billion, outpacing the $2.58 billion consensus estimate compiled by data provider LSEG. Earnings per share (EPS) jumped 27% year over year to $1.03, beating the LSEG estimate of 94 cents. PANW YTD mountain Palo Alto Networks YTD Shares of Palo Alto Networks dropped more than 8% in after-hours trading following a weaker than expected current quarter EPS forecast and a cut to its full-year earnings outlook. The glass-half-full view, however, is that management raised its guidance on current quarter and full-year revenue and next-generation security annual recurring revenue (ARR). That indicates to us that the downward revision to profitability is the result of share count dilution, resulting from the CyberArk and Chronosphere acquisitions, rather than anything relating to the fundamentals. Bottom line With noise around management's guidance, especially given what the stock has been through over the past month in the software-as-a-service (SaaS) armageddon, investors are better served focusing on the qualitative commentary from the post-earnings conference call and the quarterly release regarding the impact of artificial intelligence on Palo Alto's business. Through this lens, we feel a whole lot better about the year ahead and the opportunity Palo Alto stock has to offer than the after-hours slide and the year-to-date difficulty might have you believe. Additionally, Jim Cramer has said repeatedly that cybersecurity stocks, including Club names Palo Alto and CrowdStrike, should never have been lumped in with more traditional SaaS names in the first place. That's because of how important cyber protection is in a world where both the good guys and the bad guys have AI in their arsenals. We bought some more CrowdSt"
      },
      {
        "title": "Robinhood (HOOD) Gained from the Continued Introduction of New Products",
        "link": "https://finance.yahoo.com/news/robinhood-hood-gained-continued-introduction-134744925.html?.tsrc=rss",
        "published": "Wed, 18 Feb 2026 13:47:44 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Gator Capital Management, an investment management company, released its fourth-quarter 2025 investor letter. A copy of the letter can be downloaded here. In Q4 2025, Gator Capital Management’s Gator Financial Partners, LLC returned 4.14%, Gator Offshore Partners, Ltd. returned 3.96%, and Gator Qualified Partners, LLC returned 6.10%. These compare to the S&P 500 Total Return Index 2.65% return and the S&P 1500 Financials Index’s 1.95% return. In 2025, Gator Funds returned 31.94%, 30.90%, and 16.92%, respectively, significantly outperforming both the broader market and the Financials sector benchmark. Please review the firm’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Gator Capital Management highlighted stocks like Robinhood Markets, Inc. (NASDAQ:HOOD). Robinhood Markets, Inc. (NASDAQ:HOOD) is a US-based financial services company that provides a trading platform for stocks, exchange-traded funds, American depository receipts, options, gold, and cryptocurrencies. On February 17, 2026, Robinhood Markets, Inc. (NASDAQ:HOOD) stock closed at $75.44 per share. One-month return of Robinhood Markets, Inc. (NASDAQ:HOOD) was -28.78%, and its shares are up 27.37% over the past twelve months. Robinhood Markets, Inc. (NASDAQ:HOOD) has a market capitalization of $67.996 billion.\n\nGator Capital Management stated the following regarding Robinhood Markets, Inc. (NASDAQ:HOOD) in its fourth quarter 2025 investor letter:\n\n\"During 2025, we had strong performance and outperformed both the broader market and the Financials sector benchmark. The two major drivers were our positions in Robinhood Markets, Inc. (NASDAQ:HOOD) and Anywhere Real Estate.\n\nRobinhood Markets, Inc. (HOOD): Jim Cramer Shares How His Wife Advised CEO Vlad Tenev\n\nRobinhood Markets, Inc. (NASDAQ:HOOD) is not on our list of 30 Most Popular Stocks Among Hedge Funds. According to our database, 77 hedge fund portfolios held Robinhood Markets, Inc. (NA"
      },
      {
        "title": "Palo Alto Networks slumps 7% as third-quarter profit guidance falls short",
        "link": "https://www.cnbc.com/2026/02/17/palo-alto-networks-panw-q2-2026-earnings.html",
        "published": "Wed, 18 Feb 2026 10:52:41 GMT",
        "source": "Earnings",
        "text": "Palo Alto Networks beat Wall Street's fiscal second-quarter estimates after the bell on Tuesday but shares fell 7% on disappointing guidance.\n\nHere's how the company did versus LSEG estimates:\n\nEarnings per share : $1.03 per share excluding items vs. 94 cents expected\n\n: $1.03 per share excluding items vs. 94 cents expected Revenue: $2.59 billion vs. $2.58 billion expected\n\nThe cybersecurity company forecasted lackluster earnings for the fiscal third quarter in the range of 78 cents and 80 cents, falling short of an estimate of 92 cents from LSEG.\n\nRevenue is expected to hit $2.94 billion to $2.95 billion, topping a $2.60 billion estimate.\n\nRevenue grew 15% from $2.3 billion a year ago, the company said. Net income totaled $432 million, or 61 cents per share, up from $267 million, or 38 cents per share a year ago.\n\nPalo Alto also said on Tuesday that it's buying Israeli cybersecurity startup Koi to secure AI agents as rising artificial intelligence innovation fuels more sophisticated cyberattacks. The company has bet big on AI tools, and recently launched AI agents to help customers automate certain security responses.\n\nThe company is also in the midst of a significant spending spree as CEO Nikesh Arora transforms Palo Alto into a hub for all things cybersecurity. Since joining the company in 2018, he's overseen more than 20 acquisitions.\n\nEarlier this month, the Santa Clara, California-based company closed its biggest acquisition ever, paying $25 billion for Israeli identity security company CyberArk. In January, it closed the more than $3 billion purchase of cloud observability platform Chronosphere.\n\n\"We saw continued strength in platformizations, a trend that is accelerating due to AI - customers are keen to both modernize and normalize their cybersecurity stack, aligning them to our approach,\" Arora wrote in a release.\n\nRemaining performance obligations, which track the value of contracts to be delivered to customers, totaled $16 billion and topped a StreetAcco"
      },
      {
        "title": "Here’s Why Gator Capital Sold PayPal (PYPL)",
        "link": "https://finance.yahoo.com/news/why-gator-capital-sold-paypal-134353662.html?.tsrc=rss",
        "published": "Wed, 18 Feb 2026 13:43:53 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Gator Capital Management, an investment management company, released its fourth-quarter 2025 investor letter. A copy of the letter can be downloaded here. In Q4 2025, Gator Capital Management’s Gator Financial Partners, LLC returned 4.14%, Gator Offshore Partners, Ltd. returned 3.96%, and Gator Qualified Partners, LLC returned 6.10%. These compare to the S&P 500 Total Return Index 2.65% return and the S&P 1500 Financials Index’s 1.95% return. In 2025, Gator Funds returned 31.94%, 30.90%, and 16.92%, respectively, significantly outperforming both the broader market and the Financials sector benchmark. Please review the firm’s top five holdings to gain insights into their key selections for 2025.\n\nIn its fourth-quarter 2025 investor letter, Carillon Eagle Small Cap Growth Fund highlighted stocks like PayPal Holdings, Inc. (NASDAQ:PYPL). PayPal Holdings, Inc. (NASDAQ:PYPL) is a leading technology platform that provides digital payment solutions for merchants and consumers. On February 17, 2026, PayPal Holdings, Inc. (NASDAQ:PYPL) stock closed at $40.81 per share. One-month return of PayPal Holdings, Inc. (NASDAQ:PYPL) was -26.98%, and its shares are down 47.92% over the past twelve months. PayPal Holdings, Inc. (NASDAQ:PYPL) has a market capitalization of $38.184 billion.\n\nCarillon Eagle Small Cap Growth Fund stated the following regarding PayPal Holdings, Inc. (NASDAQ:PYPL) in its fourth quarter 2025 investor letter:\n\n\"For FY 2025, our top detractors were our long positions in PayPal Holdings, Inc. (NASDAQ:PYPL), Global Payments, and Virtus Investment Partners. We exited our PayPal position in Q4. PayPal management presented at two conferences during Q4 and talked about continued challenges in the business. We decided to step to the sidelines and watch the next couple of earnings reports.\"\n\nJim Cramer Notes PayPal (PYPL)’s CEO Alex Chriss “Will Get You Where You Have to Go”\n\nPayPal Holdings, Inc. (NASDAQ:PYPL) is not on our list of 30 Most Popular Stocks Among Hedge F"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nThe European Central Bank is planning to launch a digital euro pilot in 2027, with the selection of payment service providers starting in the first quarter of 2026. Meanwhile, Elon Musk's Grok AI has been making headlines for its controversial and irreverent approach to chatbots. In the world of DeFi, Moonwell was exploited for $1.78 million due to a misconfigured pricing oracle, and World Liberty Financial's token surged ahead of a high-profile gathering at Mar-a-Lago. The European Blockchain Sandbox is also making progress in promoting innovation and regulation in the blockchain space.\n\n## Market & Business Implications\n* The European Central Bank's digital euro pilot will involve a limited number of payment service providers, merchants, and Eurosystem staff, with the selection process starting in Q1 2026 (Article 1).\n* Grok AI, developed by xAI, is designed to be a more irreverent and politically incorrect alternative to ChatGPT, with features such as real-time data access and image generation (Article 2).\n* The European Blockchain Sandbox has produced a 230-page best practices report and drawn in nearly 125 regulators and authorities, aiming to promote innovation and regulation in the blockchain space (Article 3).\n* World Liberty Financial's WLFI token surged double digits ahead of a high-profile gathering at Mar-a-Lago, with experts attributing the move to a short squeeze rather than organic demand (Article 4).\n* Moonwell's $1.78 million exploit was caused by a misconfigured pricing oracle, which was potentially linked to AI-assisted code writing (Article 5).\n\n## Beginner-Friendly Summary\nThe European Central Bank is working on a new kind of money called a digital euro. It will start testing this new money in 2027. There's also a new chatbot called Grok that's making waves because it's a bit controversial. Some people are talking about a big meeting at a place called Mar-a-Lago, and a special kind of money called a token is going up in value. Meanwhile, there was a problem with a company called Moonwell that lost some money because of a mistake.",
    "articles": [
      {
        "title": "ECB targets 2027 digital euro pilot as provider selection begins in Q1 2026",
        "link": "https://cointelegraph.com/news/ecb-digital-euro-pilot-2027-psp-selection-2026-cipollone?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 18 Feb 2026 13:53:24 +0000",
        "source": "Cointelegraph.com News",
        "text": "The European Central Bank (ECB) is moving closer to a pilot for a digital euro, with Executive Board Member Piero Cipollone outlining plans to begin selecting payment service providers (PSPs) in early 2026, ahead of a 12-month test scheduled for the second half of 2027.\n\nCipollone on Wednesday held an executive committee meeting of the Italian Banking Association. He said the pilot would involve a limited number of payment service providers, merchants and Eurosystem staff. Selection of participating providers is expected to start in the first quarter of 2026.\n\nCipollone said the digital euro will be designed to ensure it protects European card schemes and keeps banks at the core of the Eurozone payments system, according to Reuters.\n\nPilot could give PSPs an early start\n\nEuropean Union-licensed PSPs will be at the core of digital euro distribution, Cipollone said. For participating PSPs, the pilot offers an early-readiness advantage ahead of a potential broader rollout, including hands-on experience with onboarding, settlement and liquidity management.\n\nSource: ECB\n\nHe added that it also provides clearer visibility on future infrastructure, compliance and staffing costs, helping companies plan investments more accurately.\n\nWith direct Eurosystem support and the ability to feed into the design process, participants should gain both operational insight and influence over how the digital euro ultimately takes shape.\n\nStablecoins are not the only threat to banks, says Cipollone\n\nThe digital euro pilot is also intended to protect domestic European payment projects, such as Italy’s Bancomat card network and Spain’s Bizum peer-to-peer system.\n\n“Banks could lose their role in payments not just because of stablecoins but also due to other private solutions,” Cipollone said, pointing to Europe’s heavy reliance on international card networks like Visa and Mastercard.\n\nHe added that the digital euro would be structured to preserve the competitiveness of local systems.\n\n“The cap"
      },
      {
        "title": "What Is Grok AI? Elon Musk’s Controversial ChatGPT Rival",
        "link": "https://decrypt.co/resources/grok-ai-elon-musk-controversial-chatgpt-rival",
        "published": "Wed, 18 Feb 2026 12:54:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Grok is Elon Musk’s irreverent answer to ChatGPT—designed to be edgy, real-time, and politically incorrect.\n\nBuilt into X, Grok has rapidly evolved through multiple versions, with Grok 4 powered by xAI’s Colossus supercomputer.\n\nDespite its growth, Grok has faced backlash for offensive response, accuracy issues and the creation of sexualized imagery.\n\nCreated to be a more irreverent, politically incorrect, and “truthful” AI, Grok is Elon Musk’s frequently controversial answer to ChatGPT, developed by OpenAI—the company he co-founded in 2015.\n\nWho Created Grok AI?\n\nLaunched in 2023, Grok was developed by xAI, Elon Musk’s rival to AI powerhouse OpenAI. Since its release, Grok has been integrated into X, the social media platform formerly known as Twitter.\n\nGrok is not just another chatbot—it’s designed to be snarky, opinionated, and responsive to real-time news and public sentiment.\n\nMusk first announced plans for a ChatGPT rival in April 2023. Then called TruthGPT, the chatbot was intended as the antithesis of what he labeled “woke” AI, referring to the political filters imposed by OpenAI, Meta, Google, and Anthropic.\n\nKey Features of Grok\n\n📊 Real-time data access: Delivers updates on trending topics and breaking news from X and the wider internet.\n\nDelivers updates on trending topics and breaking news from X and the wider internet. 🖼️ Image generation: Creates realistic visuals from user prompts.\n\nCreates realistic visuals from user prompts. 📄 Document summarization: Condenses long texts for easier reading.\n\nCondenses long texts for easier reading. 🕵️‍♂️ Fact-checking: Verifies claims using live data from X and searches online.\n\nVerifies claims using live data from X and searches online. 🤡 Dual modes: Switches between playful “Fun Mode” and professional “Regular Mode.”\n\nSwitches between playful “Fun Mode” and professional “Regular Mode.” 👨‍💻 Coding assistance: Generates and debugs c"
      },
      {
        "title": "How Europe’s blockchain sandbox finds innovation in regulation",
        "link": "https://cointelegraph.com/news/europe-blockchain-sandbox-innovation-regulation?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 18 Feb 2026 13:51:15 +0000",
        "source": "Cointelegraph.com News",
        "text": "The European Union, often criticized for prioritizing rulemaking over innovation, is pointing to the European Blockchain Sandbox as an example of how regulation can boost innovation.\n\nAfter three cohorts of confidential dialogues, the initiative has produced a 230-page best practices report and drawn in nearly 125 regulators and authorities.\n\nThe European Commission tapped law firm Bird & Bird and its consortium partners to lead the initiative, which matches blockchain use cases with regulators for confidential dialogues aimed at clearing legal challenges.\n\nMarjolein Geus, a partner at Bird & Bird, told Cointelegraph that the process has shown compliance need not be a deterrent.\n\n“For use case owners, it helps them better understand the relevant regulations and how those rules apply to their projects,” she said. “It allows regulators and authorities to deepen their understanding of how those technologies interact with the regulatory frameworks within their areas of competence.”\n\nIn the latest cohort, “mature” use cases were increasingly operational and embedded in sectors such as energy, healthcare and artificial intelligence, bringing along more complex compliance discussions.\n\nProjects entering the dialogue discussed how existing regulatory frameworks apply to their use cases. Source: European Commission\n\nHow MiCA became a test of regulatory timing for blockchain\n\nWhen the Markets in Crypto-Assets Regulation (MiCA) was adopted, observers warned that strict obligations would raise barriers for startups. Stablecoin rules drew particular scrutiny as Tether — issuer of the world’s largest stablecoin — ultimately decided against seeking MiCA authorization for USDt (USDT).\n\nThe brain drain narrative predates crypto. European founders have often incorporated in jurisdictions perceived as having a lighter touch.\n\nUSDT is still the largest stablecoin in the world despite pulling back from the EU. Source: CoinGecko\n\nSimilar fears surfaced when the General Data Protection Re"
      },
      {
        "title": "WLFI Jumps Double Digits Ahead of Mar-a-Lago 'World Liberty Forum'",
        "link": "https://decrypt.co/358382/wlfi-jumps-double-digits-ahead-of-mar-a-lago-world-liberty-forum",
        "published": "Wed, 18 Feb 2026 12:40:41 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Trump-family linked World Liberty Financial’s recent move was a short squeeze: whale buys amid negative funding, and a 40% OI spike, Decrypt was told.\n\nThe DeFi project has announced a February 18 \"World Liberty Forum\" at the president's Florida residence Mar-a-Lago.\n\nIts $500 million deal with a UAE firm has sparked scrutiny, with experts split on how the political heat affects the token and its meme premium.\n\nWorld Liberty Financial's WLFI token surged double digits ahead of a high-profile gathering at Mar-a-Lago, though experts remain divided on whether the move signals genuine momentum or a short squeeze fueled by whale activity.\n\nWLFI is up by more than 22% over the past 24 hours, according to CoinGecko data, despite dropping 25% over the past month. The token's sudden spike coincides with the Trump-family-backed project's Tuesday announcement of a February 18 \"World Liberty Forum\" at the president's Florida residence, with an agenda covering digital assets, stablecoins, AI, and dollar strength, among others.\n\nThe move tests whether politically themed tokens can sustain rallies on event-driven speculation—and whether intensifying scrutiny from Washington could cap any upside before it gains traction.\n\nConnor Howe, CEO and co-founder of Layer 1 network Enso, attributed the surge to technical factors rather than organic demand. \"One whale dropped 2.75 million USDC in a single buy, a team-linked wallet received 10 million from Coinbase, and a bunch of short sellers got caught on the wrong side of the trade,\" Howe told Decrypt.\n\nHe noted that volume doubled overnight, open interest spiked 40%, and funding remained negative heading into the move. \"That's called a short squeeze, not organic demand,\" Howe said. \"WLFI is still down 27% over 30 days and sitting 60% below its 2025 all-time high. Speculators got a relief rally.\"\n\nIllia Otychenko, lead analyst at CEX.IO, pointed to reports"
      },
      {
        "title": "Moonwell hit by $1.78M exploit as AI vibe coding debate reaches DeFi",
        "link": "https://cointelegraph.com/news/moonwell-exploit-cbeth-oracle-misprice-ai-commits-testing-audits?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Wed, 18 Feb 2026 13:04:46 +0000",
        "source": "Cointelegraph.com News",
        "text": "Moonwell, a decentralized finance (DeFi) lending protocol deployed on Base and Optimism, was exploited for about $1.78 million after a pricing oracle for Coinbase Wrapped Staked ETH (cbETH) returned a value of about $1.12 instead of $2,200, creating a mispricing that attackers were able to use for profit.\n\nMoonwell said in an incident post-mortem that a governance proposal executed on Sunday misconfigured the cbETH oracle by using the cbETH/ETH exchange rate alone, causing the system to report cbETH at about $1.12. The protocol said liquidation bots and opportunistic borrowers exploited the mispricing, leaving roughly $1.78 million in bad debt.\n\nThe pull requests for the affected contracts show multiple commits co-authored by Anthropic’s Claude Opus 4.6, prompting security auditor Pashov to publicly flag the incident as an example of artificial intelligence-written or AI-assisted Solidity backfiring.\n\nSpeaking to Cointelegraph about the incident, he said that he had linked the case to Claude because there were multiple commits in the pull requests that were co-authored by Claude, meaning that “the developer was using Claude to write the code, and this has led to the vulnerability.”\n\nPashov cautioned, however, against treating the flaw as uniquely AI-driven. He described the oracle issue as the kind of mistake “even a senior Solidity developer could have made,” arguing that the real problem was a lack of sufficiently rigorous checks and end-to-end validation.\n\nVulnerable code led to Moonwell exploit. Source: Pashov\n\nInitially, he said that he believed there had been no testing or audit at all, but later acknowledged that the team said it had unit and integration tests in a separate pull request and had commissioned an audit from Halborn.\n\nIn his view, the mispricing “could have been caught with an integration test, a proper one, integrating with the blockchain,” but he declined to criticise other security firms directly.\n\nRelated: How South Korea is using AI to detec"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-18T14:08:38.605892+00:00"
  }
}