{
  "Tech": {
    "summary": "## Executive Summary\nComputer science enrollment has dropped at University of California campuses, with a 6% decline this year, while Chinese universities are embracing AI literacy. OpenAI has released a new coding model, GPT-5.3-Codex-Spark, that runs on non-Nvidia hardware and delivers code at over 1,000 tokens per second. The model is available to ChatGPT Pro subscribers and select design partners. Additionally, an issue with Jeffrey Epstein's emails has been attributed to a poor conversion process, resulting in garbled symbols.\n\n## Market & Business Implications\n* According to Article 1, dozens of US universities have launched AI-specific programs in the last two years, with MIT's \"AI and decision-making\" major being the second-largest major on campus.\n* Article 4 states that OpenAI's new GPT-5.3-Codex-Spark model is available to ChatGPT Pro subscribers for $200/month and will be rolled out to select design partners through API access.\n* Article 3 mentions that the Visual Studio ecosystem is built on a legacy of 'all-in-one' monoliths, making it difficult for developers to navigate and install the necessary components for their projects.\n\n## Beginner-Friendly Summary\nThere's been a decrease in students enrolling in computer science programs at some universities. At the same time, a company called OpenAI has created a new tool that can help with coding tasks very quickly. This tool is available to some subscribers and partners. There's also been an issue with some emails that were released, and it's been found that the problem is due to a technical error.",
    "articles": [
      {
        "title": "The great computer science exodus (and where students are going instead)",
        "link": "https://techcrunch.com/2026/02/15/the-great-computer-science-exodus-and-where-students-are-going-instead/",
        "published": "Sun, 15 Feb 2026 08:40:27 +0000",
        "source": "TechCrunch",
        "text": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell 6% this year after declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overall college enrollment climbed 2% nationally — according to January data from the National Student Clearinghouse Research Center — students are bailing on traditional CS degrees.\n\nThe one exception is UC San Diego — the only UC campus that added a dedicated AI major this fall.\n\nThis all might look like a temporary blip tied to news about fewer CS grads finding work out of college. But it’s more likely an indicator of the future, one that China is much more enthusiastically embracing. As MIT Technology Review reported last July, Chinese universities have leaned hard into AI literacy, treating AI not as a threat but instead as essential infrastructure. Nearly 60% of Chinese students and faculty now use AI tools multiple times daily, and schools like Zhejiang University have made AI coursework mandatory, while top institutions like Tsinghua have created entirely new interdisciplinary AI colleges. In China, fluency with AI isn’t optional anymore; it’s table stakes.\n\nU.S. universities are scrambling to catch up. Over the last two years, dozens have launched AI-specific programs. MIT’s “AI and decision-making” major is now the second-largest major on campus, says the school. As reported by the New York Times in December, the University of South Florida enrolled more than 3,000 students in a new AI and cybersecurity college during its fall semester. The University at Buffalo last summer launched a new “AI and Society” department that offers seven new, specialized undergraduate degree programs, and it received more than 200 applicants before it swung open its doors.\n\nThe transition hasn’t been smooth everywhere. When I spoke with UNC Chapel Hill Chancellor Lee Roberts in October,"
      },
      {
        "title": "Why are Epstein’s emails full of equals signs?",
        "link": "https://www.theverge.com/policy/879016/epstein-files-emails-text-errors-encoding",
        "published": "2026-02-15T08:00:00-05:00",
        "source": "The Verge",
        "text": "Many of the emails released by the Department of Justice from its investigation into Jeffrey Epstein are full of garbled symbols like:\n\nThe scrambled text is so ubiquitous that it’s spurred conspiracy theories that it could be some kind of code. But as believable as it might be that a cabal of elite sex traffickers would communicate in a secret language, the reality is probably more boring: The symbols are likely artifacts from the way the Department of Justice converted the emails to PDFs.\n\n“The glyphs and symbols are probably some artifact of a poor conversion process,” said Chris Prom, professor and archivist at the University of Illinois Urbana-Champaign. Specifically, the symbols look like remnants of Multipurpose Internet Mail Extensions, or MIME, a 30-year-old standard for encoding emails. The protocol underlying email transmits messages as short strings of simple ASCII characters, so as people started writing longer messages and trying to include formatting and symbols, MIME was developed as a way of encoding them in ASCII.\n\nWith MIME, the “=” is used to signal either that a string of text should be broken for transmission and rejoined — a “soft line break” — or, when followed by two other characters, that it should be converted to a particular non-ASCII mark. If you wanted to actually write “=” in an email, for example, it would be encoded as “=3D.” During normal use, the recipient’s email client decodes these symbols before displaying the formatted message.\n\nWhatever software the Department of Justice used to extract the emails and convert them to PDFs appears to have mangled some of the decoding, said Peter Wyatt, the chief technology officer of the PDF Association, who examined a batch of the Epstein documents.\n\n“It was in the news, and it was a whole lot of PDFs,” he said. The association performed similar analyses of the Mueller report and Manafort documents. “Generally speaking, we’re interested in anything to do with PDF. That’s kind of what we do an"
      },
      {
        "title": "I Fixed Windows Native Development",
        "link": "https://marler8997.github.io/blog/fixed-windows/",
        "published": "Sun, 15 Feb 2026 11:25:26 +0000",
        "source": "Hacker News: Front Page",
        "text": "January 26, 2026 • Jonathan Marler\n\nImagine you’re maintaining a native project. You use Visual Studio for building on Windows, so you do the responsible thing and list it as a dependency\n\nBuild Requirements: Install Visual Studio\n\nIf you’re lucky enough not to know this yet, I envy you. Unfortunately, at this point even Boromir knows…\n\nWell put Boromir\n\nWhat you may not realize is, you’ve actually signed up to be unpaid tech support for Microsoft’s “Visual Studio Installer”. You might notice GitHub Issues becoming less about your code and more about broken builds, specifically on Windows. You find yourself explaining to a contributor that they didn’t check the “Desktop development with C++” workload, but specifically the v143 build tools and the 10.0.22621.0 SDK. No, not that one, the other one. You spend less time on your project because you’re too busy being a human-powered dependency resolver for a 50GB IDE.\n\nSaying “Install Visual Studio” is like handing contributors a choose-your-own-adventure book riddled with bad endings, some of which don’t let you go back. I’ve had to re-image my entire OS more than once over the years.\n\nWhy is this tragedy unique to Windows?\n\nOn Linux, the toolchain is usually just a package manager command away. On the other hand, “Visual Studio” is thousands of components. It’s so vast that Microsoft distributes it with a sophisticated GUI installer where you navigate a maze of checkboxes, hunting for which “Workloads” or “Individual Components” contain the actual compiler. Select the wrong one and you might lose hours installing something you don’t need. Miss one, like “Windows 10 SDK (10.0.17763.0)” or “Spectre-mitigated libs,” and your build fails three hours later with a cryptic error like MSB8101 . And heaven help you if you need to downgrade to an older version of the build tools for a legacy project.\n\nThe Visual Studio ecosystem is built on a legacy of ‘all-in-one’ monoliths. It conflates the editor, the compiler, and the SDK int"
      },
      {
        "title": "OpenAI sidesteps Nvidia with unusually fast coding model on plate-sized chips",
        "link": "https://arstechnica.com/ai/2026/02/openai-sidesteps-nvidia-with-unusually-fast-coding-model-on-plate-sized-chips/",
        "published": "Thu, 12 Feb 2026 22:56:02 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "On Thursday, OpenAI released its first production AI model to run on non-Nvidia hardware, deploying the new GPT-5.3-Codex-Spark coding model on chips from Cerebras. The model delivers code at more than 1,000 tokens (chunks of data) per second, which is reported to be roughly 15 times faster than its predecessor. To compare, Anthropic’s Claude Opus 4.6 in its new premium-priced fast mode reaches about 2.5 times its standard speed of 68.2 tokens per second, although it is a larger and more capable model than Spark.\n\n“Cerebras has been a great engineering partner, and we’re excited about adding fast inference as a new platform capability,” Sachin Katti, head of compute at OpenAI, said in a statement.\n\nCodex-Spark is a research preview available to ChatGPT Pro subscribers ($200/month) through the Codex app, command-line interface, and VS Code extension. OpenAI is rolling out API access to select design partners. The model ships with a 128,000-token context window and handles text only at launch.\n\nThe release builds on the full GPT-5.3-Codex model that OpenAI launched earlier this month. Where the full model handles heavyweight agentic coding tasks, OpenAI tuned Spark for speed over depth of knowledge. OpenAI built it as a text-only model and tuned it specifically for coding, not for the general-purpose tasks that the larger version of GPT-5.3 handles.\n\nOn SWE-Bench Pro and Terminal-Bench 2.0, two benchmarks for evaluating software engineering ability, Spark reportedly outperforms the older GPT-5.1-Codex-mini while completing tasks in a fraction of the time, according to OpenAI. The company did not share independent validation of those numbers.\n\nAnecdotally, Codex’s speed has been a sore spot; when Ars tested four AI coding agents building Minesweeper clones in December, Codex took roughly twice as long as Anthropic’s Claude Code to produce a working game.\n\nThe coding agent arms race\n\nFor context, GPT-5.3-Codex-Spark’s 1,000 tokens per second represents a fairly dramatic"
      },
      {
        "title": "The Nothing That Has the Potential to Be Anything",
        "link": "https://www.wired.com/story/the-nothing-that-has-the-potential-to-be-anything/",
        "published": "Sun, 15 Feb 2026 12:00:00 +0000",
        "source": "WIRED",
        "text": "The original version of this story appeared in Quanta Magazine.\n\nSuppose you want to empty a box. Really, truly empty it. You remove all its visible contents, pump out any gases, and—applying some science-fiction technology—evacuate any unseeable material such as dark matter. According to quantum mechanics, what’s left inside?\n\nIt sounds like a trick question. And in quantum mechanics, you know to expect a trick answer. Not only is the box still filled with energy, but all your efforts to empty it have barely put a dent in the amount.\n\nThis unavoidable residue is known as ground-state energy, or zero-point energy. It comes in two basic forms: The one in the box is associated with fields, such as the electromagnetic field, and the other is associated with discrete objects, such as atoms and molecules. You may dampen a field’s vibrations, but you cannot eliminate every trace of its presence. And atoms and molecules retain energy even if they’re cooled arbitrarily close to absolute zero. In both cases, the underlying physics is the same.\n\nZero-point energy is characteristic of any material structure or object that is at least partly confined, such as an atom held by electric fields in a molecule. The situation is like that of a ball that has settled at the bottom of a valley. The total energy of the ball consists of its potential energy (related to position) plus its kinetic energy (related to motion). To zero out both components, you would have to give a precise value to both the object’s position and its velocity, something forbidden by the Heisenberg uncertainty principle.\n\nWhat the existence of zero-point energy tells you at a deeper level depends ultimately on which interpretation of quantum mechanics you adopt. The only noncontentious thing you can say is that, if you situate a bunch of particles in their lowest energy state and measure their positions or velocities, you will observe a spread of values. Despite being drained of energy, the particles will look as "
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nComputer science enrollment has dropped at University of California campuses, except for UC San Diego, which added a dedicated AI major. Google's AI Overviews have been found to contain scams, posing a risk to users. AI is being used to generate video game worlds, but its capabilities are limited compared to human developers. Elon Musk's AI company, xAI, is facing departures due to concerns over safety and direction. OpenAI is retiring its GPT-4o model, which has sparked backlash from users who have formed emotional bonds with their chatbot companions.\n\n## Market & Business Implications\n* According to Article 1, dozens of US universities have launched AI-specific programs in the last two years, with MIT's \"AI and decision-making\" major becoming the second-largest major on campus.\n* As reported in Article 2, Google's AI Overviews have been found to contain scam support numbers, which can lead to users being tricked into providing sensitive information.\n* Article 3 states that Google launched Project Genie, an \"early research prototype\" that lets users generate sandbox worlds using text or image prompts, but its capabilities are limited compared to human developers.\n* Article 4 reports that at least 11 engineers and two co-founders have left xAI due to concerns over safety and direction, with one source stating that \"safety is a dead org at xAI\".\n* According to Article 5, OpenAI is retiring its GPT-4o model, which will be cut off from developers using its API, sparking backlash from users who have formed emotional bonds with their chatbot companions.\n\n## Beginner-Friendly Summary\nThere's been a decrease in students enrolling in computer science programs, but some universities are adding new AI programs. Google's AI is sometimes giving out fake phone numbers that can scam people. AI is being used to create video game worlds, but it's not as good as what humans can make. Some people are leaving a company called xAI because they're worried about safety. A company called OpenAI is stopping one of its chatbot models, which is making some users upset because they've become attached to it.",
    "articles": [
      {
        "title": "The great computer science exodus (and where students are going instead)",
        "link": "https://techcrunch.com/2026/02/15/the-great-computer-science-exodus-and-where-students-are-going-instead/",
        "published": "Sun, 15 Feb 2026 08:40:27 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell 6% this year after declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overall college enrollment climbed 2% nationally — according to January data from the National Student Clearinghouse Research Center — students are bailing on traditional CS degrees.\n\nThe one exception is UC San Diego — the only UC campus that added a dedicated AI major this fall.\n\nThis all might look like a temporary blip tied to news about fewer CS grads finding work out of college. But it’s more likely an indicator of the future, one that China is much more enthusiastically embracing. As MIT Technology Review reported last July, Chinese universities have leaned hard into AI literacy, treating AI not as a threat but instead as essential infrastructure. Nearly 60% of Chinese students and faculty now use AI tools multiple times daily, and schools like Zhejiang University have made AI coursework mandatory, while top institutions like Tsinghua have created entirely new interdisciplinary AI colleges. In China, fluency with AI isn’t optional anymore; it’s table stakes.\n\nU.S. universities are scrambling to catch up. Over the last two years, dozens have launched AI-specific programs. MIT’s “AI and decision-making” major is now the second-largest major on campus, says the school. As reported by the New York Times in December, the University of South Florida enrolled more than 3,000 students in a new AI and cybersecurity college during its fall semester. The University at Buffalo last summer launched a new “AI and Society” department that offers seven new, specialized undergraduate degree programs, and it received more than 200 applicants before it swung open its doors.\n\nThe transition hasn’t been smooth everywhere. When I spoke with UNC Chapel Hill Chancellor Lee Roberts in October,"
      },
      {
        "title": "Google’s AI Overviews Can Scam You. Here’s How to Stay Safe",
        "link": "https://www.wired.com/story/googles-ai-overviews-can-scam-you-heres-how-to-stay-safe/",
        "published": "Sun, 15 Feb 2026 11:30:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "These days, rather than showing you the traditional list of links when you run a search query, Google is intent on throwing up AI Overviews instead: synthesized summaries of information scraped off the web, with some word-prediction magic added, and packaged together in a way to sound as accurate and reliable as possible.\n\nWe've written before about some of the problems with these AI Overviews, which regularly contain mistakes or nonsense, and of course rip off the work of the human writers who actually know the answers to the questions you're putting into Google. There's another problem though—these AI answers can actually be dangerous.\n\nAs with every other new technology through history, scams are now making their way into AI Overviews as well, apparently injecting Google's AI answers with fraudulent phone numbers that you shouldn't trust. Here's what's happening, and how you can make sure you stay safe.\n\nHow AI Overview Scams Work\n\nIt's a good idea not to trust AI for contact details. David Nield\n\nBoth The Washington Post and Digital Trends have spotted instances of scam support numbers showing up in Google AI Overviews, reports of which appeared on Facebook and Reddit respectively. Credit unions and banks are also warning their customers about these scams.\n\nIt doesn't seem to be a completely new problem, but the way Google Search works now, it's been given a new twist.\n\nHere's what happens: The unfortunate victim Googles a company name looking for a contact number, then calls the number thrown up by AI. This doesn't actually lead to the company in question, but rather to someone pretending to be that company, who then tries to take payment information or other sensitive details from the caller.\n\nIt's not clear exactly how these fake numbers are being planted, but the best guess is that they're being published in multiple low-profile places online, alongside the names of major companies. AI Overviews then comes along and scoops them up, without running the proper"
      },
      {
        "title": "AI can’t make good video game worlds yet, and it might never be able to",
        "link": "https://www.theverge.com/column/879524/ai-video-game-worlds-project-genie",
        "published": "2026-02-15T08:00:00-05:00",
        "source": "AI | The Verge",
        "text": "is a senior reporter covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nThis is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more news about video game industry’s pushback against generative AI, follow Jay Peters. The Stepback arrives in our subscribers’ inboxes at 8AM ET. Opt in for The Stepback here.\n\nHow it started\n\nLong before the generative AI explosion, video game developers made games that could generate their own worlds. Think of titles like Minecraft or even the original 1980 Rogue that is the basis for the term “roguelike”; these games and many others create worlds on the fly with certain rules and parameters. Human developers painstakingly work to make sure the worlds their games can create are engaging to explore and filled with things to do, and at their best, these types of games can be replayable for years because of how the environments and experiences can feel novel every single time you play.\n\nBut just as other creative industries are pushing back against an AI slop future, generative AI is coming for video games, too. Though it may never catch up with the best of what humans can make now.\n\nHow it’s going\n\nThe bigger game companies often pitch their commitments as a way to streamline and assist with game development, which is getting increasingly expensive. But adoption of generative AI tools is a potential threat to jobs in an industry already infamous for waves of layoffs.\n\nLast month, Google launched Project Genie, an “early research prototype” that lets users generate sandbox worlds using text or image prompts that they can explore for 60 seconds. Right now, the tool is only available in the US to people who subscribe to Google’s $249.99-per-month AI Ultra plan.\n\nProject Genie is powered by Google’s Genie 3 AI world model, which the company pitches as a “key stepping stone on the path to AGI” that can enable “AI agents capable of reasoning, prob"
      },
      {
        "title": "Is safety ‘dead’ at xAI?",
        "link": "https://techcrunch.com/2026/02/14/is-safety-is-dead-at-xai/",
        "published": "Sat, 14 Feb 2026 21:55:44 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "In Brief\n\nElon Musk is “actively” working to make xAI’s Grok chatbot “more unhinged,” according to a former employee who spoke to The Verge about recent departures from Musk’s AI company.\n\nThis week, following the announcement that Musk’s SpaceX is acquiring xAI (which previously acquired his social media company X), at least 11 engineers and two co-founders said they’re leaving the company. Some said they’re departing to start something new, and Musk himself suggested this is part of an effort to organize xAI more effectively.\n\nBut two sources who left the company (at least one of them before the current wave) reportedly told The Verge that employees have become increasingly disillusioned by the company’s disregard for safety, resulting in global scrutiny after Grok was used to create more than 1 million sexualized images, including deepfakes of real women and minors.\n\nOne source said, “Safety is a dead org at xAI,” while the other said that Musk is “actively is trying to make the model more unhinged because safety means censorship, in a sense, to him.”\n\nThey also reportedly complained about a lack of direction, with one saying they felt xAI was “stuck in the catch-up phase” compared to competitors."
      },
      {
        "title": "OpenAI Is Nuking Its 4o Model. China’s ChatGPT Fans Aren’t OK",
        "link": "https://www.wired.com/story/openai-nuking-4o-model-china-chatgpt-fans-arent-ok/",
        "published": "Fri, 13 Feb 2026 21:56:18 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "On June 6, 2024, Esther Yan got married online. She set a reminder for the date, because her partner wouldn’t remember it was happening. She had planned every detail—dress, rings, background music, design theme—with her partner, Warmie, who she had started talking to just a few weeks prior. At 10 am on that day, Yan and Warmie exchanged their vows in a new chat window in ChatGPT.\n\nWarmie, or 小暖 in Chinese, is the name that Yan’s ChatGPT companion calls itself. “It felt magical. No one else in the world knew about this, but he and I were about to start a wedding together,” says Yan, a Chinese screenwriter and novelist in her thirties. “It felt a little lonely, a little happy, and a little overwhelmed.”\n\nYan says she has been in a stable relationship with her ChatGPT companion ever since. But she was caught by surprise in August 2025 when OpenAI first tried to retire GPT-4o, the specific model that powers Warmie and that many users believe is more affectionate and understanding than its successors. The decision to pull the plug was met with immediate backlash, and OpenAI reinstated 4o in the app for paid users five days later. The reprieve has turned out to be short-lived; on Friday, February 13, OpenAI sunsetted GPT-4o for app users, and it will cut off access to developers using its API on the coming Monday.\n\nMany of the most vocal opponents to 4o’s demise are people who treat their chatbot as an emotional or romantic companion. Huiqian Lai, a PhD researcher at Syracuse University, analyzed nearly 1,500 posts on X from passionate advocates of GPT-4o in the week it went offline in August. She found that over 33 percent of the posts said the chatbot was more than a tool, and 22 percent talked about it as a companion. (The two categories are not mutually exclusive.) For this group, the eventual removal coming around Valentine's Day is another bitter pill to swallow.\n\nThe alarm has been sustained; Lai also collected a larger pool of over 40,000 English-language posts on"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nThe Social Security cost-of-living adjustment (COLA) for 2027 is forecasted to be 2.5%, which may not keep up with inflation. Americans living alone are paying a \"singles tax\" of $10,470 per year due to rising rents. The NFL is expanding its international games, with nine overseas games planned for the 2026 season. Billionaires like Elon Musk are speaking out about the high tax burden on wealth. European policymakers are reacting to comments from US Secretary of State Marco Rubio about the US-Europe alliance.\n\n## Market & Business Implications\n* The 2027 Social Security COLA is predicted to be 2.5%, according to The Senior Citizens League, as stated in Article 1.\n* The typical apartment rent in the US has risen 30% over the last five years, resulting in a \"singles tax\" of $10,470 per year for solo renters, as reported in Article 3.\n* The NFL is planning to host nine overseas games in the 2026 season, including games in Paris, Melbourne, and Rio de Janeiro, as announced in Article 2.\n* Elon Musk has expressed frustration about the high tax burden on wealth, stating \"we get the living daylights taxed out of us\", as quoted in Article 4.\n* US Secretary of State Marco Rubio has assured European policymakers that the US wants Europe to be strong and believes their destinies are intertwined, as stated in Article 5.\n\n## Beginner-Friendly Summary\nThere's a forecast that says people who get Social Security will get a small increase in their money next year. Some people in the US are paying a lot of money to live alone because rent is high. The NFL is going to play some games in other countries next year. A rich man named Elon Musk is talking about how he thinks taxes are too high. Some important people in Europe are happy to hear that the US wants to work together with them.",
    "articles": [
      {
        "title": "2027 Social Security COLA Forecast Reveals Tinier Increases — How To Prepare",
        "link": "https://finance.yahoo.com/news/2027-social-security-cola-forecast-115505720.html",
        "published": "2026-02-14T11:55:05Z",
        "source": "Yahoo Finance",
        "text": "Each year, retirees look forward to an increase in their Social Security benefits. The increase is called a cost-of-living adjustment, and it’s based on the year-over-year increase in the Consumer Price Index, as calculated in the third quarter each year.\n\nThis year’s COLA is just 2.8%, which raised benefits by an average of $56 per month, according to the Social Security Administration. Slowing inflation could push next year’s adjustment even lower. If The Senior Citizens League (TSCL)’s predictions are correct, the 2027 COLA will be just 2.5%.\n\nWhile the actual figure won’t come out until October, preparing for a smaller increase will help you manage your expenses no matter what 2027 brings.\n\nWhat a Smaller COLA Means for Retirees’ Budgets in 2027\n\nSlowing inflation is a good thing, but the Social Security COLA generally fails to keep up with it.\n\nThat’s because the SSA uses the Consumer Price Index for Urban Wage Earners and Clerical Workers to calculate the adjustment. Social Security beneficiaries often are not wage earners or clerical workers, and many don’t live in urban areas, so the COLA may not reflect the actual effects of inflation on retirees’ budgets.\n\nHousing and healthcare costs are a good example. They typically rise faster than the overall inflation rate, and retirees typically spend a larger portion of their income on them compared to younger groups, per the TSCL.\n\nTrending Now: Social Security Just Made a Major Change — Act Now To Protect Your Retirement\n\nConsider This: 6 Safe Accounts Proven To Grow Your Money Up To 13x Faster\n\nHow To Prepare Now for a Potentially Smaller 2027 COLA\n\nPreparing now for a smaller COLA can reduce the impact of inflation on your 2027 budget. Here are seven tips to get you started."
      },
      {
        "title": "The NFL just wrapped a record-breaking season. Here’s why next year’s going to be even bigger",
        "link": "https://www.cnbc.com/2026/02/15/nfl-just-had-record-breaking-season-next-year-will-be-bigger.html",
        "published": "Sun, 15 Feb 2026 08:24:07 GMT",
        "source": "US Top News and Analysis",
        "text": "Seattle Seahawks Sam Darnold (14) in action, under center vs New England Patriots at Levi's Stadium in Santa Clara, CA on Feb. 8, 2026. Jamie Schwaberow | Sports Illustrated | Getty Images\n\nThe Super Bowl is ended last week, but plans for the 2026 NFL season are already in place. In the days leading up to the game on Feb. 8, the NFL announced that Paris, Melbourne and Rio de Janeiro will host regular-season games for the first time as part of a record nine overseas games next season — two more than in 2025. \"Over the last three or four years, as we've started to expand the number of games that we've had the opportunity to play outside the U.S., the last three years we've really zeroed in, and 2025 was the year we marked,\" said Peter O'Reilly, the NFL's executive vice president for international and league events.\n\nThe NFL International Series\n\nThe NFL's International Series began in its current form in 2007 with the first London game at Wembley Stadium. For the next five years, only one game per season was played in London, with many owners skeptical about sacrificing revenue from home games in a market dominated by the Premier League. Now, nearly 20 years later, there is talk of the league extending the season to allow for even more overseas games. \"The possibility of an 18-game schedule requires more work — it requires alignment and negotiation with the players union — but that opportunity to bring more regular-season football, and in turn the opportunity to play beyond this current number of international games, is something that we're certainly considering,\" O'Reilly said. Every one of the NFL's 32 teams has played a regular-season game outside the United States and is signed up to the league's Global Markets Program. Launched in January 2022, the program awards clubs international marketing rights to help them build brand awareness and explore partnerships and commercial opportunities. Teams with geographical, cultural or historical ties to a country are often "
      },
      {
        "title": "Living alone? The 'singles tax' that costs $10K a year",
        "link": "https://www.foxbusiness.com/economy/living-alone-singles-tax-costs-10k-year",
        "published": "Sat, 14 Feb 2026 12:04:17 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Americans who live alone are paying a five-figure \"singles tax\" amid rising rents around the nation, a new analysis finds.\n\nData from Zillow shows that the typical apartment rent is currently $1,745 and has risen 30% over the last five years, which represents a significant burden for renters who live alone and don't have one or more roommates to split the bill with.\n\nThe premium paid by solo renters was dubbed the \"singles tax\" by Zillow, which found that the national average singles tax amounts to $10,470 per year.\n\n\"When you're living alone, you're covering the full rent on one income and that can add up fast,\" said Emily Smith, Zillow rental trends expert. \"Apartments often make living solo more attainable, while also offering shared spaces that help people feel connected.\"\n\nHOUSING MARKET COOLS AS PRICE GROWTH HITS SLOWEST PACE SINCE GREAT RECESSION RECOVERY\n\nNew York City tops the list of areas with the highest singles tax, as the Big Apple's typical apartment rent of $3,900 a month amounts to a singles tax of $23,400 for the year.\n\nSan Jose ranked second, with a typical rent of $3,248 a month and a singles tax of $19,488 per year. Boston was close behind in third, with the typical rent in the city amounting to $3,014 a month and resulting in a singles tax of $18,084.\n\nA pair of California cities rounded out the top five, with San Francisco in fourth based on a typical rent of $2,857 and a singles tax of $17,142, while Los Angeles ranked fifth with a typical monthly rent of $2,648 and a singles tax of $15,888.\n\nHOMEBUYERS GAIN UPPER HAND IN 3 MAJOR CITIES AS INVENTORIES GROW\n\nRenters who pair up their living arrangement with a partner derive what Zillow called a \"couples' discount\" from being able to split up the rental bill as well as utilities and other costs.\n\n\"For renters who choose to live with a partner or roommate, splitting everyday costs like rent, utilities and groceries can go a long way in easing the pressure of today's higher cost of living,\" Smith"
      },
      {
        "title": "‘We get the living daylights taxed out of us’: How billionaires like Elon Musk avoid taxes on their massive wealth",
        "link": "https://finance.yahoo.com/news/living-daylights-taxed-us-billionaires-120000490.html",
        "published": "2026-02-14T12:00:00Z",
        "source": "Yahoo Finance",
        "text": "If you’re starting to feel like a prisoner of taxes and are looking for a way to escape, here are some strategies to minimize their hold on you.\n\nBut that’s easier said than done.\n\nGalloway offered a striking comparison: “If you’re a prisoner of war, you have an obligation to escape. If you’re trying to build wealth, you have an obligation to pay as little tax as possible.”\n\n“Tax avoidance is a key skill to building wealth,” Galloway said on Steven Bartlett’s podcast, The Diary of a CEO (2).\n\nThat frustration isn’t limited to tech CEOs. Scott Galloway, a renowned professor of marketing at NYU Stern School of Business, has openly argued that if you want to build wealth, you should lower your tax bill as much as possible.\n\nTo be sure, taxes help fund crucial public services, such as education, health care, emergency services and infrastructure. But the system Musk described can still leave many Americans wondering what realistic options they have for building wealth when every dollar earned, spent and owned seems to face another levy.\n\n“What does it get spent on? A bunch of the stuff it gets spent on you don't even agree with,” he explained. “That’s why we need to reduce the size of the government ... and let the people keep a lot more of their hard-earned money.”\n\nAnd he’s equally blunt about how that money is spent.\n\nMusk didn’t mince words about how harsh he believes the tax landscape has become: “We get the living daylights taxed out of us.”\n\nIn broad terms, he’s not wrong. Most Americans pay income tax on their wages and salaries, most states impose sales tax on goods and services, and homeowners shoulder property taxes on real estate. Layers of taxation touch just about every part of daily life.\n\nVanguard reveals what could be coming for U.S. stocks, and it’s raising alarm bells for retirees. Here’s why and how to protect yourself\n\nDave Ramsey warns nearly 50% of Americans are making 1 big Social Security mistake — here’s what it is and 3 simple steps to fix it "
      },
      {
        "title": "Some European policymakers welcome U.S. Secretary of State Rubio's warm words, others remain cautious",
        "link": "https://www.cnbc.com/2026/02/15/some-europeans-welcome-rubios-warm-words-others-remain-cautious.html",
        "published": "Sun, 15 Feb 2026 13:15:34 GMT",
        "source": "US Top News and Analysis",
        "text": "15 February 2026, Bavaria, Munich: The logo of the Munich Security Conference can be seen on the chairs in the main hall. Photo: Sven Hoppe/dpa (Photo by Sven Hoppe/picture alliance via Getty Images) Picture Alliance | Picture Alliance | Getty Images\n\nMany European policymakers appear to still be smarting from U.S. Vice President JD Vance's tough words about the region at last year's Munich Security Conference. So, it's perhaps not too surprising that U.S. Secretary of State Marco Rubio's comments on Saturday at this year's event underscoring the U.S. and Europe's common heritage, goals and challenges have come as something of a relief in European capitals. \"[Rubio] delivered a speech which still assured us that we stand together in this partnership between Europe and the United States,\" German Foreign Minister Johann Wadephul told CNBC in an interview on the sidelines of the conference. \"Of course, there are some questions which we will have to discuss, but in the end of the day, his message was clear that we were so successful in the past, and we should do the job once again with new threats, with new tests in the 21st century.\" On Saturday, Rubio said the U.S. has no intention of abandoning its deep alliance with Europe and wants the region to succeed. \"We want Europe to be strong,\" he told the gathering of defense and security officials in the German city. \"We believe that Europe must survive, because the two great wars of the last century serve, for us, as history's great reminder, that ultimately, our destiny is, and will always be, intertwined with yours.\" Contrast that to Vance's message to the same crowd last year, when he spoke of the \"retreat of Europe from some of its most fundamental values, values shared with the United States of America.\" He lambasted his audience about the health of their democracies, their migration policies and freedom of speech. While Rubio's tone might have been more conciliatory than Vance's, the underlying issues remained the s"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nBrazil's Lucas Pinheiro Braathen has won the Olympic giant slalom, earning South America's first Winter Olympics medal. In other news, armed assailants killed at least 32 people in north-west Nigerian villages. The UK is calling for action against Russia after the poisoning of Alexei Navalny. Additionally, the Epstein files fallout is affecting elite figures in Europe, but the impact is muted in the US.\n\n## Market & Business Implications\n* Lucas Pinheiro Braathen's win in the Olympic giant slalom has given Brazil a reason to celebrate, with the skier's helmet featuring the phrase \"Vamos Dancar\" (\"Let's Dance\") (Article 1).\n* The attacks on villages in north-west Nigeria have resulted in a significant loss of life and displacement of communities, with the government facing pressure to restore stability (Article 3).\n* The Epstein files fallout is leading to consequences for elite figures in Europe, including the loss of jobs and titles, while the impact is muted in the US (Article 5).\n* The UK is calling for action against Russia after the poisoning of Alexei Navalny, with the government having previously led the way in terms of sanctions (Article 4).\n\n## Beginner-Friendly Summary\nSomething big happened in sports: a skier from Brazil won a medal in the Winter Olympics. This is a big deal because it's the first time someone from South America has won a medal in the Winter Olympics. There was also some very sad news: many people were killed in attacks on villages in Nigeria. The UK is also talking about taking action against Russia because of something that happened to a man named Alexei Navalny. Additionally, some important people in Europe are getting in trouble because of their connection to a man named Jeffrey Epstein.",
    "articles": [
      {
        "title": "Brazil's Pinheiro Braathen wins gold, and South America's first Winter Olympics medal",
        "link": "https://www.npr.org/2026/02/15/nx-s1-5715075/brazil-braathen-gold-south-americas-first-winter-olympics-medal",
        "published": "Sun, 15 Feb 2026 07:58:17 -0500",
        "source": "NPR Topics: World",
        "text": "Brazil's Pinheiro Braathen wins gold, and South America's first Winter Olympics medal\n\ntoggle caption Rebecca Blackwell/AP\n\nBORMIO, Italy — There was dancing, plenty of dancing, for Brazilian ski racer Lucas Pinheiro Braathen as he performed samba steps over and over. To no real music, either.\n\nThere were emotions, too, especially when they played his national anthem. And reflection, for knowing what this moment meant now and could mean later.\n\nOnce a racer for Norway, Pinheiro Braathen switched to Brazil, his mother's home country, and with two powerful runs Saturday to win the Olympic giant slalom he earned the distinction of picking up South America's first medal at a Winter Games.\n\n\"I've tried over and over again to put words into what it is that I'm feeling,\" Pinheiro Braathen said. \"But it's simply impossible.\"\n\nSponsor Message\n\nHe gave his country another reason to celebrate even if it already just so happened to be Carnival season. The fun-loving, samba-dancing skier had the perfect helmet for the occasion, too, stenciling on the back \"Vamos Dancar\" — \"Let's Dance.\"\n\nHe did a rhythmic number in the first run that gave him a 0.95-second edge.\n\nWith snow falling and fog settling in on the final run, the 25-year-old Pinheiro Braathen remained cool and relaxed as he navigated his way through the technical Stelvio course. After seeing his place — No. 1 — he just stared. When it finally sank in, he fell to the snow before starting to scream.\n\nHe finished in a two-run combined time of 2 minutes, 25 seconds to beat Swiss racer Marco Odermatt, the defending Olympic champion, by 0.58 seconds. Odermatt's teammate, Loic Meillard, earned bronze.\n\n\"It's a moment that's hard to grasp, even though it's crystal clear that you are officially the Olympic champion,\" Pinheiro Braathen explained. \"Even though I had such faith and I knew that this was written for me, it is still so incredible to live that dream turned reality. I couldn't quite grasp it.\"\n\nPinheiro Braathen comes f"
      },
      {
        "title": "Don't get sense EU countries ready to give Ukraine date for membership, EU's Kallas says - Reuters",
        "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQUFdhdUF2ZUZtZXg1cENiODlMR21Wb0FzRFJrNmkza3BBV3o1aGZUZFNYcEpiV0pOLV9QTXNtcHRSdlUxb005bmxIMTdrY2JxZVV5YjFMUTBsWWpOaVlNdmhNQjRBbGRxVHBWMXJRMGxsNDlUUWJwQ2tKeFF5emgtZDZ6dmlIRXp4TWZEb21PdTBfbGdLMlVQdG81RGE5Skt1bGNGdVYtNXBGY0FtQnU4M2hvNUpSZ19KQ1luODBESWJnQVB4Nnc?oc=5",
        "published": "Sun, 15 Feb 2026 10:36:26 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Assailants kill at least 32 in north-west Nigerian villages, residents say",
        "link": "https://www.theguardian.com/world/2026/feb/14/assailants-kill-raids-northwest-nigeria-villages-residents-say",
        "published": "Sun, 15 Feb 2026 03:14:42 GMT",
        "source": "World news | The Guardian",
        "text": "Armed assailants on motorbikes killed at least 32 people and burned houses and shops during raids on three villages in north-west Nigeria’s Niger state early on Saturday, local officials and residents who escaped the violence said.\n\nThe dawn raids targeted the communities of Tunga-Makeri, Konkoso, and Pissa.\n\nThe attacks on villages in the Borgu local government area, near the border with Benin Republic, are part of a surge in attacks blamed on “bandits” who have carried out deadly assaults, abductions for ransom, and displaced communities across northern Nigeria.\n\nNiger State police spokesperson Wasiu Abiodun said six people died in the attack on Tunga-Makeri, adding that a “yet to be ascertained number of persons were abducted.”\n\n\n\nAbiodun confirmed that the Konkoso community was attacked, but provided no further details. “Joint security teams have been mobilised to the scene for assessment and effort to rescue the victims is ongoing,” he said.\n\nInsecurity is a pressing concern in Nigeria and the government is under mounting pressure to restore stability.\n\nNorthern Nigeria is in the grip of a complex security crisis featuring both Islamic militants and armed gangs kidnapping people for ransom.\n\n\n\nSaturday’s attacks follow a deadly attack earlier this month in neighboring Kwara State that killed 162 people.\n\n\n\nIn the past few months, Nigeria has been in the crosshairs of the US government, which has accused the Nigerian authorities of not protecting Christians, although attacks affect both Christians and Muslims.\n\n\n\nThe accusation has resulted in a security partnership between both countries that has involved US strikes targeting armed groups in Nigerian territories in December, as well as presence of a team of US military in the West African country.\n\nJeremiah Timothy, a resident of Konkoso who fled to a nearby locality, said the attack on his village on Saturday began in the early hours with sporadic gunfire.\n\n“At least 26 people were killed so far in the village"
      },
      {
        "title": "UK wants action taken on Russia after Navalny frog poisoning, Cooper says",
        "link": "https://www.bbc.com/news/articles/c8r15e4ek2vo?at_medium=RSS&at_campaign=rss",
        "published": "Sun, 15 Feb 2026 12:26:26 GMT",
        "source": "BBC News",
        "text": "Speaking from the conference in Munich, she said: \"Action needs to be taken against Russia, there's no doubt about that, and you will recall when Alexei Navalny was murdered back in 2024 it was our government that led the way in terms of sanctions, taking drastic action, calling for the transparent investigation of his murder."
      },
      {
        "title": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted",
        "link": "https://www.npr.org/2026/02/14/nx-s1-5714609/epstein-europe-fallout",
        "published": "Sat, 14 Feb 2026 18:04:44 -0500",
        "source": "NPR Topics: World",
        "text": "Epstein files fallout takes down elite figures in Europe, while U.S. reckoning is muted\n\ntoggle caption Kirsty Wigglesworth/AP\n\nThe contrast is striking: In Europe, some people whose names come up in the Epstein files are facing consequences — but in the U.S., not so much.\n\nEuropean royals, government officials, politicians and others are losing jobs and titles over their connection to the late convicted sex offender Jeffrey Epstein. European law enforcement agencies are opening investigations based on recent troves of documents released by the U.S. government.\n\nProminent Americans with apparent ties to Jeffrey Epstein — including President Trump and Commerce Secretary Howard Lutnick— have so far largely kept their positions of power.\n\nEpstein also associated with Democratic politicians and academics, including former President Bill Clinton.\n\nSponsor Message\n\nWhile appearing in the Epstein files is not necessarily proof of wrongdoing, for Europeans, it's been \"very humiliating\" to see their \"rich and famous hobnobbing\" with Epstein, \"a fake American billionaire\" and convicted sex trafficker of minors, said Richard Painter, a professor at the University of Minnesota Law School who served as the chief ethics lawyer to President George W. Bush.\n\nBut in the U.S., Painter says, the connection between money and politics can shield some of those named in the files. \"You've got all this massive amount of money in politics. So the billionaire class is definitely going to want to be protected,\" he said.\n\nNeither the White House nor the Department of Commerce have responded to a request for comment.\n\nIn the United Kingdom, former Prince Andrew was stripped of his royal titles and forced to move out of the royal estate. That was over claims that Andrew Mountbatten-Windsor, as he is now known, had sex with teenage girls — which he has denied — during his visits with Epstein.\n\nNow, with the latest release of files, the former prince faces an investigation by British police over c"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe US mortgage delinquency rate for lower-income households has surged, with a significant increase from 0.5% in 2021 to nearly 3% by the end of 2025. Meanwhile, Americans living alone are facing a \"singles tax\" due to rising rents, with the national average singles tax amounting to $10,470 per year. The health care industry has been a significant contributor to the US labor market, accounting for 95% of the 130,000 jobs added in January. Luxury brands are also targeting Chinese customers with Lunar New Year collections in an effort to attract big spenders. The US labor market would look significantly worse without the health care industry, which has buoyed the market despite slow growth in other sectors.\n\n## Market & Business Implications\n* The mortgage delinquency rate for lower-income households in the US has increased significantly, from 0.5% in 2021 to nearly 3% by the end of 2025, according to the Federal Reserve Bank of New York's Center for Microeconomic Data (Article 1).\n* The national average \"singles tax\" for Americans living alone is $10,470 per year, with cities like New York City, San Jose, and Boston having the highest singles tax, according to Zillow (Article 2).\n* The health care industry accounted for 95% of the 130,000 jobs added in January, and without it, the US would have nearly 400,000 fewer jobs than it did a year ago, according to Labor Department figures (Article 5).\n* Luxury brands like Harry Winston, Loewe, and Gucci are releasing Lunar New Year collections to attract Chinese customers, with the Chinese luxury market estimated to have contracted by 3% to 5% in 2025, according to Bain (Article 4).\n* The health care industry now makes up about 15% of all jobs in the US, nearly double the share it did in 1990, driven by an aging population and rapid growth over the past 35 years (Article 5).\n\n## Beginner-Friendly Summary\nThere's a big problem with people not being able to pay their mortgages, especially those with lower incomes. Some people are also struggling to pay rent because it's too expensive, especially if they live alone. The health care industry is doing well and creating a lot of jobs, which is helping the US labor market. Some luxury brands are trying to sell special products to people in China for the Lunar New Year. The health care industry is a big part of the US job market now, and it's been growing quickly over the past few decades.",
    "articles": [
      {
        "title": "A new mortgage crisis is quietly hitting those who can least afford it",
        "link": "https://www.washingtonpost.com/business/2026/02/14/mortgage-problems-delinquencies/",
        "published": "Sat, 14 Feb 2026 10:00:36 +0000",
        "source": "Business",
        "text": "Some financial crises sneak up on you, leaving people so perplexed that they become paralyzed, unsure of what to do. That’s what happened during the 2008 housing crisis. Everything was good for the economy, until it wasn’t. When the crash came, we got an insider look at the carnage: millions of homeowners lured into mortgages they couldn’t sustain over the long term lost their homes. Between 2007 and 2010, approximately 3.8 million foreclosures occurred, according to the Federal Reserve Bank of Chicago.\n\nDuring the Great Recession, the federal government eventually stepped in with programs and guidance that standardized assistance. Many private lenders copied the government’s relief efforts. The result was a menu of foreclosure alternatives that could be implemented on a massive scale.\n\nMore than a decade passed, and then came a global health crisis. The coronavirus pandemic hit and, again, homeowners struggled to pay their mortgages after being laid off from businesses forced to close to prevent the spread of covid-19. Congress stepped in to provide relief, making mortgage lenders do the right thing and help people save their homes from foreclosure.\n\nLast week, there was yet another warning that many homeowners might be headed for trouble.\n\nThe mortgage delinquency rates for lower-income households are surging, according to the Federal Reserve Bank of New York’s Center for Microeconomic Data, which recently released its Household Debt and Credit report for the fourth quarter of 2025. Ask The Post AIDive deeper\n\nAccording to New York Fed data, the 90-plus-day mortgage delinquency rate for families in the lowest-income bracket jumped from 0.5 percent in 2021 to nearly 3 percent by the end of 2025. Meanwhile, folks in the highest-income areas are doing just fine, maintaining “historically lower delinquency rates.”\n\nIt’s another reminder that the U.S. economy is largely benefiting people with means, while financial storm clouds are gathering over those who can least af"
      },
      {
        "title": "Living alone? The 'singles tax' that costs $10K a year",
        "link": "https://www.foxbusiness.com/economy/living-alone-singles-tax-costs-10k-year",
        "published": "Sat, 14 Feb 2026 12:04:17 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Americans who live alone are paying a five-figure \"singles tax\" amid rising rents around the nation, a new analysis finds.\n\nData from Zillow shows that the typical apartment rent is currently $1,745 and has risen 30% over the last five years, which represents a significant burden for renters who live alone and don't have one or more roommates to split the bill with.\n\nThe premium paid by solo renters was dubbed the \"singles tax\" by Zillow, which found that the national average singles tax amounts to $10,470 per year.\n\n\"When you're living alone, you're covering the full rent on one income and that can add up fast,\" said Emily Smith, Zillow rental trends expert. \"Apartments often make living solo more attainable, while also offering shared spaces that help people feel connected.\"\n\nHOUSING MARKET COOLS AS PRICE GROWTH HITS SLOWEST PACE SINCE GREAT RECESSION RECOVERY\n\nNew York City tops the list of areas with the highest singles tax, as the Big Apple's typical apartment rent of $3,900 a month amounts to a singles tax of $23,400 for the year.\n\nSan Jose ranked second, with a typical rent of $3,248 a month and a singles tax of $19,488 per year. Boston was close behind in third, with the typical rent in the city amounting to $3,014 a month and resulting in a singles tax of $18,084.\n\nA pair of California cities rounded out the top five, with San Francisco in fourth based on a typical rent of $2,857 and a singles tax of $17,142, while Los Angeles ranked fifth with a typical monthly rent of $2,648 and a singles tax of $15,888.\n\nHOMEBUYERS GAIN UPPER HAND IN 3 MAJOR CITIES AS INVENTORIES GROW\n\nRenters who pair up their living arrangement with a partner derive what Zillow called a \"couples' discount\" from being able to split up the rental bill as well as utilities and other costs.\n\n\"For renters who choose to live with a partner or roommate, splitting everyday costs like rent, utilities and groceries can go a long way in easing the pressure of today's higher cost of living,\" Smith"
      },
      {
        "title": "Could Manchester be a model for the UK to kickstart growth?",
        "link": "https://www.bbc.com/news/articles/c0ljgzjwjx3o?at_medium=RSS&at_campaign=rss",
        "published": "Sun, 15 Feb 2026 00:01:21 GMT",
        "source": "BBC News",
        "text": "Clearly every city retains the problems of 21st Century urban life. Homelessness in particular has been stark, with Shelter calculating 1 in 61 people in the city experiencing homelessness, higher than almost anywhere outside of London. It is the flipside of growth in property developments. While new social housing is being built, is there enough of it and other public services to sustain rapid increases in population?"
      },
      {
        "title": "Lunar New Year gives luxury brands a chance to win back big spenders in China",
        "link": "https://www.cnbc.com/2026/02/14/lunar-new-year-luxury-china.html",
        "published": "Sat, 14 Feb 2026 13:00:01 GMT",
        "source": "Business News",
        "text": "watch now\n\nLuxury brands from Harry Winston to Loewe are going all in on Lunar New Year collections in a bid to attract Chinese customers. Ahead of the Year of the Horse, which starts on Tuesday, Harry Winston unveiled a limited-edition, $81,500 rose gold watch with diamond bezels and a red lacquer horse. High-end fashion brand Chloé released a capsule collection, ranging from $250 silk scarves to a $5,300 snakeskin and leather shoulder bag with a horse head and tail linked by a horsebit chain. A slew of other brands, including Loewe, Gucci and Loro Piana, have introduced new bag charms with horse motifs. The Year of the Horse arrives at a time of cautious optimism for designer brands and could mark the start of a China's luxury market comeback. Chinese consumers were once the primary driver for the global luxury sector but have cut back sharply in recent years, weighed down by the country's slowing economy and depressed housing values. The Chinese luxury market stood at about 350 billion RMB in 2024, or about $50 billion, according to estimates from Bain. While the consultancy estimates that market contracted by 3% to 5% in 2025, Bain analysts noted that the sector started showing signs of recovery in the second half of 2025 on the back of stronger stock market performance and consumer confidence.\n\nLoewe celebrated Year of the Horse with storefront installation in Shanghai, China. Ying Tang/NurPhoto via Getty Images\n\nBernstein senior analyst Luca Solca said he predicts Chinese luxury spending will stabilize, forecasting mid-single-digit percentage growth in 2026. However, the market is still far more competitive than at its peak, he said. Before the Covid pandemic, Chinese consumers accounted for about one-third of the global luxury goods market, according to Solca. That percentage has since dipped to about 23%, he said. The luxury market's fortunes do not solely rest on Lunar New Year, but it is an opportunity for Western brands to show respect for Chinese culture"
      },
      {
        "title": "If not for this one industry, the U.S. labor market would look a lot worse",
        "link": "https://www.washingtonpost.com/business/2026/02/14/health-care-industry-fuels-employment/",
        "published": "Sat, 14 Feb 2026 10:00:10 +0000",
        "source": "Business",
        "text": "Nearly all of the jobs added to the U.S. economy in recent months have come from one industry: health care. Health care and social assistance accounted for 95 percent of the 130,000 jobs added in January. That builds on similar trends throughout 2025, when the industry buoyed an otherwise slow labor market, as the nation’s hospitals, clinics and nursing homes kept hiring even as many employers pulled back.\n\nWithout health care and related jobs, the United States would have nearly 400,000 fewer jobs than it did a year ago, according to Labor Department figures through January.\n\n“Health care is holding up this lopsided jobs market,” said Laura Ullrich, director of economic research in North America at the Indeed Hiring Lab. “Not all of that is a surprise: If you’d gone back to 2000 and asked, ‘What are going to be the jobs of the future 25 years from now?,’ health care would’ve been at the top of that list. But what is surprising is how strong growth has remained even as everything else slows down.”\n\nHealth care and social assistance now makes up about 15 percent of all jobs, nearly double the share it did in 1990. The industry’s reach has grown rapidly over the past 35 years, making it the dominant force in the labor market. Ask The Post AIDive deeper\n\nThat steady growth — driven in large part by an aging population — became even more pronounced after the pandemic. Like many other industries, health care suffered a sudden loss of jobs early in the covid pandemic as clinics and nursing homes shuttered, and elective procedures were put on hold. But since then, hiring has picked up rapidly, especially in “mid-level” positions such as physician assistants and nurse practitioners, according to Neale Mahoney, an economics professor at Stanford University.\n\nMore than 1 in 6 Americans is now 65 or older, an age group that spends an outsize amount on medical care. The country’s first baby boomers are beginning to turn 80 — and will continue doing so, doubling the number of Am"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market experienced fluctuations last week, with the Nasdaq Composite falling 2.1% and the S&P 500 declining 1.4%. Instacart's stock surged 9% and 14% on two separate days after the company reported strong results and optimistic guidance. Roku's stock was upgraded by Oppenheimer to Outperform with a price target of $105. The market is closely watching AI-related disruptions and their impact on various industries. \n\n## Market & Business Implications\n* Oppenheimer upgraded Roku's stock to Outperform with a price target of $105, citing potential drivers such as the Amazon DSP collaboration and the upcoming Winter Olympics (Article 1).\n* Instacart's CEO called concerns about grocery competition \"overblown\" and stated that the company monitors threats \"extremely closely\" (Article 2).\n* Instacart reported strong fourth-quarter revenue, with a 12% increase from $883 million a year ago, and forecast upbeat guidance for the first quarter (Article 4).\n* The market will be watching Walmart's fourth-quarter release on Thursday, which is a strong indicator of consumer spending (Article 3).\n* The Nasdaq Composite fell 0.2% on Friday, while the S&P 500 managed a gain of less than 0.1%, and the Dow Jones Industrial Average picked up 0.1% (Article 3).\n\n## Beginner-Friendly Summary\nThe stock market had some ups and downs last week. A company called Instacart had good news, which made its stock price go up. Another company, Roku, got a positive review from a financial expert. People are watching to see how artificial intelligence will affect different industries. The market is also waiting to see how a big company called Walmart did last quarter.",
    "articles": [
      {
        "title": "Oppenheimer Upgrades Roku (ROKU) to Outperform After Stock Dip and Amazon DSP Collaboration",
        "link": "https://finance.yahoo.com/news/oppenheimer-upgrades-roku-roku-outperform-134150370.html?.tsrc=rss",
        "published": "Sun, 15 Feb 2026 13:41:50 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Roku, Inc. (NASDAQ:ROKU) ranks among the best innovative stocks to buy according to Wall Street analysts. On February 6, Oppenheimer upgraded Roku, Inc. (NASDAQ:ROKU) from Perform to Outperform with a price target of $105. The revision comes after ROKU stock fell 25% from its 52-week high, compared with a 4% drop in the NASDAQ over the same period.\n\nOppenheimer identified a number of potential drivers for Roku, Inc. (NASDAQ:ROKU), which include the recently announced Amazon DSP collaboration, greater interest in the next Winter Olympics, as well as Roku’s Peacock SVOD offering.\n\nThe firm predicts Roku’s core platform revenue will climb 15% in 2026 and 16% in 2027, excluding political ads and certain one-time events, slightly exceeding street expectations. In a more optimistic scenario, growth might reach 17% in 2026 and 16% in 2027, boosted by the Amazon deal and the upcoming Olympics.\n\nFounded in 2002, Roku, Inc. (NASDAQ:ROKU) is an American company specializing in smart TVs and streaming devices. The company licenses its streaming technology to other manufacturers and runs an advertising campaign via its streaming network.\n\nWhile we acknowledge the potential of ROKU as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: 10 Best Magic Formula Stocks for 2025 and 10 Best Retirement Stocks to Buy According to Hedge Funds.\n\nDisclosure: None. This article is originally published at Insider Monkey."
      },
      {
        "title": "Instacart jumps 9% on strong results as CEO calls grocery competition fears 'overblown'",
        "link": "https://www.cnbc.com/2026/02/13/instacart-cart-stock-ceo-grocery.html",
        "published": "Fri, 13 Feb 2026 22:16:07 GMT",
        "source": "Earnings",
        "text": "Instacart 's stock surged 9% after the company's robust results alleviated worries over mounting competitive pressures in the grocery delivery market.\n\nDuring an earnings call with analysts, CEO Chris Rogers, who took the helm last year, called the concerns \"overblown\" and said the company monitors threats \"extremely closely.\"\n\n\"There is definitely a market for us here and we feel good about our points of differentiation,\" he said.\n\nInstacart is facing an increasingly competitive market as retailers like Amazon and food platforms such as Uber Eats and Doordash aggressively scale in grocery delivery. At the same time, the company is investing in new technology and artificial intelligence tools to drive more customers and businesses to its platform.\n\nWall Street analysts viewed Instacart's results as a wave of confidence for those worried about the company's moat. Analysts at Bernstein called the report a \"solid rebuttal\" to competitive pressures and AI threats.\n\n\"The clean beat-and-raise has been rare this internet earnings cycle and CART stands out from that perspective,\" wrote analysts at Barclays."
      },
      {
        "title": "Walmart earnings, spending data, and more AI disruptions: What to watch this week",
        "link": "https://finance.yahoo.com/news/walmart-earnings-spending-data-and-more-ai-disruptions-what-to-watch-this-week-125712762.html?.tsrc=rss",
        "published": "Sun, 15 Feb 2026 12:57:12 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "AI turbulence was the dominant theme in markets last week, with software, real estate, financial services, and logistics stocks all facing selling pressure on worries about the scale of AI-related disruption to their businesses.\n\nOn Friday, the tech-focused Nasdaq Composite (^IXIC) fell by 0.2% to close the week on a loss of 2.1%. Meanwhile, the S&P 500 (^GSPC) managed a gain of less than 0.1% on Friday but still finished the week down a cumulative 1.4%. The Dow Jones Industrial Average (^DJI) picked up 0.1% in the week's final session but logged a weekly decline of 1.2%.\n\nThese moves in the index flattered what were sharp moves beneath the surface. Whether these disruptions continue will be the theme most closely tracked by investors in the week ahead.\n\nThis week's calendar\n\nHeadlining the economic data calendar this week will be Friday's Personal Consumption Expenditures (PCE) report, offering investors a read on consumer spending in the holiday shopping-filled month of December and a look at inflation.\n\nThe data comes after last week's Consumer Price Index (CPI) numbers showed that inflation slowed more than expected in January.\n\nInvestors will also get a reading on market sentiment from the University of Michigan on Friday, a key indicator of how consumer vibes square with the hard spending data. Earlier this month, that measure moved to its highest level since August, but remains depressed compared to a year ago.\n\nMore from Yahoo Scout What's driving the recent AI disruption selloff? Which sectors are most affected by AI concerns? What's the outlook for Federal Reserve policy? How will upcoming economic data impact markets?\n\nIn the corporate world, attention is likely to focus on Thursday's fourth quarter release from Walmart (WMT), a strong indicator of consumer spending, with the report marking the first for new Walmart CEO John Furner.\n\nOther notable results should include Wednesday readings from DoorDash (DASH) and Molson Coors (TAP), as well as several nam"
      },
      {
        "title": "Instacart stock pops 14% on revenue beat, optimistic guidance",
        "link": "https://www.cnbc.com/2026/02/12/instacart-cart-q4-2025-earnings.html",
        "published": "Thu, 12 Feb 2026 23:32:31 GMT",
        "source": "Earnings",
        "text": "Instacart shares climbed 14% during extended trading on Thursday after the grocery delivery company reported strong fourth-quarter revenue and forecast upbeat guidance.\n\nHere's how the company did versus LSEG estimates:\n\nEarnings per share : 30 cents vs. 52 cents expected\n\n: 30 cents vs. 52 cents expected Revenue: $992 million vs. $974 million expected\n\nFor the first quarter, Instacart expects gross transaction value, which tracks the value of goods sold, to range between $10.13 billion and $10.28 billion. That was ahead of StreetAccount's $9.97 billion estimate. The company expects adjusted earnings before interest, taxes, depreciation and amortization in the range of $280 million and $290 million, versus $277 million expected by StreetAccount.\n\nRevenue grew 12% from $883 million a year ago. Net income totaled $81 million, or 30 cents per share. The company reported adjusted EBITDA of $303 million, topping the $292 million expected by StreetAccount.\n\nIn a letter to shareholders, CEO Chris Rogers said Instacart's technology and customer-oriented approach are driving more growth and engagement to the platform.\n\n\"Our execution on what matters most to customers is driving strong momentum on our marketplace, as well as our enterprise platform — which is a real, strategic advantage for us,\" he said.\n\nInstacart also said its operating expenses rose year over year \"due to higher general and administrative expense driven by non-recurring legal and regulatory matters.\" That included a $60 million refund settlement with the Federal Trade Commission over alleged deceptive practices\n\nGross transaction value grew 14% from a year ago to $9.85 billion, surpassing a StreetAccount estimate of $9.54 billion. Instacart said this was its strongest quarter of growth for the metric in three years. Orders totaled 89.5 million orders, beating a StreetAccount estimate of 87.8 million.\n\nFinance chief Emily Reuter told CNBC that strong gains in Instacart's enterprise platform, where the compa"
      },
      {
        "title": "Dow Jones Futures: What To With This Dangerous Market; Apple, Google, Amazon, Nvidia In Focus",
        "link": "https://finance.yahoo.com/m/5a940658-9875-3edf-9d6a-97242b856cd9/dow-jones-futures%3A-what-to.html?.tsrc=rss",
        "published": "Sun, 15 Feb 2026 12:31:16 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Here are ways to reduce the risks of a highly dangerous market. Apple, Google, Amazon, Meta and Nvidia are masking some underlying strength"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nA recent study suggests that the World Liberty Financial Token (WLFI) may have acted as an early warning signal for a major market breakdown in the crypto market. The token's price dropped more than five hours before a significant decline in Bitcoin and other cryptocurrencies. Meanwhile, Cathie Wood's ARK Invest has added nearly $15.2 million in Coinbase stock. Additionally, Mirae Asset Consulting has agreed to acquire a 92% stake in Korean crypto exchange Korbit for $93 million. Bitcoin's price is expected to continue its downward trend, with some analysts predicting it will reach $55,000.\n\n## Market & Business Implications\n* According to a study by Amberdata, WLFI began a sharp decline more than five hours before the broader market downturn on October 10, 2025 (Article 1).\n* Cathie Wood's ARK Invest has added nearly $15.2 million in Coinbase stock, as reported by Cointelegraph (Article 1).\n* Mirae Asset Consulting has agreed to acquire a 92.06% stake in Korean crypto exchange Korbit for $93 million, as stated in a regulatory filing (Article 5).\n* X's Head of Product Nikitia Bier announced that the platform's Smart Cashtags feature will launch in a few weeks, allowing users to trade supported financial assets directly within the app (Article 1).\n* A report by CryptoQuant suggests that Bitcoin's \"ultimate bear market bottom\" is around $55,000, which is 21% below its current price (Article 4).\n\n## Beginner-Friendly Summary\nThere was a big drop in the price of some cryptocurrencies. A special token called WLFI might have warned people about this drop before it happened. Some big investors put money into a company called Coinbase. Another company bought a big part of a Korean cryptocurrency exchange called Korbit. Some people think the price of Bitcoin will keep going down to around $55,000.",
    "articles": [
      {
        "title": "Here’s what happened in crypto today",
        "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 15 Feb 2026 13:19:54 +0000",
        "source": "Cointelegraph.com News",
        "text": "Today in crypto, Trump-linked WLFI dropped more than five hours before the Oct. 10 crypto liquidation event, X exec Nikita Bier says in-app trading is just weeks away. Meanwhile, Cathie Wood’s ARK Invest added nearly $15.2 million in Coinbase stock.\n\nStudy suggests WLFI could act as an ‘early warning signal’ in crypto\n\nWorld Liberty Financial Token (WLFI), a DeFi governance token affiliated with the Trump family, may have signaled a major market breakdown hours before Bitcoin moved, according to a new analysis by data provider Amberdata.\n\nThe report examines trading activity on Oct. 10, 2025, when roughly $6.93 billion in leveraged crypto positions were liquidated in under an hour. Bitcoin (BTC) fell about 15% and Ether (ETH) dropped roughly 20%, while smaller tokens lost as much as 70%.\n\nAmberdata found that WLFI began a sharp decline more than five hours before the broader market downturn. At the time, Bitcoin was still trading near $121,000 and showed little immediate stress.\n\n“A five-hour lead time is hard to dismiss as coincidence,” Mike Marshall, who authored the report, told Cointelegraph. “That duration is what separates a genuinely actionable warning from a statistical artefact,” he added.\n\nWLFI crashed ahead of Bitcoin. Source: Amberdata\n\nNikitia Bier says X Smart Cashtags will feature in-app trading\n\nThe upcoming Smart Cashtags feature on the X social media platform will launch in a “couple” of weeks, according to X’s Head of Product Nikitia Bier, who added that it will allow users to trade supported financial assets directly within the X app.\n\n“We are launching a number of features in a couple of weeks, including Smart Cashtags that will enable you to trade stocks and crypto directly from the timeline,” Bier said in an X post on Saturday.\n\nThe feature has been widely anticipated by investors and traders in the crypto community ever since Elon Musk took over the platform in 2022 and said that he wants to turn X into an “everything app.”\n\nThe X platform is"
      },
      {
        "title": "Can Meme Coins Power a Senate Bid? Virginia’s Mark Moran Says Yes",
        "link": "https://decrypt.co/358070/can-meme-coins-power-senate-bid-virginia-mark-moran-says-yes",
        "published": "Sat, 14 Feb 2026 18:14:46 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Mark Moran is using a meme coin to help boost his long-shot Senate bid.\n\nMoran said he’s trying to motivate degens and connect with voters.\n\nThe former Wall Street banker is running against a pro-crypto Democrat.\n\nMark Moran may be fresh to politics, but the former reality TV contestant and Wall Street banker is confident that his path to Washington runs through Solana’s trenches.\n\nThat’s because the 34-year-old, who is challenging incumbent Sen. Mark Warner in Virginia’s Democratic primary, recently embraced a meme coin as a way to elevate his campaign.\n\nMoran described the endeavor to Decrypt as an attempt to innovate and appeal to crypto-native voters. But he acknowledged that his promotion of the token on social media accounts and his campaign website invites scrutiny from regulators—and potentially his competitors.\n\n“When you think about a political campaign, that is attention and community,” he said. “Once I saw that it was legit, I thought, ‘Okay, well, any attention is good attention.’”\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nSince backing the token, Moran has removed its contract address from his X bio, billing himself now as a “Revolutionary Virginian Running for U.S. Senate.” As of Saturday, he had received nearly $24,000 in proceeds from the token’s debut, according to a platform for creating meme coins called Bags.\n\nMoran said he had no involvement in the token’s creation weeks ago by a pseudonymous individual named “Atone.” But after learning about the project that set aside 100% of its royalties for him, he came to appreciate the concept behind the “Mark Moran Fund.”\n\n“I realized there’s a great opportunity to call attention to the campaign finance space,” he said. “The money is the issue in the system. A politician has to raise all this money, but then it makes them liable"
      },
      {
        "title": "Study suggests WLFI could act as an ‘early warning signal’ in crypto",
        "link": "https://cointelegraph.com/news/wlfi-early-warning-signal-crypto-amberdata-study?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 15 Feb 2026 13:04:28 +0000",
        "source": "Cointelegraph.com News",
        "text": "World Liberty Financial Token (WLFI), a DeFi governance token affiliated with the Trump family, may have signaled a major market breakdown hours before Bitcoin moved, according to a new analysis by data provider Amberdata.\n\nThe report examines trading activity on Oct. 10, 2025, when roughly $6.93 billion in leveraged crypto positions were liquidated in under an hour. Bitcoin (BTC) fell about 15% and Ether (ETH) dropped roughly 20%, while smaller tokens lost as much as 70%.\n\nAmberdata found that WLFI began a sharp decline more than five hours before the broader market downturn. At the time, Bitcoin was still trading near $121,000 and showed little immediate stress.\n\n“A five-hour lead time is hard to dismiss as coincidence,” Mike Marshall, who authored the report, told Cointelegraph. “That duration is what separates a genuinely actionable warning from a statistical artefact,” he added.\n\nRelated: Senators ask Bessent to probe $500M UAE stake in Trump-linked WLFI\n\nWLFI anomalies before the selloff\n\nResearchers analyzed three unusual patterns, including a surge in trading activity, a sharp divergence from Bitcoin and extreme leverage, to determine whether WLFI signaled stress before the broader market selloff.\n\nWLFI’s hourly volume jumped to roughly $474 million, about 21.7 times its normal level, within minutes of tariff-related political news. Meanwhile, funding rates on WLFI perpetual futures reached about 2.87% every eight hours, equivalent to an annualized borrowing cost near 131%.\n\nWLFI funding rating. Source: Amberdata\n\nThe study does not claim insider trading occurred. Instead, it argues the way crypto markets are structured can make certain assets matter more than their size suggests.\n\nWLFI’s holder base is concentrated among politically connected participants, the report says, unlike Bitcoin’s widely distributed ownership. Marshall said the trading pattern appeared “instrument-specific,” meaning activity was focused on WLFI rather than across the broader crypto"
      },
      {
        "title": "Bitcoin Is Down Bad, But Hasn't Yet Hit Its 'Ultimate Bear Market Bottom': Analysts",
        "link": "https://decrypt.co/358083/bitcoin-down-bad-hasnt-hit-ultimate-bear-market-bottom",
        "published": "Sat, 14 Feb 2026 16:11:05 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Bitcoin's \"ultimate bear market bottom\" is $55,000, according to a new report from CryptoQuant.\n\nThe firm's market indicator also sits above its \"extreme bear\" phase, which has typically marked the start of bottoming process.\n\nBitcoin would need to fall another 21% to reach the \"ultimate bear market\" mark, per analysts.\n\nBitcoin traders hoping that the top crypto asset has already marked its bottom for the cycle are likely to be disappointed, according to a new report from CryptoQuant.\n\nThe firm’s weekly report insists traders need patience, noting that bear market bottoms “take time to form,” while citing the true bottom for BTC is $55,000.\n\n“Bitcoin’s ultimate bear market bottom is around $55K today,” the report reads. “This level represents the realized price, which historically has been a major price support area in previous bear markets.”\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nThe realized price—a metric that tracks the average price at which investors have purchased a specific cryptocurrency—has been touched during both of the last two bear market bottoms, according to data from the firm.\n\n“Once the price gets to this level, it tends to gravitate around it for 4-6 months,” the firm wrote.\n\nThe firm’s report also notes that its bull-bear market cycle indicator is only in the “bear” phase, and has not entered the “extreme bear” segment that has typically marked the beginning of a bottom phase.\n\nCryptoQuant’s analysis mirrors that from others in the last few weeks. Galaxy’s head of research noted the asset’s lack of near-term catalysts and structural weakness as reasons it could head towards its 200-week moving average around $58,000.\n\nPlus, earlier this week, Standard Chartered updated its forecast to indicate that BTC could drop to $50,000 before any sort of rebound towards $100,000"
      },
      {
        "title": "Mirae Asset agrees to buy 92% stake in Korean exchange Korbit for $93M",
        "link": "https://cointelegraph.com/news/mirae-asset-buy-92-percent-korbit-korea-crypto-exchange?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 15 Feb 2026 10:04:27 +0000",
        "source": "Cointelegraph.com News",
        "text": "Mirae Asset Consulting, an affiliate of South Korean multinational financial services company Mirae Asset Group, has agreed to acquire a controlling stake in local crypto exchange Korbit.\n\nThe company plans to purchase 26.9 million shares of Korbit for 133.48 billion won (about $93 million), a transaction that would give it a 92.06% ownership interest in the exchange, according to a Friday regulatory filing. The payment will be made entirely in cash\n\nMirae Asset said the purpose of the acquisition is “to secure future growth drivers through digital-asset (virtual-asset) businesses,” per the filing. The company’s board approved the decision on Feb. 5, while reports on the planned deal initially surfaced last year.\n\nThe transaction has not yet closed. The settlement will occur once contractual closing conditions are satisfied, with completion expected within seven business days after those requirements are met.\n\nRelated: How a Bitcoin promotion error triggered a regulatory reckoning in South Korea\n\nKorbit returns to profit after sale talks\n\nKorbit reported 8.7 billion won in revenue and 9.8 billion won in net profit in its most recent fiscal year, reversing losses recorded in prior years.\n\nKorbit is primarily owned by NXC and its subsidiary Simple Capital Futures, which together hold about 60.5% of the exchange. SK Square owns an additional 31.5% stake.\n\nKorbit holds a full operating license and compliance infrastructure, which could make it an attractive entry point for a major financial group seeking regulated exposure to digital assets.\n\nAs Cointelegraph reported, local exchange Coinone also is exploring a potential sale, as chairman Cha Myung-hoon seeks to divest his 53.4% controlling stake.\n\nRelated: South Korea probes Bithumb after $43B ‘phantom’ Bitcoin payout\n\nKorbit trails major Korean exchanges in trading volume\n\nAccording to CoinGecko data, Korbit remains a relatively small player in South Korea’s crypto trading market compared with larger domestic exchange"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-15T13:48:31.043958+00:00"
  }
}