{
  "Tech": {
    "summary": "## Executive Summary\nA former Google engineer, Sam Basu, has co-founded a startup called Amari AI to help customs brokers modernize using AI. Abxylute has launched a Kickstarter campaign for its new Switch 2 controller prototype, but it has some design issues. Pebble is working on producing new hardware products, including a watch with a waterproof rating of 30m. Research has found that some password managers' claims of being \"zero knowledge\" are not entirely true. T-Mobile's unlimited phone plan has been compared to those of AT&T and Verizon, with T-Mobile's Experience More/Better Value plan being considered the best.\n\n## Market & Business Implications\n* Amari AI has raised $4.5 million in funding and has already collected more than 30 customers, helping them move over $15 billion of goods, as stated in Article 1.\n* Abxylute's new Switch 2 controller prototype has design issues, including the left and right sticks being too low for medium-size hands, as mentioned in Article 2.\n* Pebble is in the Production Verification Test phase for its new hardware products, including a watch with a waterproof rating of 30m, as reported in Article 3.\n* Research has found that password managers such as Bitwarden, Dashlane, and LastPass are not entirely \"zero knowledge\" due to account recovery and vault sharing features, as stated in Article 4.\n* T-Mobile's Essentials plan starts at $60/month for one line, with autopay and taxes/fees not included, as compared to other carriers in Article 5.\n\n## Beginner-Friendly Summary\nSome former big tech employees are using artificial intelligence to help with trade and customs. A company called Abxylute is making a new controller for a gaming system, but it has some problems. A company called Pebble is making new products, including a watch that can get wet. Some password managers are not as secure as they claim. A phone company called T-Mobile has a good unlimited phone plan that is being compared to other companies.",
    "articles": [
      {
        "title": "This former Big Tech engineers are using AI to navigate Trump’s trade chaos",
        "link": "https://techcrunch.com/2026/02/19/this-former-big-tech-engineers-are-using-ai-to-navigate-trumps-trade-chaos/",
        "published": "Thu, 19 Feb 2026 14:00:00 +0000",
        "source": "TechCrunch",
        "text": "Sam Basu quit his job as a senior software engineer at Google in early 2023, not long after OpenAI released ChatGPT. He took a few stabs at starting new AI businesses, but nothing really stuck until he got a call from a friend who wanted help filling out customs paperwork.\n\nBasu got “very curious” and started cold-calling customs brokers in the Los Angeles area. He learned that many are mom-and-pop affairs still deeply reliant on fax machines and paper. When his first customer showed him stacks of manila folders during a FaceTime tour of her office, everything clicked, Basu told TechCrunch. He flew to that customer’s office the next day.\n\n“That was the eye-opening moment. There’s just papers and papers,” Basu said in a recent interview. “I was both shocked and impressed. Shocked that this is how the industry runs, and impressed that everything around us, from the watch that you’re wearing to the glasses, literally everything that’s imported, and this is what’s happening behind the scenes.”\n\nThis seed of an idea is now called Amari AI, a startup co-founded by Basu and Arushi Vashist, a former senior software engineer at LinkedIn. The pair, and their small team, have already collected more than 30 customers, and helped those firms move more than $15 billion of goods.\n\nAmari has also raised $4.5 million of funding co-led by preeminent early-stage firms First Round Capital and Pear VC, all before coming out of stealth mode on Thursday.\n\nBasu has two goals with Amari. One is to help customs brokers modernize. To date, he said, many of them have done little work to integrate new technologies. Some leverage optical character recognition software to help speed up data entry, but that tech is limited and brittle, he said. Amari is meant to help automate data entry and paperwork, and let employees — who legally must be in the United States, meaning companies can’t use off-shore workers — focus on helping customers move their goods across the border.\n\nThat’s where the second g"
      },
      {
        "title": "Abxylute’s new Switch 2 controller prototype has one big problem",
        "link": "https://www.theverge.com/tech/880971/abxylute-n6-switch-2-hands-on-controller",
        "published": "2026-02-19T09:00:00-05:00",
        "source": "The Verge",
        "text": "is an editor covering deals and gaming hardware. He joined in 2018, and after a two-year stint at Polygon, he rejoined The Verge in May 2025.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nGaming accessory company Abxylute has launched a Kickstarter campaign for its upcoming N6 and GameCube-style N9C Switch 2 dock-style controllers. If the ergonomics of Nintendo’s Joy-Cons don’t jibe with you, these aim to be solid alternatives, particularly for people with medium-to-large-size hands.\n\nBoth of Abxylute’s new controllers have bigger, more comfortable grips than Joy-Cons offer, along with longer-lasting Hall effect joysticks. I tested a functioning prototype of the N6, and it has almost everything that people might be looking for to level up their gaming experience: full-size sticks, vibration, motion controls, customizable back paddles, and turbo mode for spamming commands.\n\nWhat the N6 is going for isn’t anything new. CRKD popularized the slide-in form factor with the original Switch. It adds thick grips to your console to make it look and feel more like a Steam Deck. For as much as it added to ergonomics, it stood out as a solution for the Switch’s Joy-Con drift drama by offering Hall effect sticks that won’t degrade. The N6 doesn’t mess with that formula very much. It has full-size Hall effect joysticks that are grippier and feature a concave top so your thumb can rest instead of sliding off. It has thick grips that go around the console’s back to let your fingers spread out, and its triggers are bigger and offer more tactile feedback.\n\nAdding more grip to the back of the console doesn’t mean I don’t want more surface area on the front. Also, the edges of the Switch 2 that stick out from the controller look silly.\n\nThe thing is, the N6 doesn’t feel like as much of an upgrade over Joy-Cons as the Nitro Deck, based on my time with a functional prototype. For one, the left and right sticks are too low for my medium-size hand"
      },
      {
        "title": "Pebble Production: February Update",
        "link": "https://repebble.com/blog/february-pebble-production-and-software-updates",
        "published": "Thu, 19 Feb 2026 12:36:00 +0000",
        "source": "Hacker News: Front Page",
        "text": "Things are busy in Pebbleland! We’re getting close to shipping 3 new hardware products and all the associated software that comes along with them. Overall, things feel good. I’d say the amount of last minute shenanigans is at the normal amount. Getting new hardware into ‘production’ is a pretty wild and exciting process. Building hardware is an exercise in balancing competing priorities of cost, quality and speed. In the last mile push to get into production, things can change quickly for the best (woohoo! the waterproof test finally passes, we can move to the next stage), or less good (uh, the production line needs 3 more test fixtures to test Index 01 mic performance, and a major production test software update…that’ll be a lot more money). Unlike with software, you can’t easily fix hardware issues after you ship! Making these last minute decisions is sometimes pretty stressful but hey, that’s the world of making hardware.\n\nWe’re in the Production Verification Test (PVT) phase right now, the last stop before Mass Production (MP). During this phase we manufactured hundreds of PT2s in a series of test builds, uncovered a bunch of issues, and fixed a bunch of issues. Just before the factories shut down for the lunar New Year, we got the good news that all the tests passed on the last build!\n\nWe focused most of January on improving the waterproofing on the watch (flash back to last summer when we worked on this for Pebble 2 Duo!). I traveled to visit the factory (travelogue here) and worked through a lot of open issues. Above is a video of the speaker waterproof testing from the production line. Good news is that we fixed all the issues, tests are passing and it looks like we’ll be able to certify PT2 with a waterproof rating of 30m or 3ATM! This means you can get your watch wet, wear it while swimming (but not in hot tubs/saunas) and generally not worry about it. It’s not a dive watch, though. Also, don’t expose it to hot water (this could weaken the waterproof seals"
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Best Unlimited Phone Plan: T-Mobile, AT&T, Verizon Compared (2026)",
        "link": "https://www.wired.com/story/best-unlimited-phone-plans/",
        "published": "Thu, 19 Feb 2026 13:08:00 +0000",
        "source": "WIRED",
        "text": "“Unlimited” is a funny term. Unlimited cell phone plans often come with a long list of footnotes, terms, conditions, and exceptions. Mercifully, all of the Big Three cell companies have, by now, ditched throttling on their most expensive plans and include 5G data access in all their unlimited plans. Yet there are still many differences in the services they offer, and there are many differences between each carrier's various tiers.\n\nCheaper “unlimited” tiers do offer unlimited talk and text. But they still have rules on how much data you get before they start throttling your speed, and some “unlimited” plans may throttle your data at any given time. It's been a fixture of cell service plans for years.\n\nIt can be overwhelming, which is why I've broken it down. Below, I've highlighted what each of the three major carriers offers for “unlimited” individual and family plans to help you figure out which unlimited plan is best for you and your budget.\n\nIf you absolutely want to avoid slower data speeds at peak times, you'll likely be choosing among the plans here. But look to our guide to the Best Prepaid Phone Plans for lower costs at the expense of some limitations. Also check out WIRED's guides to the Best Android Phones, Best iPhones, and Best Cheap Phones.\n\nUpdate February 2026: We updated prices and plans for all three major carriers. We added T-Mobile's Essentials Saver Plan and rebranded Better Value Plan as well as AT&T’s rebranded Premium PL, Extra EL, Saver SL, and Value Plus VL plans.\n\nThe Best Unlimited Plan Right Now: T-Mobile Experience More/Better Value Plans\n\nThe Essentials plan (with autopay, taxes/fees not included): 1 Line for $60/month | 2 Lines $90 | 3 Lines $90 | 4 Lines $100 | 5 Lines $125.\n\nEssentials Saver plan (with autopay, taxes/fees not included): 1 Line for $50/month | 2 Lines $80 | 3 Lines $140\n\nExperience More/Better Value (with autopay, taxes/fees not included): 1 Line for $85/month | 2 Lines $140 | 3 Lines $140 | 4 Lines $170 | 5 Lines $2"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nThe AI industry has seen recent developments, including a moment of awkwardness between OpenAI's Sam Altman and Anthropic's Dario Amodei at the India AI Impact Summit. A new AI tool called Fomi has been introduced to help users stay focused by analyzing their screen activity. Freeform, a startup, has raised $67 million in Series B funding to scale up its laser AI manufacturing platform. Additionally, Scout AI has demonstrated its AI agents' ability to seek and destroy targets using exploding drones.\n\n## Market & Business Implications\n* OpenAI and Anthropic are expanding their presence in India, with OpenAI opening two new offices and partnering with IT giant TCS, and Anthropic opening an office and teaming up with Infosys (Article 1).\n* Fomi, a macOS distraction-blocking tool, uses AI to analyze screen activity and determine whether a user is being productive or distracted, and offers a three-day free trial and subscription plans starting at $8 per month (Article 2).\n* Freeform has raised $67 million in Series B funding from investors including Apandion, AE Ventures, and Nvidia's NVentures to expand its manufacturing platform, which uses hundreds of lasers to produce metal parts (Article 4).\n\n## Beginner-Friendly Summary\nThere was an awkward moment between two important people in the AI industry at a big meeting in India. A new tool called Fomi can help people stay focused on their work by watching what they do on their computer. A company called Freeform got a lot of money to make more machines that can build metal parts using lasers. Another company, Scout AI, made robots that can find and destroy things, which could be used by the military.",
    "articles": [
      {
        "title": "Altman and Amodei share a moment of awkwardness at India’s big AI summit",
        "link": "https://techcrunch.com/2026/02/19/altman-and-amodei-share-a-moment-of-awkwardness-at-indias-big-ai-summit/",
        "published": "Thu, 19 Feb 2026 13:49:06 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "In Brief\n\nWhat would have been a moment of united commitment to global tech innovation at the ongoing India AI Impact Summit instead proved an awkward one: When Prime Minister Narendra Modi prompted speakers at the event to join hands and raise them in a show of solidarity, all executives on stage obliged — except OpenAI’s Sam Altman and Anthropic’s Dario Amodei, who held their hands noticeably apart.\n\nAs leaders of the two foremost labs in the AI race, it goes without saying that Altman and Amodei are fierce competitors. That rivalry has only intensified in recent months: after OpenAI said it would bring advertisements to ChatGPT, Anthropic took a swipe at OpenAI in a couple ads during the Super Bowl, declaring that it would never introduce ads into Claude.\n\nAltman soon after hit back in response, calling Anthropic “dishonest” and “authoritarian.”\n\n“We would obviously never run ads in the way Anthropic depicts them. We are not stupid, and we know our users would reject that,” he wrote at the time.\n\nBoth Altman and Amodei were in India this week for the AI summit held in New Delhi, which saw a bevy of AI-related investments, features and products being announced. OpenAI said it is opening two new offices in India, partnering with IT giant TCS, and is deploying tools for higher education. Anthropic has also opened an office in India and teamed up with Infosys for internal and external deployment of its AI tools."
      },
      {
        "title": "This AI Tool Will Tell You to Stop Slacking Off",
        "link": "https://www.wired.com/story/fomi-ai-will-tell-you-to-stop-slacking-off/",
        "published": "Thu, 19 Feb 2026 10:30:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "I've tested a lot of software tools over the years designed to block distractions and keep you focused. None of them work perfectly, mostly because of context.\n\nReddit, for example, is something I should generally avoid during the workday, so I tend to block it—this is a good decision for me overall. The problem is that sometimes the only place I can find a particular piece of information online is in a Reddit thread, meaning that to get that information I need to turn off my distraction-blocking tool. Then I inevitably end up down some kind of rabbit hole.\n\nThis is the exact problem Fomi, a macOS distraction-blocking tool, is built to solve. The application asks you what you're working on, then watches everything you do on your Mac desktop—every app you open—and uses AI to analyze what's on your screen. The tool can tell, from context, whether you're using a particular website productively or as a distraction.\n\nZach Yang, part of the team behind the app, tells me on Discord he dreamed up the app after talking with a friend who was studying for an MBA. “He needed YouTube for study videos, so web/app blockers didn’t work, and once he was watching, recommendations would often pull him away,” Yang says. “That’s when I started thinking about using AI to solve this. I built a small prototype to test whether current models were capable of distinguishing distraction from actual work, and the results were good enough that I decided to turn it into a real project.”\n\nFomi offers a three-day free trial. If you decide you like it, subscription plans cost $8 per month. However, since the tool uploads screenshots of your desktop to an AI model in the cloud, there are privacy concerns you will need to weigh before deciding if a tool like this is right for you.\n\nWatch This Space\n\nI've been trying out this application for a couple of days. The first time you launch it, you're asked what you do day-to-day and what kind of tools you use to do it. Then, when it's time to focus, you tel"
      },
      {
        "title": "It&#8217;s MAGA v Broligarch in the battle over prediction markets",
        "link": "https://www.theverge.com/policy/881139/broligarch-prediction-markets",
        "published": "2026-02-19T08:50:00-05:00",
        "source": "AI | The Verge",
        "text": "Hello and welcome to Regulator, a newsletter for Verge subscribers about the love-hate (but mostly hate) relationship between Silicon Valley and Washington. I hope everyone got to celebrate George Washington’s birthday in their preferred manner: skiing, staycationing, subscribing to The Verge if you haven’t already, etc.\n\nPrediction: this is going to be a mess\n\nPolitical alliances are rarely permanent, so it’s somewhat predictable that the MAGA-tech bro alliance seems to have fallen apart in the span of a single year. Which side the administration would actually choose, though, was more difficult to foresee.\n\nLast winter, it appeared that two groups were in a tenuous relationship, held together by Elon Musk’s shameless execution of the DOGE agenda and Big Tech signing massive checks to settle Donald Trump’s lawsuits against them. But last night, the Trump administration made a choice: the money. The Commodity Futures Trading Commission (CFTC) announced that they would sue any state who tried to regulate prediction markets like Kalshi — even the Republican states.\n\nOn Tuesday, the CFTC filed an amicus brief to the Ninth Circuit Court of Appeals, officially opposing an onslaught of lawsuits filed by the states against betting markets like Kalshi, Polymarket, Coinbase, and Crypto.com. (The latter two, known primarily as cryptocurrency exchanges, have partnered with Kalshi and created a standalone prediction market called OG, respectively.) But unusually, the brief was accompanied by a threat — posted on X, of all places. In a video directly facing the camera posted on Tuesday night, sole CFTC chairman Michael Selig asserted his commission’s authority to regulate prediction markets and stated that the federal government was prepared to sue: “To those who seek to challenge our authority in this space, let me be clear: we will see you in court.”\n\nHad Selig simply written a staid Wall Street Journal op-ed asserting the CFTC’s authority (which he also did), that would have "
      },
      {
        "title": "Freeform raises $67M Series B to scale up laser AI manufacturing",
        "link": "https://techcrunch.com/2026/02/19/freeform-raises-67m-series-b-to-scale-up-laser-ai-manufacturing/",
        "published": "Thu, 19 Feb 2026 13:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Tech investors haven’t given up on the dream of making physical products with the same speed and ease as coding software.\n\nExecutives at Freeform, a startup developing a novel 3D printing system for metal components, told TechCrunch that the company raised a $67 million Series B to expand its manufacturing platform.\n\nInvestors include Apandion, AE Ventures, Founders Fund, Linse Capital, NVidia’s NVentures , Threshold Ventures, and Two Sigma Ventures. FreeForm declined to disclose the company’s post-financing valuation, which Pitchbook cites as $179 million.\n\nCEO and cofounder Erik Palitsch said the funding would allow the company to upgrade its current GoldenEye printing system, which uses 18 lasers to fuse metal powders into precision components, to a new version. Dubbed Skyfall, the next iteration of the platform would use hundreds of lasers to produce thousands of kilograms of metal parts each day.\n\nThat’s the culmination of a vision Palitsch and co-founder/president Thomas Ronacher launched in 2018. The two met while developing rocket engines at SpaceX, where they found that industrial machines for printing metal components are expensive, finicky, and not well designed for mass manufacturing.\n\nTheir new company would build its platform from the ground up to achieve higher throughput and flexibility, with an emphasis on active software controls. Palitsch says Freeform’s platform is “AI native,” noting a partnership with Nvidia that allows the company to access advanced GPUs.\n\n“I think we’re the only quote-unquote manufacturing company out there that has H200 clusters in a data center on site,” Paltisch told TechCrunch. “What are they doing? We’re running real-time physics-based simulations and learning all the different aspects of the end to end manufacturing workflow.”\n\nTechcrunch event TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, exec"
      },
      {
        "title": "This Defense Company Made AI Agents That Blow Things Up",
        "link": "https://www.wired.com/story/ai-lab-scout-ai-is-using-ai-agents-to-blow-things-up/",
        "published": "Wed, 18 Feb 2026 19:47:15 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Like many Silicon Valley companies today, Scout AI is training large AI models and agents to automate chores. The big difference is that instead of writing code, answering emails, or buying stuff online, Scout AI’s agents are designed to seek and destroy things in the physical world with exploding drones.\n\nIn a recent demonstration, held at an undisclosed military base in central California, Scout AI’s technology was put in charge of a self-driving off-road vehicle and a pair of lethal drones. The agents used these systems to find a truck hiding in the area, and then blew it to bits using an explosive charge.\n\n“We need to bring next-generation AI to the military,” Colby Adcock, Scout AI’s CEO, told me in a recent interview. (Adcock’s brother, Brett Adcock, is the CEO of Figure AI, a startup working on humanoid robots). “We take a hyperscaler foundation model and we train it to go from being a generalized chatbot or agentic assistant to being a warfighter.”\n\nAdcock’s company is part of a new generation of startups racing to adapt technology from big AI labs for the battlefield. Many policymakers believe that harnessing AI will be the key to future military dominance. The combat potential of AI is one reason why the US government has sought to limit the sale of advanced AI chips and chipmaking equipment to China, although the Trump administration recently chose to loosen those controls.\n\n“It's good for defense tech startups to push the envelope with AI integration,” says Michael Horowitz, a professor at the University of Pennsylvania who previously served in the Pentagon as deputy assistant secretary of defense for force development and emerging capabilities. “That's exactly what they should be doing if the US is going to lead in military adoption of AI.”\n\nHorowitz also notes, though, that harnessing the latest AI advances can prove particularly difficult in practice.\n\nLarge language models are inherently unpredictable and AI agents—like the ones that control the popu"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nUS stock futures declined on Thursday due to concerns over a potential US military attack on Iran, which led to a surge in oil prices. Walmart reported strong holiday growth, with quarterly earnings and revenue surpassing expectations, but its earnings outlook fell short of estimates. The company's sales rose nearly 6% in the holiday quarter, driven by gains in e-commerce, advertising, and its third-party marketplace. Meanwhile, Naya Capital Management acquired nearly 1.6 million shares of Masimo, valued at about $203 million. \n\n## Market & Business Implications\n* According to Article 1, contracts on the S&P 500 and the tech-heavy Nasdaq 100 edged down roughly 0.3% and 0.4%, respectively, due to concerns over a potential US military attack on Iran.\n* As stated in Article 2, Walmart's quarterly earnings and revenue surpassed Wall Street's expectations, but its earnings outlook for the full current fiscal year fell short of estimates, with expected net sales to increase by 3.5% to 4.5% and adjusted earnings per share to range from $2.75 to $2.85.\n* Article 3 reports that Walmart's global e-commerce sales climbed 24% in the quarter, including a 27% increase in the US, where online now accounts for 23% of total sales, the highest level in company history.\n* As mentioned in Article 4, Naya Capital Management acquired nearly 1.6 million shares of Masimo, valued at about $203 million, which equals 15.3% of the fund’s 13F assets under management.\n* Article 1 also notes that gold rose back above $5,000 an ounce amid growing worries of a US military attack on Iran.\n\n## Beginner-Friendly Summary\nThe US stock market was a little lower on Thursday because people are worried about a possible war with Iran. This made oil prices go up. A big company called Walmart had good sales during the holiday season, but they don't think they will make as much money as people thought they would. Walmart's sales went up because more people are shopping online. Meanwhile, a company called Naya Capital bought a lot of shares of another company called Masimo.",
    "articles": [
      {
        "title": "Stock market today: Dow, S&P 500, Nasdaq futures edge lower with rate-cut bets, Walmart earnings in focus",
        "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-edge-lower-with-rate-cut-bets-walmart-earnings-in-focus-234005059.html",
        "published": "2026-02-18T23:40:05Z",
        "source": "Yahoo Finance",
        "text": "US stock futures leaned lower on Thursday as US-Iran fears spurred a rally in oil, with Walmart (WMT) earnings and Federal Reserve rate-cut odds in focus.\n\nContracts on the S&P 500 (ES=F) and the tech-heavy Nasdaq 100 (NQ=F) edged down roughly 0.3% and 0.4%, respectively. Dow Jones Industrial Average futures (YM=F) shed 0.3%, following a solid advance across the major benchmarks the previous session.\n\nThe pullback came as oil extended its biggest daily jump since October amid growing worries of a US military attack on Iran. Brent (BZ=F) crude climbed to above $71 a barrel, while West Texas Intermediate (CL=F) was near $66 following an Axios report that the Trump administration is edging toward conflict. Against that backdrop, gold (GC=F) rose back above $5,000 an ounce.\n\nMeanwhile, Treasurys were set for their longest run of losses in a month amid oil-driven inflation concerns. Price pressures were already in focus as investors parsed minutes from the Fed's January policy meeting, which revealed deep divides over the future path of rates.\n\nThe minutes showed some support for rate hikes amid stubbornly high inflation, even as bets on two rate cuts this year persist. A weekly update on jobless claims data and a report on pending home sales could reset expectations on Thursday, ahead of the December PCE inflation reading on Friday.\n\nEarnings continue, with Walmart (WMT) posting a modest quarterly beat but flagging headwinds in its guidance for the year ahead. Shares fell almost 3%.\n\nLIVE\n\n9 updates"
      },
      {
        "title": "Walmart reports strong holiday growth, but earnings outlook falls short of estimates",
        "link": "https://www.cnbc.com/2026/02/19/walmart-wmt-q4-2026-earnings.html",
        "published": "Thu, 19 Feb 2026 13:48:24 GMT",
        "source": "US Top News and Analysis",
        "text": "Walmart said on Thursday that holiday-quarter sales rose nearly 6% and its quarterly earnings and revenue surpassed Wall Street's expectations as gains in e-commerce, advertising and its third-party marketplace boosted its business.\n\nFor the full current fiscal year, Walmart said it expects net sales to increase by 3.5% to 4.5% and adjusted earnings per share to range from $2.75 to $2.85. That earnings outlook fell short of Wall Street's expectations of $2.96 per share, according to LSEG.\n\nIn an interview with CNBC, Chief Financial Officer John David Rainey said speedy deliveries from stores are helping Walmart attract more shoppers, particularly those with higher incomes.\n\n\"Our ability to serve customers at the scale that we have, combined with the speed that we now have, is really translating into continued market share gains,\" he said.\n\nHe said the company's market share gains cut across all incomes, but were larger among upper-income households. For example, with fashion, a category that grew by a mid-single digit percentage in the fourth quarter, almost all of that increase came from households with an annual income over $100,000, he said.\n\nIn the coming months, Rainey said he expects price increases from inflation and President Donald Trump's tariff hikes to ease. Food inflation at Walmart in the fourth quarter was just above 1%, while it was slightly higher for general merchandise, he said.\n\n\"It seems to be a little bit more of a normalized price environment,\" he said. \"I think we have, largely as a retail industry, absorbed or seen the brunt of the impact from tariffs.\"\n\nWhile that comment is welcome news to many U.S. shoppers who buy at the country's largest grocer, it may be too early to say what pricing trends at the retailer mean for the rest of the economy. Though Walmart is viewed as a key barometer for the wider retail industry, it traditionally has had more power than its competitors to keep prices low in part because of its scale.\n\nHere is what the "
      },
      {
        "title": "Walmart customers seeking value drive sales higher",
        "link": "https://www.foxbusiness.com/markets/walmart-earnings-higher-income-shoppers-drive-growth",
        "published": "Thu, 19 Feb 2026 07:50:33 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Walmart posted solid fourth-quarter results Thursday as shoppers continued prioritizing value and convenience, helping push online sales to a record share of the retailer’s business.\n\nThe company reported fiscal fourth-quarter revenue of $190.7 billion, up 5.6% from a year earlier. U.S. comparable sales rose 4.6%, driven by a 2.6% increase in transactions and a 2% increase in the average amount shoppers spent per visit.\n\nGrocery prices were up just 0.6% from a year earlier, with some categories – including eggs and dairy – seeing price declines.\n\nAMAZON PHARMACY TO EXPAND SAME-DAY PRESCRIPTION DELIVERY TO 4,500 US CITIES\n\nGlobal e-commerce sales climbed 24% in the quarter, including a 27% increase in the U.S., where online now accounts for 23% of total sales — the highest level in company history.\n\nGrowth was fueled in part by roughly 50% growth in store-fulfilled delivery, as Walmart expanded faster-delivery options that now reach the vast majority of U.S. households within hours.\n\nThe retailer said it continued to gain market share across income tiers, including higher-income households – a sign that its pricing and convenience strategy is resonating beyond budget-conscious shoppers.\n\nTicker Security Last Change Change % WMT WALMART INC. 126.62 -2.23 -1.73%\n\nCHINESE-MADE TEETHING TOYS SOLD ON AMAZON RECALLED OVER FATAL CHOKING RISK\n\nProfits grew faster than overall sales in the quarter. Adjusted operating income rose about 10%, compared with roughly 5% sales growth. The gains were driven by higher-margin businesses, including advertising and membership programs. Advertising revenue climbed 37% globally, including 41% growth for Walmart Connect in the U.S., while membership fee income increased more than 15%. Together, advertising and membership fees accounted for nearly one-third of operating income in the quarter.\n\nInventory growth remained below the pace of sales growth, reflecting continued supply chain discipline.\n\nLooking ahead, Walmart expects sales to rise "
      },
      {
        "title": "Naya Capital Adds Masimo Shares",
        "link": "https://finance.yahoo.com/news/naya-capital-adds-masimo-shares-134103377.html",
        "published": "2026-02-19T13:41:03Z",
        "source": "Yahoo Finance",
        "text": "According to an SEC filing dated Feb. 18, Naya Capital Management UK Ltd disclosed a new position in Masimo (NASDAQ:MASI), acquiring nearly 1.6 million shares.\n\nInitiated a new position valued at about $203 million\n\nPosition equals 15.3% of the fund’s 13F assets under management\n\nMasimo enters Naya Capital’s portfolio as one of only five reportable holdings\n\nWhat else to know\n\nTop positions after the filing: HUM: $318.4 million (24.0% of AUM) UNH: $301.3 million (22.7% of AUM) WWD: $297.1 million (22.4% of AUM) FWONK: $208.2 million (15.7% of AUM)\n\n\n\nCompany overview\n\nMetric Value Price (as of market close Feb. 18) $175.61 Market capitalization $9.4 billion Revenue (TTM) $1.7 billion Net income (TTM) ($203.8 million)\n\nCompany snapshot\n\nMasimo is a leading provider of advanced noninvasive monitoring solutions, focusing on technologies that improve patient care and operational efficiency in healthcare settings. The company leverages proprietary signal extraction and automation platforms to address critical needs in hospital and outpatient environments.\n\nDevelops and markets noninvasive patient monitoring technologies, including pulse oximetry, brain function monitoring, capnography, regional oximetry, hemodynamic monitoring, and hospital automation platforms.\n\nServes hospitals, emergency medical services, home care providers, long-term care facilities, physician offices, veterinarians, and consumers.\n\nWhat this transaction means for investors\n\nNaya Capital Management only has five disclosed positions in its SEC 13F filing. However, these total over $1.3 billion.\n\nThe firm initiated its position in Masimo in a significant way. Previously owning no shares, it purchased nearly 1.6 million shares during the fourth quarter. These were valued at nearly $203 million.\n\nIt’s Naya Capital’s fifth-largest position, according to its filing. However, it made up 15.3% of its disclosed assets.\n\nThe firm’s confidence came as Masimo’s shares lost 2.6% over the last year through Feb. 1"
      },
      {
        "title": "King Charles' brother Andrew arrested on suspicion of misconduct",
        "link": "https://www.cnbc.com/2026/02/19/prince-andrew-arrest-misconduct-epstein-mountbatten-windsor.html",
        "published": "Thu, 19 Feb 2026 12:37:26 GMT",
        "source": "US Top News and Analysis",
        "text": "FILE PHOTO: Britain's Prince Andrew leaves Westminster Abbey following the coronation ceremony of Britain's King Charles and Queen Camilla, in London, Britain May 6, 2023.\n\nU.K. police on Thursday arrested King Charles' brother Andrew Mountbatten-Windsor on suspicion of misconduct in public office, with the monarch expressing his \"deepest concern\" over the latest development.\n\nBritish police were seen arriving at Andrew's residence in Sandringham on Thursday morning, according to earlier reports from the BBC and the Daily Telegraph.\n\nThames Valley Police said in a statement that they had arrested a man, who they did not name, in his sixties from Norfolk on suspicion of misconduct in public office and are carrying out searches at addresses in Berkshire and Norfolk.\n\n\"Following a thorough assessment, we have now opened an investigation into this allegation of misconduct in public office,\" Assistant Chief Constable Oliver Wright said in the police statement.\n\n\"It is important that we protect the integrity and objectivity of our investigation as we work with our partners to investigate this alleged offence,\" he said, adding: \"We understand the significant public interest in this case, and we will provide updates at the appropriate time.\""
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nPresident Trump has convened the first meeting of the Board of Peace, which has raised $5 billion for Gaza reconstruction. Meanwhile, former Prince Andrew, now known as Andrew Mountbatten-Windsor, has been arrested by UK police on suspicion of \"misconduct in public office\". Over 1,000 Kenyans have been lured to fight for Russia in Ukraine, according to a report to the Kenyan parliament. The Board of Peace meeting will discuss the next steps in the ceasefire deal and the deployment of international troops into Gaza.\n\n## Market & Business Implications\n* President Trump's Board of Peace has raised $5 billion for Gaza reconstruction, as stated in Article 1.\n* The $5 billion commitment is only a fraction of what Gaza needs, according to Article 1.\n* Over 1,000 Kenyans have been lured to fight for Russia in Ukraine, with employment agencies promising them monthly salaries and bonuses, as reported in Article 3.\n* The employment agencies allegedly colluded with \"rogue\" staff from government agencies to prevent interception at Nairobi's international airport, as stated in Article 3.\n* The Board of Peace meeting will discuss the deployment of thousands of international troops into Gaza, as mentioned in Article 1.\n\n## Beginner-Friendly Summary\nThere's a big meeting happening with President Trump and many other important people to talk about peace. They have collected $5 billion to help rebuild a place called Gaza. At the same time, a former prince from the UK has been arrested by the police. Also, many people from Kenya have gone to fight in a war in Ukraine because they were promised jobs and money. These are some of the big news stories happening now.",
    "articles": [
      {
        "title": "Police arrest Ex-Prince Andrew. And, Trump hosts the first Board of Peace meeting",
        "link": "https://www.npr.org/2026/02/19/g-s1-110710/up-first-newsletter-trump-board-of-peace-ukraine-russia-prince-andrew-arrest",
        "published": "Thu, 19 Feb 2026 07:21:31 -0500",
        "source": "NPR Topics: World",
        "text": "Police arrest Ex-Prince Andrew. And, Trump hosts the first Board of Peace meeting\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nPresident Trump convenes the first-ever meeting of the Board of Peace today at the Donald J. Trump U.S. Institute for Peace in Washington. The president says he created the group to oversee his Gaza ceasefire plan and that member states have already pledged $5 billion for Gaza's reconstruction. At today's event, Trump will address heads of state and top diplomats from around 40 countries, including the European Union.\n\ntoggle caption Allison Robbert/AFP via Getty Images\n\n🎧 Today's meeting is significant because the next steps in the ceasefire deal that Trump pushed through last October remain unclear, NPR's Aya Batrawy tells Up First. Additionally, officials could unveil which countries made the initial pledges for reconstruction efforts. The $5 billion commitment is only a fraction of what Gaza needs. The money would go toward the Trump administration's vision for a new Gaza under Israeli control and not to the area where Palestinians are living, Batrawy says. Currently, Israeli forces occupy over half of Gaza, leaving some 2 million Palestinians in dire conditions in a sliver by the sea that Hamas governs. Among the topics that nations could discuss today is a crucial step in Trump's ceasefire plan, which involves the deployment of thousands of international troops into Gaza.\n\nSponsor Message\n\nU.K. police have arrested a man in his 60s on suspicion of \"misconduct in public office.\" U.K. media reports that this man is Andrew Mountbatten-Windsor, formerly known as Prince Andrew. Police have investigated whether Mountbatten-Windsor shared confidential government information with his late friend, convicted sex offender Jeffrey Epstein, while he was U.K.'s trade envoy. Mountbatten-Wind"
      },
      {
        "title": "Modi's AI unity pose turns awkward for Altman and Amodei - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNT3FnTEFHaWNaS0Y3YkNyWnl6blhSQnY1Z3NfNldwOTV6OUt0YThSYld4ZjQ1M0Y5aFVnLWNkZHlpMzVsUklXTUp4azgtelZyaXU5TEhicmEwc2paTUtGSWlwd3JjdmJKY1lYMmotZjNtTnJJM1RZY041LVNzamJhbGZFc0JEQU0wUWFsaHVQdGxlNEwyNVczYjFmSDNHSGhrbHVXNnNKRzJHQQ?oc=5",
        "published": "Thu, 19 Feb 2026 10:13:18 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "More than 1,000 Kenyans lured to fight for Russia in Ukraine war, report says",
        "link": "https://www.theguardian.com/world/2026/feb/19/kenyan-soldiers-russia-ukraine-war-intelligence-report",
        "published": "Thu, 19 Feb 2026 13:01:34 GMT",
        "source": "World news | The Guardian",
        "text": "More than 1,000 Kenyans have been lured to fight for Russia in its war with Ukraine, according to an intelligence report to the Kenyan parliament that highlights the scale of a Russian operation taking African men to the frontline.\n\nThe majority leader of Kenya’s national assembly, Kimani Ichung’wah, said “rogue recruitment agencies and individuals in Kenya” were continuing to send Kenyan nationals to fight in the conflict, as he read MPs the summary of an investigation by Kenya’s National Intelligence Service.\n\nThe figure of more than 1,000 individuals is a significant increase on the number given in a statement by Kenya’s foreign affairs ministry in November, which said that more than 200 Kenyans had travelled to fight in the war.\n\nA growing number of people from African countries – including Kenya, Uganda and South Africa – and elsewhere have been lured to the frontline as Russia seeks manpower to sustain its invasion. Ukraine’s foreign minister, Andrii Sybiha, said in November that more than 1,400 people from 36 African countries were fighting for Russia in Ukraine. Many are being held by Ukraine as prisoners of war.\n\nAccording to the intelligence report, Ichung’wah said, “rogue” employment agencies were targeting former military personnel and police officers and civilians from their mid-20s to 50 years old “who are desperate for job opportunities abroad”.\n\nThe employment agencies were enticing Kenyans by promising them monthly salaries of about 350,000 shillings (£2,000), bonuses of between 900,000 shillings and 1.2m shillings, and “eventually” receiving Russian citizenship, the report said.\n\nIt also accused the employment agencies of colluding with “rogue” staff from several government agencies – the Directorate of Immigration Services, the Directorate of Criminal Investigations and its Anti-Narcotics Unit, and the National Employment Authority – to prevent interception at Nairobi’s international airport, Ichung’wah said.\n\nBut, he added, the report said that b"
      },
      {
        "title": "Why has Andrew Mountbatten-Windsor been arrested?",
        "link": "https://www.bbc.com/news/articles/cn9e1q4797wo?at_medium=RSS&at_campaign=rss",
        "published": "Thu, 19 Feb 2026 14:07:06 GMT",
        "source": "BBC News",
        "text": "He said they will be able to \"carry out searches of any premises he owns or occupies, or any other premises he controls, so there may well be searches in other areas as well\"."
      },
      {
        "title": "President Trump's Board of Peace will meet for the first time Thursday",
        "link": "https://www.npr.org/2026/02/19/nx-s1-5718166/president-trumps-board-of-peace-will-meet-for-the-first-time-thursday",
        "published": "Thu, 19 Feb 2026 06:56:53 -0500",
        "source": "NPR Topics: World",
        "text": "President Trump's Board of Peace will meet for the first time Thursday As President Trump's Board of Peace prepares to meet for the first time Thursday, he says the group has raised $5 billion for Gaza reconstruction. But key challenges remain.\n\nWorld President Trump's Board of Peace will meet for the first time Thursday President Trump's Board of Peace will meet for the first time Thursday Listen · 4:13 4:13 As President Trump's Board of Peace prepares to meet for the first time Thursday, he says the group has raised $5 billion for Gaza reconstruction. But key challenges remain. Sponsor Message Sponsor Message"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nDemocrats are exploring a proposal to cap grocery prices, with a think tank suggesting a two-year freeze on certain food items. Walmart has reported solid fourth-quarter results, driven by shoppers prioritizing value and convenience. New Balance has seen a 19% surge in sales, outperforming the global footwear market and taking share from competitors like Nike. Additionally, tech companies are building their own private power plants to support data centers, creating a shadow power grid across the US.\n\n## Market & Business Implications\n* The Center for American Progress has proposed a two-year freeze on the prices of 22 food items, with grocers voluntarily agreeing to cap costs in exchange for lower credit card transaction fees (Article 1).\n* Walmart's fiscal fourth-quarter revenue rose 5.6% to $190.7 billion, with US comparable sales increasing 4.6% and online sales reaching a record share of the retailer's business (Article 2).\n* New Balance sales grew 19% last year to $9.2 billion, with the company aiming to reach $10 billion in annual revenue by the end of the year (Article 4).\n* Tech companies such as Meta, OpenAI, and Oracle are developing off-grid data center projects, which could power entire cities and increase US emissions of carbon dioxide and other air pollutants (Article 5).\n\n## Beginner-Friendly Summary\nThere's a new idea to help lower food prices. A big store called Walmart is doing well because people want to save money. A shoe company called New Balance is selling a lot of shoes and doing better than some other companies. Also, big tech companies are building their own power plants to help run their computers and data centers.",
    "articles": [
      {
        "title": "Democrats revive a once-taboo idea: Capping grocery prices",
        "link": "https://www.washingtonpost.com/business/2026/02/19/price-freeze-groceries-inflation/",
        "published": "Thu, 19 Feb 2026 10:30:52 +0000",
        "source": "Business",
        "text": "As voters keep indicating that grocery prices are a top concern, Democrats are exploring a new idea for what the government could do to bring down the cost of food. But the proposal itself shows how hard it is to reduce food prices in a politically palatable — or financially feasible — way.\n\nOn Thursday, the Center for American Progress, a prominent left-leaning think tank that often cultivates policy ideas later adopted by the Democratic Party, proposed a two-year freeze on the prices of 22 food items, such as strawberries and steak.\n\nGrocers would voluntarily agree to capping the cost of food in exchange for paying lower fees on credit card transactions, according to the proposal, which was written by a group led by Jared Bernstein, who chaired the White House Council of Economic Advisers during Joe Biden’s presidency.\n\nThat, in effect, would force credit card companies to absorb the cost of subsidizing food purchases, a highly unusual arrangement. A draft of the proposal said the Federal Reserve could force credit card companies to do so via its regulatory oversight, though that provision was removed after questions from The Washington Post.\n\nIt is not clear how else the government might persuade credit card companies to foot the bill, nor how many grocers would agree. Ask The Post AIDive deeper\n\n“We’re focused on an affordability policy where people’s paychecks have a chance to catch up to grocery prices that spiked in 2021 and 2022,” Bernstein said. “Even if grocery inflation has come down, which it has, the level of grocery prices is still causing sticker shock.”\n\nFood prices have been a major complaint for consumers since the 2022 inflation spike. Since 2020, the cost of bread is up 32 percent, lettuce 39 percent, mayonnaise 50 percent, and coffee 80 percent, for example, compared with a 29 percent rise in wages.\n\nRepublicans and Democrats have pledged to address grocery bills. President Donald Trump ran in 2024 promising to bring down grocery prices “on day "
      },
      {
        "title": "Walmart customers seeking value drive sales higher",
        "link": "https://www.foxbusiness.com/markets/walmart-earnings-higher-income-shoppers-drive-growth",
        "published": "Thu, 19 Feb 2026 07:50:33 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Walmart posted solid fourth-quarter results Thursday as shoppers continued prioritizing value and convenience, helping push online sales to a record share of the retailer’s business.\n\nThe company reported fiscal fourth-quarter revenue of $190.7 billion, up 5.6% from a year earlier. U.S. comparable sales rose 4.6%, driven by a 2.6% increase in transactions and a 2% increase in the average amount shoppers spent per visit.\n\nGrocery prices were up just 0.6% from a year earlier, with some categories – including eggs and dairy – seeing price declines.\n\nAMAZON PHARMACY TO EXPAND SAME-DAY PRESCRIPTION DELIVERY TO 4,500 US CITIES\n\nGlobal e-commerce sales climbed 24% in the quarter, including a 27% increase in the U.S., where online now accounts for 23% of total sales — the highest level in company history.\n\nGrowth was fueled in part by roughly 50% growth in store-fulfilled delivery, as Walmart expanded faster-delivery options that now reach the vast majority of U.S. households within hours.\n\nThe retailer said it continued to gain market share across income tiers, including higher-income households – a sign that its pricing and convenience strategy is resonating beyond budget-conscious shoppers.\n\nTicker Security Last Change Change % WMT WALMART INC. 126.62 -2.23 -1.73%\n\nCHINESE-MADE TEETHING TOYS SOLD ON AMAZON RECALLED OVER FATAL CHOKING RISK\n\nProfits grew faster than overall sales in the quarter. Adjusted operating income rose about 10%, compared with roughly 5% sales growth. The gains were driven by higher-margin businesses, including advertising and membership programs. Advertising revenue climbed 37% globally, including 41% growth for Walmart Connect in the U.S., while membership fee income increased more than 15%. Together, advertising and membership fees accounted for nearly one-third of operating income in the quarter.\n\nInventory growth remained below the pace of sales growth, reflecting continued supply chain discipline.\n\nLooking ahead, Walmart expects sales to rise "
      },
      {
        "title": "Warmer weather hits profits at British Gas owner",
        "link": "https://www.bbc.com/news/articles/cz7g9ge2lr2o?at_medium=RSS&at_campaign=rss",
        "published": "Thu, 19 Feb 2026 10:52:16 GMT",
        "source": "BBC News",
        "text": "But announcing its full-year results, the company announced it would pause its share buyback programme to focus on investing in the business, including allocating more money to projects including the Sizewell C nuclear power in Suffolk."
      },
      {
        "title": "Why New Balance's 'dad shoes' are beating Nike as sales surge 19%",
        "link": "https://www.cnbc.com/2026/02/19/new-balance-2025-sales-jump-19percent-as-brand-takes-share-from-nike.html",
        "published": "Thu, 19 Feb 2026 13:30:01 GMT",
        "source": "Business News",
        "text": "In this article NKE Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nNew Balance sales grew 19% last year to $9.2 billion as the legacy sneaker giant continued to outperform the global footwear market and take share from floundering competitors like Nike . The 120-year-old Boston-based footwear brand, which is private, exclusively shared its 2025 results with CNBC. In addition to the sharp 2025 growth, the retailer said it could reach its goal of $10 billion in annual revenue by the end of the year. \"We're competitive. No question about it. But we want to make sure that as we get there and surpass it, that the quality of our business is first and foremost,\" CEO Joe Preston told CNBC in an interview. \"We don't want empty calories here. We want to make sure that we are delivering upon the premise that we have, which is to become a premium brand. Over the past five years, we've done exactly that around the globe.\"\n\nJeremy Moeller | Getty Images News | Getty Images\n\nSince 2020, New Balance has grown sales by a staggering 180%, placing it among a handful of standout competitors that supersized their businesses as Nike changed its business model and lost significant market share. During the Covid-19 pandemic, Nike doubled down on its direct selling strategy that cut off longtime wholesale suppliers so the sneaker giant could grow through its own website and stores. While the strategy briefly boosted sales and promised higher margins, it opened up critical shelf space at strategic retailers that companies like New Balance, Brooks Running, On and Deckers rushed to fill.\n\nWith so much focus on building out a direct selling model, which can be more complex than distributing to wholesalers, Nike also fell behind on innovation and lost its edge in the performance footwear market. That created further opportunity for competitors like New Balance. Nike's former CEO, John Donahoe, previously blamed remote work during the pandemic for the retailer's innovation slowdown, "
      },
      {
        "title": "Silicon Valley is building a shadow power grid for data centers across the U.S.",
        "link": "https://www.washingtonpost.com/business/2026/02/19/data-centers-power-grid-ai/",
        "published": "Thu, 19 Feb 2026 10:00:00 +0000",
        "source": "Business",
        "text": "The GW Ranch project approved on 8,000 windswept acres of West Texas will look like many of the other data centers that have sprung up across the country to support Silicon Valley’s ambitions for artificial intelligence. Dozens of airplane-hangar-size warehouses packed with computing hardware will consume more power than all of Chicago.\n\nBut it’s missing one standard feature: The mammoth project, recently green-lit by state environmental regulators, won’t need new power lines to deliver the electricity that it guzzles. GW Ranch will be walled off from the power grid and generate its own electricity from natural gas and solar plants installed on site.\n\nGW Ranch is set to become part of a shadow power grid emerging across the country with potentially far-reaching consequences for the U.S. electricity system and environment.\n\nAfter the rapid growth of data centers triggered pushback from politicians, utilities and local residents over the pressures they place on the grid, tech companies are now building their own fleet of private power plants, mostly fueled by natural gas.\n\nDozens of sprawling off-grid data center projects are planned across Texas, New Mexico, Pennsylvania, Wyoming, Utah, Ohio and Tennessee, according to a review of regulatory filings, permits, earnings call transcripts and other documents by the energy industry research firm Cleanview. Several are already under construction.\n\nCompanies rushing to develop the facilities include Meta, ChatGPT-maker OpenAI, business software provider Oracle and oil giant Chevron. (The Washington Post has a content partnership with OpenAI.)\n\nThe off-grid projects already approved by state energy and environmental regulators could power all of New York City several times over, a vast new energy infrastructure that will bring huge new industrial facilities to communities across the country and increase U.S. emissions of carbon dioxide and other air pollutants. A handful of states have passed laws to encourage off-grid data "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market experienced a decline, with the Dow falling after a surprise in jobless claims. Wayfair reported its first annual sales gain since 2020, with revenue growing 5.1% to $12.5 billion, but its shares dropped over 10% in premarket trading. Walmart reported strong holiday growth, with sales rising nearly 6%, but its earnings outlook fell short of estimates. Analog Devices was upgraded by Needham, with the firm citing improving operating trends and strong quarterly results.\n\n## Market & Business Implications\n* Wayfair's annual sales grew 5.1% to $12.5 billion in 2025, with the company beating Wall Street's expectations on the top and bottom lines for its fourth quarter (Article 2).\n* Walmart's holiday-quarter sales rose nearly 6%, with the company's quarterly earnings and revenue surpassing Wall Street's expectations (Article 4).\n* Needham upgraded Analog Devices to Buy from Hold, citing improving operating trends, strong quarterly results, and rising demand across key end markets (Article 5).\n* Wayfair's shares dropped more than 10% in premarket trading despite the company's strong sales growth and better-than-expected results (Article 2).\n* Walmart expects net sales to increase by 3.5% to 4.5% for the full current fiscal year, with adjusted earnings per share ranging from $2.75 to $2.85 (Article 4).\n\n## Beginner-Friendly Summary\nThe stock market had a bad day because of some unexpected news about jobless claims. A company called Wayfair had a good year, with more sales than the year before, but its stock price went down. Another company, Walmart, had a good holiday season with more sales, but it doesn't think it will make as much money as people thought. A company called Analog Devices is doing well and some people think its stock price will go up.",
    "articles": [
      {
        "title": "Stock Market Today: Dow Falls After Surprise Jobless Claims; Carvana Dives On Earnings (Live Coverage)",
        "link": "https://finance.yahoo.com/m/9e3bb4c8-8cbc-36ae-813a-4288622e532b/stock-market-today%3A-dow-falls.html?.tsrc=rss",
        "published": "Thu, 19 Feb 2026 14:01:21 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "How to get approved"
      },
      {
        "title": "Wayfair posts first annual sales gain since 2020, outperforms overall furniture market",
        "link": "https://www.cnbc.com/2026/02/19/wayfair-w-earnings-q4-2025.html",
        "published": "Thu, 19 Feb 2026 13:34:58 GMT",
        "source": "Earnings",
        "text": "Wayfair 's annual sales grew last year for the first time since 2020 as the online furniture company continues to win over value-seeking consumers, the retailer announced Thursday.\n\nIn 2025, Wayfair revenue grew 5.1% to $12.5 billion. The gains follow a more than 1% year-over-year decline in 2024.\n\nThe e-commerce giant also beat Wall Street's expectations on the top and bottom lines for its fourth quarter and delivered better-than-expected adjusted earnings as stronger sales flowed through to the business.\n\n\"Q4 capped off a tremendous year for Wayfair,\" co-founder and CEO Niraj Shah said in a release. \"We had our third consecutive quarter of new customer growth, on top of healthy growth in repeat orders, all in the face of a category that contracted in the low single digits for the final quarter of the year. 2025 was a year where we returned to growth and accelerated throughout the year through a number of organic business strategies that can compound for years to come.\"\n\nDespite the sales growth and better-than-expected results, Wayfair shares dropped more than 10% in premarket trading Thursday.\n\nHere's how Wayfair did in its fourth quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\nEarnings per share: 85 cents adjusted vs. 66 cents expected\n\n85 cents adjusted vs. 66 cents expected Revenue: $3.34 billion vs. $3.30 billion expected\n\nIn the three-month period that ended Dec. 31, Wayfair reported a loss of $116 million, or 89 cents per share, compared with a loss of $128 million, or $1.02 per share, a year earlier. Excluding one-time items related to equity-based compensation and other nonrecurring charges, Wayfair saw earnings per share of 85 cents.\n\nFor the second quarter in a row, Wayfair had a meaningful gain in revenue. During the period, sales rose to $3.34 billion, up about 7% from $3.12 billion a year earlier.\n\nWhile Wayfair has not posted an annual net profit since 2020, it is making gains in its adjusted earnings"
      },
      {
        "title": "AI Jobs Disruption Is Here. What It Means For The S&P 500 And You.",
        "link": "https://finance.yahoo.com/m/9f85587c-9047-3d89-8154-b3849d8a74b8/ai-jobs-disruption-is-here..html?.tsrc=rss",
        "published": "Thu, 19 Feb 2026 13:59:03 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "AI Jobs Disruption Is Here. What It Means For The S&P 500 And You.\n\nAI Jobs Disruption Is Here. What It Means For The S&P 500 And You. · Investor's Business Daily"
      },
      {
        "title": "Walmart reports strong holiday growth, but earnings outlook falls short of estimates",
        "link": "https://www.cnbc.com/2026/02/19/walmart-wmt-q4-2026-earnings.html",
        "published": "Thu, 19 Feb 2026 14:09:20 GMT",
        "source": "Earnings",
        "text": "Walmart said on Thursday that holiday-quarter sales rose nearly 6% and its quarterly earnings and revenue surpassed Wall Street's expectations as gains in e-commerce, advertising and its third-party marketplace boosted its business.\n\nFor the full current fiscal year, Walmart said it expects net sales to increase by 3.5% to 4.5% and adjusted earnings per share to range from $2.75 to $2.85. That earnings outlook fell short of Wall Street's expectations of $2.96 per share, according to LSEG.\n\nIn an interview with CNBC, Chief Financial Officer John David Rainey said speedy deliveries from stores are helping Walmart attract more shoppers, particularly those with higher incomes.\n\n\"Our ability to serve customers at the scale that we have, combined with the speed that we now have, is really translating into continued market share gains,\" he said.\n\nHe said the company's market share gains cut across all incomes, but were larger among upper-income households. For example, with fashion, a category that grew by a mid-single digit percentage in the fourth quarter, almost all of that increase came from households with an annual income over $100,000, he said.\n\nIn the coming months, Rainey said he expects price increases from inflation and President Donald Trump's tariff hikes to ease. Food inflation at Walmart in the fourth quarter was just above 1%, while it was slightly higher for general merchandise, he said.\n\n\"It seems to be a little bit more of a normalized price environment,\" he said. \"I think we have, largely as a retail industry, absorbed or seen the brunt of the impact from tariffs.\"\n\nWhile that comment is welcome news to many U.S. shoppers who buy at the country's largest grocer, it may be too early to say what pricing trends at the retailer mean for the rest of the economy. Though Walmart is viewed as a key barometer for the wider retail industry, it traditionally has had more power than its competitors to keep prices low in part because of its scale.\n\nHere is what the "
      },
      {
        "title": "Needham upgrades Analog Devices, says shares have ‘additional room to run’",
        "link": "https://finance.yahoo.com/news/needham-upgrades-analog-devices-says-135038511.html?.tsrc=rss",
        "published": "Thu, 19 Feb 2026 13:50:38 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Investing.com -- Analog Devices was upgraded by Needham & Company in a note on Thursday, with the firm highlighting improving operating trends, strong quarterly results and rising demand across key end markets that should continue to lift earnings and the share price.\n\nNeedham analyst N. Quinn Bolton raised the stock to Buy from Hold, arguing that the firm “can no longer justify remaining on the sidelines” following better-than-expected fiscal first-quarter results and guidance that was “meaningfully above expectations.”\n\nHe noted that while shares have surged 44.7% since ADI’s fourth-quarter 2025 earnings, compared with 2.6% for the S&P 500, several catalysts support further upside. Needham set a $400 price target on the stock, based on a 30-times multiple of its 2027 earnings estimate.\n\nBolton wrote that “customers appear to have moved through the digestion phase,” with orders now more closely aligned with consumption trends.\n\nHe added that ADI’s core industrial business, excluding automated test equipment and aerospace and defense, remains “20% below prior peak levels,” leaving room for recovery as bookings strengthen.\n\nNeedham also cited the absence of any restocking to date, saying “a restocking cycle is still in front of the company,” while improved pricing and expanding exposure to data center and AI applications, roughly 20% of sales, continue to support growth.\n\nIndustrial revenue rose about 5% quarter over quarter, with ATE and aerospace and defense delivering record results, Needham said. The firm expects industrial revenue to rise more than 20% in the second quarter, led by ATE.\n\nAutomotive trends remain softer in the first half, but Needham said the segment should return to year-over-year growth in the second half of fiscal 2026.\n\nRelated articles\n\nNeedham upgrades Analog Devices, says shares have ‘additional room to run’\n\nThese 2 stocks are best positioned to benefit from higher uranium prices: analyst\n\nThis sector is 'poised for a big, beautiful year'"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nVoltage has launched a USD-settled Bitcoin Lightning credit line for businesses, allowing them to send payments with instant finality while repaying in US dollars. OpenAI and Paradigm have released a benchmarking framework to evaluate AI agents in detecting vulnerabilities in Ethereum smart contracts. Deutsche Börse views tokenization as an evolution, not a threat, and is positioning itself to integrate tokenized and traditional assets. The European Central Bank is considering introducing euro-pegged stablecoins to provide low-cost payments and counter the threat of dollarization. Google searches for \"Bitcoin going to zero\" have surged to their highest level since 2022.\n\n## Market & Business Implications\n* Voltage has announced the launch of Voltage Credit, a programmatic revolving line of credit designed for businesses to send payments with Lightning-style instant finality (Article 1).\n* OpenAI and Paradigm have jointly released EVMbench, an open benchmarking framework that evaluates AI agents in detecting vulnerabilities in Ethereum smart contracts (Article 2).\n* Deutsche Börse is integrating tokenized assets, including the recent addition of Kraken-backed xStocks, to create a unified trading environment (Article 3).\n* The European Central Bank is considering introducing euro-pegged stablecoins to provide low-cost payments and counter the threat of dollarization (Article 4).\n* Google searches for \"Bitcoin going to zero\" have surged to their highest level since 2022, amid a decline in Bitcoin's price (Article 5).\n\n## Beginner-Friendly Summary\nSome big companies are working on new ways to use cryptocurrency. One company, Voltage, is helping businesses send payments quickly. Another company, OpenAI, is working with Paradigm to make sure cryptocurrency transactions are safe. A big exchange, Deutsche Börse, is combining traditional and cryptocurrency markets. The European Central Bank is thinking about creating a new kind of cryptocurrency to help with payments. People are also searching online to see if Bitcoin is going to be worth nothing, which is happening because its price has gone down.",
    "articles": [
      {
        "title": "Voltage rolls out USD-settled Bitcoin Lightning credit line for businesses",
        "link": "https://cointelegraph.com/news/voltage-launches-usd-settled-credit-line-bitcoin?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Thu, 19 Feb 2026 14:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "Bitcoin infrastructure company Voltage has announced the launch of Voltage Credit, a programmatic revolving line of credit designed to let businesses send payments with Lightning-style instant finality while still repaying the credit line in US dollars from a standard bank account or in Bitcoin.\n\nIn a Thursday release shared with Cointelegraph, the company, which provides enterprise-grade solutions for regulated businesses, said it was targeting chief financial officers and treasurers who wanted “send now, pay later” flexibility on the fastest payment rails available, without having to hold crypto on their balance sheet.\n\nRather than positioning it as just another Lightning-backed loan, Voltage pitched the product as an embedded piece of the payment flow, and the “first revolving line of credit that delivers instant payment finality and the capability to settle entirely in USD.”\n\nCEO Graham Krizek told Cointelegraph that while players like Stripe and Block blended faster payments with working capital, they didn’t embed a revolving credit facility directly into Lightning payments in the way Voltage does, adding that Stripe did not support Lightning at all.\n\nRelated: Stripe-owned Bridge gets OCC conditional approval for national bank charter\n\nIn the Block model, he said, Lightning and credit remain separate workflows, whereas Voltage lets businesses originate credit and immediately use it to send or receive Lightning and stablecoin payments in real time, without pre-funding or manual treasury movements.\n\nUnderwriting against payment flows, not static BTC collateral\n\nVoltage said it departs from traditional crypto lending by underwriting against payment flows rather than static Bitcoin (BTC) collateral.\n\nBecause Voltage already powers the underlying Bitcoin and Lightning infrastructure, it can size and adjust credit limits based on the volume a business processes through its platform.\n\n“Voltage Credit is the lender of record in our platform,” Krizek said, noting that t"
      },
      {
        "title": "Morning Minute: OpenAI and Paradigm Turn Focus to Smart Contracts",
        "link": "https://decrypt.co/358569/morning-minute-openai-and-paradigm-turn-focus-to-smart-contracts",
        "published": "Thu, 19 Feb 2026 13:31:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nCreate an account to save your articles.\n\nCreate an account to save your articles.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors fall 1-2% amidst Iran escalations; BTC at $66.6k\n\nCoinbase’s Base announced it’s dropping the OP stack for its own unified client (OP -23%)\n\nBrian Armstrong called the looming quantum risk a “solvable issue” for crypto\n\nHyperliquid launched its Hyperliquid Policy Center with $29M for DC advocacy\n\nMegaETH introduced its World Markets as first DEX to unify spot trading, lending and perps all onchain with cross margin\n\n🖥️ OpenAI and Paradigm Turn Focus to Smart Contracts\n\nSmart contracts have lost billions to exploits.\n\nNow the world’s most powerful AI lab and crypto’s most respected research firm are building the tools to end that.\n\n📌 What Happened\n\nOpenAI and Paradigm jointly released EVMbench yesterday, an open benchmarking framework that evaluates AI agents across three modes:\n\ndetecting vulnerabilities in Ethereum smart contracts\n\npatching them\n\nactively exploiting them.\n\nThe benchmark draws on 120 curated high-severity vulnerabilities pulled from 40 real-world audits, mostly sourced from Code4rena competitive audit contests. It also includes scenarios from the security audit of Stripe’s Tempo, the payments-focused L1 built with input from Visa, Shopify, and OpenAI.\n\nWhen Paradigm started this project, top models could exploit fewer than 20% of critical bugs. That number is now above 70%.\n\nOpenAI also expanded the private beta of Aardvark, its dedicated security research agent, and committed $10M in API credits through its Cybersecurity Grant Program to support defensive crypto research.\n\n🗣️ What They’re Saying\n\nParadigm, from their EVMbench release: “It’s now clear to"
      },
      {
        "title": "Deutsche Börse exec says tokenization is an evolution, not a threat",
        "link": "https://cointelegraph.com/news/deutsche-borse-tokenization-evolution-not-a-threat?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Thu, 19 Feb 2026 13:35:49 +0000",
        "source": "Cointelegraph.com News",
        "text": "A Deutsche Börse Group executive said tokenization is a natural evolution of market infrastructure, not a threat to traditional markets, and added that the exchange operator is positioning itself to integrate tokenized and traditional assets.\n\nCarlo Kölzer, head of digital assets at Deutsche Börse and CEO of the group’s trading platform 360T, expressed a bullish outlook on real-world (RWA) asset tokenization, forecasting a future in which digital and traditional markets operate in a closely linked ecosystem.\n\n“Our role as Deutsche Börse Group is not just to build a bridge between two separate worlds, but to create a truly hybrid market,” Kölzer told Cointelegraph, describing the company’s vision for a unified trading environment.\n\nThe comments came shortly after 360T integrated Kraken-backed xStocks, a major tokenized equity platform, on Feb. 9, enabling clients to trade tokenized shares of companies including Nvidia, Google and Circle.\n\nThe role of traditional market infrastructures is crucial\n\n“Tokenization enhances capital market flexibility and efficiency, not by making traditional market infrastructures obsolete, but by transforming how they deliver their core functions,” Kölzer said, adding:\n\n“In a tokenized environment, trusted institutions remain essential for risk management, supervision, and ensuring orderly markets, with technology demanding even greater resilience and transparency.”\n\nDeutsche Börse views the shift as a strategic evolution and does not see it as a threat.\n\n“For us, tokenization is an opportunity to pioneer new models and guide the market’s transformation while bringing the same trust and confidence we bring to our markets today,” he said.\n\nTokenization-linked risks and regulatory concerns\n\nAs tokenized assets continue to expand, with the market up about 18% year-to-date, some analysts have reiterated concerns about the backing of commodity-based RWAs and stablecoins.\n\nCritics have also pointed to a lack of clear regulatory frameworks acro"
      },
      {
        "title": "Bundesbank President Wants Euro-Pegged Stablecoins to Prevent Dollarization",
        "link": "https://decrypt.co/358563/bundesbank-president-wants-euro-pegged-stablecoins-to-prevent-dollarization",
        "published": "Thu, 19 Feb 2026 12:57:53 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief The ECB’s Joachim Nagel has said that euro-denominated stablecoins could provide fast and cheap remittances, while also countering any risk of dollarization from USD-pegged stablecoins.\n\nThe ECB is aiming to introduce a digital euro by 2029, with work already underway on a wholesale central bank digital currency.\n\nSome commentators suggest that, given the downsides of stablecoins, tokenized deposits may be a better way of preventing dollarization.\n\nEuro-pegged stablecoins could provide low-cost payments and counter the threat of dollarization from USD-pegged counterparts, according to European Central Bank Governing Council member Joachim Nagel.\n\nSpeaking at the American Chamber of Commerce in Germany earlier this week, Nagel—who is also the President of the German Bundesbank—addressed how Europe might adapt to its changing relationship with the United States.\n\nOne of his proposals was to “channel efforts into supporting the international role of the euro,” which would include developing European payment systems.\n\nAnd for Nagel, this could mean introducing euro-denominated stablecoins, “as they can be used for cross-border payments by individuals and firms at low cost.”\n\nNot only could such euro-based stablecoins provide cheaper remittances and payments, but Nagel suggested last week that such stablecoins could protect against the dollarization of the Eurozone.\n\n“A hypothetical replacement of a domestic currency with [USD-pegged] stablecoins would be equivalent to a dollarisation of the corresponding economy,” he said. “In this scenario, the effectiveness of domestic monetary policy could be severely impaired, not to mention that European sovereignty could be weakened.”\n\nIn the face of this risk, Nagel said last week that the ECB and European central banks are considering new technological opportunities, with one of these being a wholesale CBDC, which would enable “institutional act"
      },
      {
        "title": "Google searches for ‘Bitcoin going to zero’ at highest since 2022",
        "link": "https://cointelegraph.com/news/bitcoin-going-to-zero-searches-spike-extreme-fear?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Thu, 19 Feb 2026 13:16:15 +0000",
        "source": "Cointelegraph.com News",
        "text": "Google searches for “Bitcoin going to zero” have surged to their highest level since the post‑FTX panic in November 2022, according to Google Trends data for the past five years.\n\nThe spike aligns with Bitcoin’s latest drawdown from its Oct. 6, 2025, all‑time high near $126,000 to about $66,500 at the time of writing on Thursday, according to data from CoinGecko, leaving the asset almost 50% below its peak.\n\nAt the same time, the Bitcoin Fear and Greed Index has plunged into extreme fear around 9, levels previously seen during the Terra ecosystem collapse and the FTX fallout in 2022.\n\nGoogle Trends shows that worldwide interest in the phrase “Bitcoin going to zero” last hit comparable levels in early November 2022, when FTX froze withdrawals, and Bitcoin (BTC) crashed to around $15,000.\n\nGoogle searches for “Bitcoin going to zero.” Source: Google Trends\n\nToday’s Bitcoin fears different from 2022\n\nCrypto intelligence platform Perception analyzed narrative intelligence across 650+ crypto media sources and shared its findings with Cointelegraph.\n\nFounder Fernando Nikolic said that fear in 2022 was driven by internal events, such as cascading failures of centralized lenders and one of the industry’s largest exchanges, while today’s fear is “driven by macro fears and being amplified by a single bearish voice.”\n\nRelated: Bitcoin passes $69K on slower US CPI print, but Fed rate-cut odds stay low\n\nNikolic said that Bloomberg’s Mike McGlone has been the loudest single voice driving the “Bitcoin could go to zero (or near-zero)” narrative, and that he has been a “one-man content machine this cycle,” calling Bitcoin to $10,000 on Feb. 3, saying markets were headed for a 2008-style crash and continuously calling for Bitcoin’s decline throughout the past month.\n\nHe told Cointelegraph that McGlone is repeatedly amplified by crypto media sites and has “essentially been the go-to bearish quote for the past three weeks.” “This media saturation likely contributes directly to the Googl"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-19T14:10:04.997591+00:00"
  }
}