{
  "Tech": {
    "summary": "## Executive Summary\nOpenAI has found significant traction in India, with 18 to 24-year-olds accounting for nearly 50% of ChatGPT usage in the country. Nintendo has released a Virtual Boy accessory for the Switch, allowing players to experience classic Virtual Boy games. Research has shown that password managers' claims of being \"zero knowledge\" may not always be true. Additionally, new products such as coffee grinders have been reviewed and ranked. \n\n## Market & Business Implications\n* OpenAI's ChatGPT has seen significant adoption in India, with 80% of users under 30, and the company offers a sub-$5 subscription tier in the country (Article 1).\n* Nintendo has released a Virtual Boy accessory for the Switch, priced at $100, and a cheaper cardboard headset for $25 (Article 2).\n* Research has found that password managers' \"zero knowledge\" claims may not always be true, particularly when account recovery is in place or password managers are set to share vaults (Article 4).\n* The best coffee grinders have been reviewed and ranked, with options ranging from $100 to $1,500 (Article 5).\n\n## Beginner-Friendly Summary\nOpenAI's ChatGPT is very popular in India, especially among young people. Nintendo has made a new accessory for the Switch that lets people play old Virtual Boy games. Some password managers might not be as secure as they claim. There are also new coffee grinders available, with different prices and features.",
    "articles": [
      {
        "title": "OpenAI says 18 to 24-year-olds account for nearly 50% of ChatGPT usage in India",
        "link": "https://techcrunch.com/2026/02/20/openai-says-18-to-24-year-olds-account-for-nearly-50-of-chatgpt-usage-in-india/",
        "published": "Fri, 20 Feb 2026 13:57:03 +0000",
        "source": "TechCrunch",
        "text": "OpenAI seems to have found product-market fit with young Indians. The company said on Friday that users between 18 and 24 years of age accounted for nearly 50% of messages sent to ChatGPT in the country, and users under 30 accounted for 80%.\n\nThe AI lab said Indians use ChatGPT mostly for work, with 35% of all messages relating to professional tasks, compared to 30% globally.\n\nIn particular, the company’s coding assistant, Codex, is seeing strong traction: OpenAI said Indians use Codex three times more than the global median, and weekly usage has increased by four times since the tool got a Mac app two weeks ago. Users in India are also asking three times as many coding-related questions as the median.\n\nThis is in line with findings from Antropic, which earlier this week said 45.2% of Claude’s tasks map to software-related use cases in India.\n\nOpenAI said outside of work tasks, 35% of messages to ChatGPT from Indians requested guidance, 20% concerned questions about general information, and 20% were requests for the bot to produce or help with writing.\n\nIndia is OpenAI’s second-largest market with more than 100 million weekly users, and the company has been actively trying to court Indians for its AI tools and services. The company offers a sub-$5 subscription tier in the country, and last year even ran promotional campaigns to spur adoption.\n\n“AI adoption is moving faster than our ability to measure it – and that’s a challenge for anyone trying to make smart decisions. Signals is our way of putting real-world evidence on the table, so India’s AI debate can be grounded in facts, not hype,” OpenAI’s chief economist Ronnie Chatterji said in a statement.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar g"
      },
      {
        "title": "Nintendo turned its biggest flop into an expensive, uncomfortable novelty",
        "link": "https://www.theverge.com/games/881677/nintendo-switch-virtual-boy-review",
        "published": "2026-02-20T09:00:00-05:00",
        "source": "The Verge",
        "text": "I’ve written about a lot of different video game hardware over the years, from new consoles to retro gadgets to whatever you want to call the Playdate. But I can’t remember ever being perpetually sore from testing a device; such are the joys of the Virtual Boy. Nintendo has turned its biggest flop into an accessory for the Switch, but the costs involved — to your wallet, eyes, and neck — make it a tough sell. Much like the original, this is a novelty for Nintendo sickos only.\n\nFirst released in 1995, the original Virtual Boy looked like a VR headset but wasn’t actually VR or a headset. Instead, the console offered stereoscopic 3D games that you viewed through a pair of bulky goggles that were propped up on a stand. It also rendered games in eye-searing red and black, making for an experience that had some potential but was ultimately ugly and uncomfortable. It was a flop and was discontinued after just a year, amassing a library of less than two dozen games.\n\nNow Nintendo has brought that same experience to the Switch. Virtual Boy games have been added to the Nintendo Classics collection of retro games available to Switch Online subscribers this week, but the twist is, because of the unique nature of the original hardware, you need to buy an accessory to actually play them. There’s a plastic re-creation of the Virtual Boy that’ll run you $100, which is what I’ve been using, as well as a cheaper cardboard headset that’s a much more reasonable $25. Either way, you’ll need both a subscription and an accessory to play these games.\n\nTechnically the games will run in portable mode without one of the accessories connected, but without the magnifying goggles, they’re displayed so small that they’re essentially unplayable. It looks something like this:\n\nCan you tell what Virtual Boy game I’m playing here? Image: Nintendo\n\nThe plastic Virtual Boy looks like the original hardware, complete with a fake controller port and volume dial. But really it’s an elaborate Switch (or Swi"
      },
      {
        "title": "Mothers (YC X26) Is Hiring",
        "link": "https://jobs.ashbyhq.com/9-mothers?utm_source=x8pZ4B3P3Q",
        "published": "Fri, 20 Feb 2026 13:44:42 +0000",
        "source": "Hacker News: Front Page",
        "text": ""
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Your Coffee Grinder Is as Important as Your Brewer—Here Are the 5 Best We’ve Tested",
        "link": "https://www.wired.com/gallery/best-coffee-grinders/",
        "published": "Fri, 20 Feb 2026 13:42:18 +0000",
        "source": "WIRED",
        "text": "Compare Our Top 5 Grinders\n\nGrinder Wired Tired Type Grind Settings Espresso Rating Drip Rating Baratza Encore ESP ($200) Innovative dial offers fine adjustments for espresso. Precise grinds, with clarity of flavor. Built like a tank. Admirable versatility for all coffee types. Best value proposition overall. Not a looker, really. Neither loud nor quiet. Conical burr 40 4/5 4/5 Oxo Brew Conical Burr ($100) Lowest-cost burr grinder that still offers a good grind. Slim, sturdy build. Good for drip, Aeropress, French press. Few espresso adjustments. Not as precise as top picks. A little loud. Conical burr 30 1/5 3.5/5 Fellow Ode Gen 2 ($400) Tuning-fork precision on drip and pour-over. Minimalist-pretty design. Low static. Auto-shutoff when hopper is empty. Helpful grind size guide. Not a good pick for espresso. Odd haptics on power switch. Grind cup also weird Flat burr 31 2/5 5/5 Kingrinder K6 Hand Grinder ($100) Wild precision, at a low price. Sturdy, wholly analog machining and engineering. 180 fine adjustments. Compact. Hand grinding is a process. Instructions are few. Best for single-serve, not batch Manual 180 4/5 4.5/5 Mazzer Philos Coffee Grinder ($1,500) Wonderful clarity, depth, and body for espresso. Fine adjustments, easy cleaning, capability for all coffee brew styles. Quite large. Drip coffee is excellent, but not as good as with the Ode. Flat burr 145 5/5 3/5\n\nBest Budget Coffee Grinders\n\nAs mentioned above, the best bang for your buck will always be a hand grinder like my favorite, the Kingrinder K6 manual coffee grinder ($100). A precisely machined manual coffee grinder can rival coffee grinders many hundreds of dollars more expensive, both in precision and durability. And so the best manual coffee grinder will also be the budget option that'll lead to the best coffee. I've personally come to love the routine, and the control.\n\nBut I get it. You'll happily grind your pepper with the best pepper grinder, but you draw the line at grinding coffee. Mornin"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nOpenAI has found significant traction in India, with 18 to 24-year-olds accounting for nearly 50% of ChatGPT usage in the country. Meanwhile, the idea of building data centers in outer space is being explored as a potential solution to the high energy consumption and water usage of traditional data centers. In other news, the UAE's G42 has partnered with Cerebras to deploy 8 exaflops of computing power in India, and a new search engine feature called Doppelgänger has been launched to help users find OnlyFans creators that resemble their favorite celebrities.\n\n## Market & Business Implications\n* OpenAI's ChatGPT has seen significant adoption in India, with 18 to 24-year-olds accounting for nearly 50% of usage, and users under 30 accounting for 80% (Article 1).\n* The UAE's G42 has partnered with Cerebras to deploy 8 exaflops of computing power in India, aiming to provide computing resources for AI applications to educational institutions, government entities, and small and medium enterprises (Article 4).\n* A new search engine feature called Doppelgänger has been launched, allowing users to find OnlyFans creators that resemble their favorite celebrities by uploading an image (Article 5).\n\n## Beginner-Friendly Summary\nThere's a big company called OpenAI that made a tool called ChatGPT, and lots of young people in India are using it. Some people are also thinking about building special computers in outer space to help with big problems on Earth. Meanwhile, two other companies, G42 and Cerebras, are working together to make a very powerful computer in India. Additionally, a new search engine feature has been created to help people find certain kinds of content online by using pictures.",
    "articles": [
      {
        "title": "OpenAI says 18 to 24-year-olds account for nearly 50% of ChatGPT usage in India",
        "link": "https://techcrunch.com/2026/02/20/openai-says-18-to-24-year-olds-account-for-nearly-50-of-chatgpt-usage-in-india/",
        "published": "Fri, 20 Feb 2026 13:57:03 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "OpenAI seems to have found product-market fit with young Indians. The company said on Friday that users between 18 and 24 years of age accounted for nearly 50% of messages sent to ChatGPT in the country, and users under 30 accounted for 80%.\n\nThe AI lab said Indians use ChatGPT mostly for work, with 35% of all messages relating to professional tasks, compared to 30% globally.\n\nIn particular, the company’s coding assistant, Codex, is seeing strong traction: OpenAI said Indians use Codex three times more than the global median, and weekly usage has increased by four times since the tool got a Mac app two weeks ago. Users in India are also asking three times as many coding-related questions as the median.\n\nThis is in line with findings from Antropic, which earlier this week said 45.2% of Claude’s tasks map to software-related use cases in India.\n\nOpenAI said outside of work tasks, 35% of messages to ChatGPT from Indians requested guidance, 20% concerned questions about general information, and 20% were requests for the bot to produce or help with writing.\n\nIndia is OpenAI’s second-largest market with more than 100 million weekly users, and the company has been actively trying to court Indians for its AI tools and services. The company offers a sub-$5 subscription tier in the country, and last year even ran promotional campaigns to spur adoption.\n\n“AI adoption is moving faster than our ability to measure it – and that’s a challenge for anyone trying to make smart decisions. Signals is our way of putting real-world evidence on the table, so India’s AI debate can be grounded in facts, not hype,” OpenAI’s chief economist Ronnie Chatterji said in a statement.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar g"
      },
      {
        "title": "Could AI Data Centers Be Moved to Outer Space?",
        "link": "https://www.wired.com/story/could-we-put-ai-data-centers-in-space/",
        "published": "Fri, 20 Feb 2026 12:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Data centers are being built at a frantic pace all over the world, driven by the AI boom. These facilities consume staggering amounts of electricity. By 2028, AI servers alone may use as much energy as 22 percent of US households. Of course that demand will raise energy prices for everyone, and we’ll need more power plants, which means more global warming.\n\nThen there’s the water problem. High-density AI chips run so hot that air cooling isn’t enough. New facilities are turning to water cooling. The technique of choice is water evaporation. It’s more effective and energy-efficient than recirculating water, but a large data center using this method consumes millions of gallons of water a day, draining local water supplies.\n\nSo it’s no surprise that more and more towns are pushing back on data center projects in their area. But if everyone goes NIMBY, it gets sort of NOMPY—like “not on my planet, you bastards.” What to do? People aren’t going to stop using AI. That’s why some folks are saying we should build data centers in space.\n\nJust think: You could get 24/7 energy from solar panels—it’s always sunny in space—and the thermal stuff wouldn’t be an issue because it’s so cold out there. You could do the heavy processing in orbiting data centers and beam the results back to Earth just like satellite internet. That’s the claim, anyway.\n\nCould this really work? Or is it about as practical as colonizing Mars? I asked Google’s AI Overview, and it said, “Yes, data centers can be built in space.” But of course it would say that. I think we’ll have to go full renegade and dial up some old-fashioned human intelligence on this.\n\nPower Up\n\nOne of the really big ideas in science is called conservation of energy. This says that for any “system” (any collection of things we pick), the total energy going into the system equals the change in energy of that system plus the energy going out of the system:\n\nOr rearranging, any change in the amount of energy in a system equals the differ"
      },
      {
        "title": "The Pitt has a sharp take on AI",
        "link": "https://www.theverge.com/entertainment/881016/hbo-the-pitt-generative-ai-charting",
        "published": "2026-02-19T18:15:00-05:00",
        "source": "AI | The Verge",
        "text": "is a reporter focusing on film, TV, and pop culture. Before The Verge, he wrote about comic books, labor, race, and more at io9 and Gizmodo for almost five years.\n\nEach episode of HBO’s The Pitt features some degree of medical trauma that almost makes the hospital drama feel like a horror series. Some patients are dealing with gnarly lacerations while others are fighting off vicious blood infections that could rob them of their limbs, and the chaos of working in an emergency room often leaves The Pitt’s central characters shaken. But as alarming as many of The Pitt’s more gore-forward moments can be, what’s even more unsettling is the show’s slow-burning subplot about hospitals adopting generative artificial intelligence.\n\nIn its second season, The Pitt once again chronicles all the events that happen during a single 15-hour day shift in the Pittsburgh Trauma Medical Center’s emergency room. Season two takes place on the Fourth of July — one of the busiest days for hospitals — as senior attending physician Dr. Michael “Robby” Robinavitch (Noah Wyle) is working one last shift before he takes a much-needed sabbatical. With Dr. Robby scheduled to be away for three months, the hospital brings in Dr. Baran Al-Hashimi (Sepideh Moafi) to help lead the emergency room while he’s away. There’s some personality-based friction between the attendings, but Dr. Robby mostly respects how Dr. Al-Hashimi navigates her work except when she insists that the hospital would be better off if it committed to using a piece of AI-powered transcription software.\n\nThough this season starts off relatively calm, the day becomes increasingly stressful for all of The Pitt’s characters as the hospital becomes filled with people needing medical attention. Staying on top of her work is especially taxing for second-year resident Dr. Trinity Santos (Isa Briones) because she simply doesn’t have enough time to see all of her patients and carefully note all of their symptoms in their medical charts.\n\nDr. "
      },
      {
        "title": "UAE’s G42 teams up with Cerebras to deploy 8 exaflops of compute in India",
        "link": "https://techcrunch.com/2026/02/20/uaes-g42-teams-up-with-cerebras-to-deploy-8-exaflops-of-compute-in-india/",
        "published": "Fri, 20 Feb 2026 11:58:15 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Abu Dhabi-based tech company G42 has partnered with U.S.-based chipmaker Cerebras to deploy 8 exaflops of computing power via a new supercomputer system in India, the companies said on the sidelines of the India AI Impact Summit in New Delhi.\n\nThe system will be hosted in India and follow local data residency, security, and compliance rules. The project aims to provide computing resources for AI applications to educational institutions, government entities, and small and medium enterprises.\n\n“Sovereign AI infrastructure is becoming essential for national competitiveness. This project brings that capability to India at a national scale, enabling local researchers, innovators, and enterprises to become AI-native while maintaining full data sovereignty and security,” Manu Jain, CEO of G42 India, said in a statement.\n\nAbu Dhabi’s Mohamed bin Zayed University of Artificial Intelligence (MBZUAI) and India’s Centre for Development of Advanced Computing (C-DAC) are also part of the project. Last year, MBZUAI and G42 released Nanda 87B, a Hindi-English large language model built on Meta’s Llama 3.1 70B model, that is purported to understand casual speech in Hindi and English.\n\n“Deploying this system in India marks a significant step forward in the country’s computational capacity and sovereign AI initiatives. It will accelerate training and inference for large-scale models, enabling researchers and developers to build AI tailored to India’s needs,” said Andy Hock, chief strategy officer at Cerebras.\n\nThe India AI Impact Summit this week saw several AI infrastructure initiatives being launched by both Indian giants and international firms.\n\nIndian conglomerate Adani pledged $100 billion to build up to 5 gigawatts of data-center capacity in the country by 2035. Reliance also said it would invest $110 billion over the next seven years for gigawatt-scale data centers.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come togethe"
      },
      {
        "title": "The Search Engine for OnlyFans Models Who Look Like Your Crush",
        "link": "https://www.wired.com/story/the-search-engine-for-onlyfans-models-who-look-like-your-crush/",
        "published": "Fri, 20 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "For three days in February, porn star Alix Lynx flew to Miami for her first exclusive creator gathering where she was in full grind mode: shooting Reels and talking strategy with other creators. “It was kind of like SoHo House for OnlyFans girls,” she says of the experience, which is called The Circle and drew more than a dozen sex workers, including Remy LaCroix and Forrest Smith.\n\nLynx, who is a former webcam model turned OnlyFans starlet, has a combined 2 million followers across Instagram, TikTok, and X. She joined OnlyFans in 2017 with “the luxury of having my own following,” she says, but those numbers haven’t always translated to subscriptions. It’s why she was in Miami.\n\n“I don’t think people understand. I do a shitload of marketing,” Lynx says.“That’s the big misconception with OnlyFans—when creators join they think it’s going to be easy. But unless you’re a genius at marketing on social media, which is few and far between, it’s genuinely hard to get found and gain a following.”\n\nMany of OnlyFans’ 4 million creators have said the same thing: native discovery on the platform sucks. “There’s just a frustration,” Lynx says. “In a perfect world, there would be that searchability feature because it makes it an even playing field for creators.” (According to OnlyFans, the platform limits its search feature as a safety precaution so users don’t accidentally stumble across content they didn’t intend to see.)\n\nIt’s a problem that Presearch—a free, private, decentralized search engine—wants to fix with the launch of its image-based discovery tool Doppelgänger.\n\nDoppelgänger is the newest addition to Presearch’s Spicy Mode, a NSFW feature for searching adult content. Users can upload an image of a celebrity—or any person they think is hot—to find OnlyFans creators that resemble them. The technology matches the user with similar creators who want an audience rather than to deepfake platforms that are nonconsensual and illegal. Ever wondered who Sabrina Carpenter’s or P"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nThe US economy grew at a slower-than-expected rate of 1.4% in the fourth quarter, according to the Commerce Department. This slowdown, combined with firm inflation, may complicate the Federal Reserve's decision on interest rates. Meanwhile, certain companies such as NextEra Energy and Teva Pharmaceutical Industries Limited are expected to experience growth, with NextEra anticipating an 8% growth rate through 2032 and Teva expecting double-digit earnings growth through 2026. The possibility of a US-Iran conflict is also affecting oil prices, with a potential disruption to oil flows through the Strait of Hormuz.\n\n## Market & Business Implications\n* NextEra Energy's renewables arm posted $8.7 billion of revenue for fiscal year 2025, a $1.2 billion increase from 2024, according to Article 1.\n* The US economy grew at an annualized rate of just 1.4% in the fourth quarter, well below the Dow Jones estimate for a 2.5% gain, as stated in Article 2.\n* Goldman Sachs raised its price target on Teva Pharmaceutical Industries Limited (TEVA) to $45 from $36, and gave it a Buy rating, as reported in Article 4.\n* The core personal consumption expenditures price index rose 3% in December, matching the consensus forecast but keeping the pivotal inflation measure well above the Fed's 2% target, according to Article 2.\n* Oil prices have risen more than 5% this week as traders price in the growing risk of military action between the US and Iran, as mentioned in Article 5.\n\n## Beginner-Friendly Summary\nThe US economy did not grow as fast as expected in the last part of 2025. This might make it harder for the people in charge of money to decide what to do with interest rates. Some companies, like NextEra Energy and Teva, are still expected to do well. There is also a possibility of a conflict between the US and Iran, which could affect oil prices.",
    "articles": [
      {
        "title": "2 Utility Stocks to Buy in February",
        "link": "https://finance.yahoo.com/news/2-utility-stocks-buy-february-015900317.html",
        "published": "2026-02-19T01:59:00Z",
        "source": "Yahoo Finance",
        "text": "AI-driven power demand is reshaping the entire utility sector. Two companies positioned to capitalize on what will be a years-long trend are NextEra Energy (NYSE: NEE) and The Southern Company (NYSE: SO). Both utility stocks offer their own value propositions for long-term investors. Let's have a look at each.\n\nNextEra is experiencing a power and profit surge\n\nNextEra owns and operates the nation's largest electric utility provider, Florida Power & Light (FPL). It's also a leader in renewable energy. NextEra is on a rare growth trajectory. Through FPL, NextEra may seem like your typical regulated electric company, but population growth in Florida and increasing data center demand is transforming what's normally a boring income-producing business into a growth powerhouse.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nImage source: Getty Images.\n\nThis trend also further enables NextEra's renewables side to scale. FPL revenue accounted for the bulk of NextEra's total revenue, approximately 66% of the $27 billion it brought in for all of 2025. NextEra's renewables arm posted an impressive $8.7 billion of revenue for fiscal year 2025, a $1.2 billion increase from 2024.NextEra anticipates growth of at least 8% through 2032. It also expects to increase its dividend 10% in 2026, and then 6% through 2028. The company's growth projections are welcomed news for buy-and-hold investors.\n\nThe Southern Company will increase your income\n\nThe Southern Company might not have all the growth levers NextEra has, but it does have a higher dividend yield as well as data center demand, particularly in Georgia and Alabama. Southern Company will release its fourth quarter 2025 earnings on Feb. 19, but in its last quarter, the Atlanta-based company showed impressive growth, with quarterly revenue up 7.5% year over year.\n\nI predict much of the same for Southern Company "
      },
      {
        "title": "Fourth-quarter U.S. GDP up just 1.4%, badly missing estimate; inflation firms at 3%",
        "link": "https://www.cnbc.com/2026/02/20/pce-inflation-december-2025.html",
        "published": "Fri, 20 Feb 2026 14:00:40 GMT",
        "source": "US Top News and Analysis",
        "text": "Economic growth slowed more than expected near the end of 2025 while inflation held firm, according to data released Friday that could complicate the Federal Reserve's path on interest rates.\n\nGross domestic produce rose at an annualized rate of just 1.4%, according to Commerce Department numbers released Friday, well below the Dow Jones estimate for a 2.5% gain.\n\nFor the full year in 2025, the U.S. economy grew at a 2.2% pace, down from the 2.8% increase in 2024.\n\nAt the same time, inflation held firm in December, according to the gauge most closely watched by Fed officials.\n\nThe core personal consumption expenditures price index, which excludes food and energy, rose 3% in December, according to a separate release. That matched the consensus forecast but kept the pivotal inflation measure well above the Fed's 2% target.\n\nOn a headline basis, the PCE index accelerated 2.9%, or 0.1 percentage point higher than expected.\n\nBoth indexes rose 0.4% for the month, compared to the respective forecasts for 0.3%.\n\nJust prior to the data release, President Donald Trump warned that the GDP number would be soft, blaming it on the government shutdown that ended in November.\n\n\"The Democrat Shutdown cost the U.S.A. at least two points in GDP. That's why they are doing it, in mini form, again. No Shutdowns!\" Trump said in a Truth Social post. \"Also, LOWER INTEREST RATES. \"Two Late\" Powell is the WORST!!!\"\n\nThe latter part of the post was a reference to Fed Chair Jerome Powell, whom Trump has repeatedly criticized for not lowering rates more aggressively.\n\nThe Fed cut its benchmark rate by three-quarters of a percentage point in late 2025 but has since signaled a more cautious approach as officials assess progress on inflation alongside risks to the labor market.\n\nWhile Trump blamed the shutdown, the Commerce Department said the deceleration in GDP, which grew at a 4.4% rate in the third quarter, was the result in a pullback in consumer spending and exports.\n\nPersonal consumption exp"
      },
      {
        "title": "US economy grew slower than expected in fourth quarter",
        "link": "https://www.foxbusiness.com/economy/us-economy-gdp-q4-2025",
        "published": "Fri, 20 Feb 2026 08:40:11 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "The U.S. economy grew at a much slower than expected pace in the fourth quarter, according to new data released on Wednesday.\n\nThe Commerce Department's Bureau of Economic Analysis (BEA) released its advance estimate for fourth quarter gross domestic product (GDP), which found the U.S. economy grew at an annual rate of 1.4% in the fourth quarter, which runs from October through December.\n\nEconomists surveyed by LSEG had expected the economy to grow at a 3% rate in the quarter. The fourth quarter's 1.4% growth was slower than the 4.4% GDP growth recorded in the third quarter.\n\nThis is a developing story. Please check back for updates."
      },
      {
        "title": "Goldman Sachs See Teva Pharmaceutical Industries Limited (TEVA) Driving Double-Digit Earnings Growth Through 2026",
        "link": "https://finance.yahoo.com/news/goldman-sachs-see-teva-pharmaceutical-020044351.html",
        "published": "2026-02-19T02:00:44Z",
        "source": "Yahoo Finance",
        "text": "Teva Pharmaceutical Industries Limited (NYSE:TEVA) is among the 7 Cheap Pharmaceutical Stocks to Buy According to Hedge Funds.\n\nGoldman Sachs See Teva Pharmaceutical Industries Limited (TEVA) Driving Double-Digit Earnings Growth Through 2026\n\nTeva Pharmaceutical Industries Limited (NYSE:TEVA) is given the second position on our list.\n\nTheFly reported on February 9 that Goldman Sachs raised its price target on TEVA to $45 from $36, and gave it a Buy rating. The company's enhanced business profile is reflected in the upgrade, which has been reinforced by advancements made throughout its branded portfolio and the elimination of prior overhangs. The firm sees the present level as justified, given TEVA's potential for above-consensus, double-digit earnings growth driven by sales increase, margin improvement, and decreased debt, even though the stock now trades above historical valuation multiples.\n\nAdditionally, on January 28, Teva Pharmaceutical Industries Limited (NYSE:TEVA) said that, despite Revlimid being a $1.1 billion barrier, it anticipates making $16.4 to $16.4 billion in sales in 2026. Among TEVA's long-term goals are a non-GAAP operating margin of 30% by 2027 and a mid-single-digit compound annual growth rate (CAGR) in revenue through 2030. A pipeline full of milestones that position the company for consistent, long-term growth, ongoing enhancements to the balance sheet, and developments in its main growth products—AJOVY, UZEDY, and AUSTEDO—all help to achieve these objectives.\n\nTeva Pharmaceutical Industries Limited (NYSE:TEVA) is a global pharmaceutical company specializing in generic and specialty medicines. It develops, manufactures, and markets treatments across multiple therapeutic areas, aiming to improve patient access to high-quality, affordable healthcare worldwide.\n\nWhile we acknowledge the potential of TEVA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely "
      },
      {
        "title": "Trump could attack Iran in days — what's at stake for the oil market",
        "link": "https://www.cnbc.com/2026/02/20/trump-could-attack-iran-in-days-whats-at-stake-for-the-oil-market.html",
        "published": "Fri, 20 Feb 2026 13:33:25 GMT",
        "source": "US Top News and Analysis",
        "text": "A full-blown war between the United States and Iran could, in a worst-case scenario, send oil prices soaring and cause an economic downturn.\n\nWith a massive U.S. military buildup underway in the Middle East, President Donald Trump signaled Thursday that he will decide in the next 10 days whether to launch strikes against Iran.\n\n\"This Iranian situation just scares the daylights out of this market consistently,\" John Kilduff, founder of Again Capital, told CNBC. \"There will be some mischief made by Iran and that's what the market is pricing in.\"\n\nTrump has warned Iran that an attack would be \"far worse\" than the limited U.S. airstrikes that targeted its nuclear facilities last June, but has also left open the possibility that negotiations could still hammer out a deal governing Iran's nuclear program.\n\nPricing risk\n\nOil prices have risen more than 5% this week as traders price in the growing risk of military action. The market's biggest fear is that war would disrupt oil flows through the Strait of Hormuz.\n\nThe strait is a vital chokepoint for the global oil trade. More than 14 million barrels per day of oil and condensates passed through the narrow waterway on average in 2025, according to data from consulting firm Kpler, which says that accounts for a third of total worldwide seaborne oil exports.\n\nAbout three-quarters of the oil that passes through the strait goes to China, India, Japan and South Korea, according to Kpler.\n\nIran's Revolutionary Guard on Tuesday partially closed the strait for several hours to conduct military exercises. The Guard is prepared to shut down the strait if ordered by Iran's leaders, according to the semiofficial Tasnim news agency, citing Iranian Navy Rear Admiral Alireza Tangsiri.\n\n\"Iran could disrupt Hormuz for a lot longer than many market participants think,\" said Bob McNally, founder of Rapidan Energy and former White House energy advisor to President George W. Bush.\n\nWorst-case scenario\n\nThe U.S. could face a situation similar to "
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nA newspaper hawker in Paris, Ali Akbar, has been awarded a knighthood for his 50 years of service. The UN has found that the siege of El Fasher in Sudan has \"hallmarks of genocide\". A second US aircraft carrier is moving closer to the Middle East as President Trump pressures Iran to make a deal. Additionally, a report estimates that US tariff revenue at risk in a Supreme Court ruling tops $175 billion.\n\n## Market & Business Implications\n* Ali Akbar, a Pakistani-born newspaper hawker, has been awarded a knighthood, highlighting the decline of the newspaper industry as he is believed to be the last newspaper hawker left in Paris (Article 1).\n* The US tariff revenue at risk in a Supreme Court ruling is estimated to be over $175 billion, according to a report by Penn-Wharton (Article 2).\n* The siege of El Fasher in Sudan by the Rapid Support Forces group has been found to have \"hallmarks of genocide\" by a UN-mandated fact-finding mission (Article 3).\n\n## Beginner-Friendly Summary\nThere's a man in Paris who has been selling newspapers on the street for 50 years and he just got a big award. Something very bad happened in a city called El Fasher in Sudan, and the UN is saying it might be genocide. The US is also moving a big ship near the Middle East because the president wants another country, Iran, to make a deal. Additionally, there's a big court case in the US that could affect a lot of money in tariffs.",
    "articles": [
      {
        "title": "Ali Akbar, who's sold newspapers on the streets of Paris for 50 years, is now a knight",
        "link": "https://www.npr.org/2026/02/20/g-s1-110565/france-paris-newspaper-seller-knighthood-chevalier-ali-akbar",
        "published": "Fri, 20 Feb 2026 08:42:37 -0500",
        "source": "NPR Topics: World",
        "text": "Ali Akbar, who's sold newspapers on the streets of Paris for 50 years, is now a knight\n\ntoggle caption GUILLAUME BAPTISTE/AFP via Getty Images\n\nPARIS — They call him the voice of Paris' 6th arrondissement. In the cafés of Saint-Germain-des-Prés, Ali Akbar is a fixture — with a voice you can't miss. You usually hear him before you see him, shouting \"Ça y est!\" — his signature catchphrase, \"That's it!\"\n\nFor more than 50 years, the Pakistani-born newspaper hawker has made the same daily rounds on his secondhand bicycle, weaving between brasseries with fresh stacks of papers like Le Monde and Libération. His customers have ranged from neighborhood regulars to Left Bank intellectuals like the 20th century philosopher Jean-Paul Sartre and visiting presidents including Bill Clinton.\n\nSponsor Message\n\nAnd last month, another of his old customers — French President Emmanuel Macron — awarded him one of France's highest honors, naming Akbar a knight in the National Order of Merit.\n\n\"You are the accent of the 6th arrondissement,\" Macron told Akbar in a formal ceremony at the Élysée Palace in late January. \"The voice of the French press on Sunday mornings — and every other day of the week.\"\n\nMacron went on to refer to Akbar as \"the most French of the French — a Voltairean who arrived from Pakistan.\"\n\nAkbar's medal comes with a quiet footnote: He is believed to be the last newspaper hawker left in Paris. A job that once dotted street corners across the city has almost vanished, pushed out by the internet and the collapse of print journalism sales. In a city that now gets most of its headlines on phones, Akbar still delivers them by hand.\n\ntoggle caption TOM NICHOLSON/POOL/AFP via Getty Images\n\nOne big dream\n\nAt 73 years old, Akbar still works seven days a week, 10 hours a day — rain or shine.\n\nBorn in Rawalpindi, Pakistan, the oldest of 10 children, he says that growing up in poverty, he had one big dream — to make enough money to build his mom a house. Just before his 18th birth"
      },
      {
        "title": "Exclusive: US tariff revenue at risk in Supreme Court ruling tops $175 billion, Penn-Wharton estimates - Reuters",
        "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxQT2NZaTJYUkpYT1JJcjJUcXhjNFoyTEV6M3QzQk1nellOUHlFNlZFU2FTcTBITlJqYThDSVJUMTA2aFgxeWJoOUliRHktNTRXRFR3YUpPa19LOGs4aDhMNVVnQjNqTHZaVnRMd2c3T2luZUFTdjJzd1FpZXJKcVY5R3hqSFJJeFZMZ2l0Y19xTVlSeU1YZmtvUDhURE1UcUxGYm5DMExZU3lFczdMT3QtS3J2OTk1dw?oc=5",
        "published": "Fri, 20 Feb 2026 11:02:41 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "RSF siege of El Fasher in Sudan has ‘hallmarks of genocide’, UN mission finds",
        "link": "https://www.theguardian.com/world/2026/feb/19/rsf-siege-el-fasher-sudan-hallmarks-of-genocide-un-mission-north-darfur",
        "published": "Thu, 19 Feb 2026 17:59:17 GMT",
        "source": "World news | The Guardian",
        "text": "The siege and capture of the Sudanese city of El Fasher by the paramilitary Rapid Support Forces group last October bore “the hallmarks of genocide”, a UN-mandated fact-finding mission has said.\n\nIn a report detailing the harrowing 18-month occupation of the capital of North Darfur, investigators concluded that the RSF and allied militias deliberately inflicted conditions calculated to bring about the physical destruction of the Zaghawa and Fur ethnic communities.\n\n“The scale, coordination, and public endorsement of the operation by senior RSF leadership demonstrate that the crimes committed in and around El Fasher were not random excesses of war,” said Mohamed Chande Othman, the mission’s chair, who called for a thorough investigation of the perpetrators.\n\nView image in fullscreen A massive fire at a displacement camp in Sudan killed one child, injured other people and left homeless hundreds who had already had to flee to escape the fighting ravaging the country. Photograph: AFP/Getty Images\n\nThe report was published a day after the UK, Canada and the European Union denounced possible war crimes and crimes against humanity in Sudan during the nearly three-year war.\n\nIts release coincides with the latest wave of drone strikes that have left dozens dead across Sudan’s Kordofan region, an area where the UN has consistently said that grave abuses are taking place.\n\nUnicef said at least 15 children were killed this week when a drone struck a displacement camp in West Kordofan. Local rights defenders reported that another strike on a market in nearby North Kordofan left 28 people dead. Blame for the West Kordofan attack has been directed at the Sudanese army; while the RSF has been accused of carrying out the strike in North Kordofan.\n\nSince April 2023, the RSF has been waging war against the army after a falling out between its commander, Muhammad Hamdan Dagalo, and the army chief, Abdel Fattah al-Burhan, former allies who came to power after the 2019 Sudanese revolutio"
      },
      {
        "title": "Why was Andrew arrested and is he still in line for the throne?",
        "link": "https://www.bbc.com/news/articles/cn9e1q4797wo?at_medium=RSS&at_campaign=rss",
        "published": "Fri, 20 Feb 2026 10:50:54 GMT",
        "source": "BBC News",
        "text": "It is not clear what legal advice Andrew would have received while being held by police. Given his arrest came out of the blue, he would have had to decide whether to seek advice from the local duty solicitor while he waited for his preferred criminal lawyer to arrive, if he has one."
      },
      {
        "title": "Second U.S. carrier nears Middle East, as Trump pressures Iran to make a deal",
        "link": "https://www.npr.org/2026/02/20/nx-s1-5719356/second-u-s-carrier-nears-middle-east-as-trump-pressures-iran-to-make-a-deal",
        "published": "Fri, 20 Feb 2026 07:21:56 -0500",
        "source": "NPR Topics: World",
        "text": "Second U.S. carrier nears Middle East, as Trump pressures Iran to make a deal A second American aircraft carrier moved closer to the Middle East Thursday, as President Trump remains noncommittal about whether he'll use force against Iran.\n\nWorld Second U.S. carrier nears Middle East, as Trump pressures Iran to make a deal Second U.S. carrier nears Middle East, as Trump pressures Iran to make a deal Listen · 3:49 3:49 A second American aircraft carrier moved closer to the Middle East Thursday, as President Trump remains noncommittal about whether he'll use force against Iran. Sponsor Message Sponsor Message"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe U.S. economy grew at a slower rate than expected in the fourth quarter, with a 1.4% annual rate, according to the Bureau of Economic Analysis. The economy expanded by 2.2% in 2025, lower than the 2.8% growth in the previous year. The U.S. also ran a record trade deficit in goods of $1.2 trillion last year, despite President Trump's tariffs policy. The UK government reached a record January surplus, partly due to higher tax. The U.S. automotive industry is awaiting a potential boost from tax season.\n\n## Market & Business Implications\n* The U.S. economy grew at an annual rate of 1.4% in the fourth quarter, according to the Bureau of Economic Analysis (Article 1).\n* The U.S. merchandise trade deficit hit a record $1.2 trillion last year, despite President Trump's tariffs policy (Article 5).\n* The average IRS tax refund is up 10.9% so far this season, which could potentially boost the U.S. automotive industry (Article 4).\n* The UK government reached a record January surplus, with the Chief Secretary to the Treasury stating that they will more than halve borrowing by 2030-31 (Article 3).\n* The U.S. economy expanded by 2.2% in 2025, lower than the 2.8% growth in the previous year, according to the Bureau of Economic Analysis (Article 1).\n\n## Beginner-Friendly Summary\nThe United States economy did not grow as fast as people thought it would at the end of 2025. The whole year was slower than the year before. The U.S. also bought more things from other countries than it sold, which is called a trade deficit. The UK government has more money than it thought it would. Some people think that when people get their tax refunds, they might use that money to buy cars, which could help the car industry.",
    "articles": [
      {
        "title": "U.S. economic growth slowed sharply at the end of 2025, dragging down the year",
        "link": "https://www.washingtonpost.com/business/2026/02/20/gdp-2025-economy-tariffs-trade/",
        "published": "Fri, 20 Feb 2026 13:33:15 +0000",
        "source": "Business",
        "text": "The U.S. economy cooled sharply at the end of 2025, with growth slowing to an annual rate of 1.4 percent, as tariffs and a weeks-long government shutdown sapped its earlier momentum. Overall, the economy expanded by 2.2 percent last year, lower than the 2.8 percent growth the year before, according to new data from the Bureau of Economic Analysis.\n\nThe latest gross domestic product report — which sums up the goods and services produced in the United States — reflects rising imports and a widening trade gap, despite President Donald Trump’s push to revive U.S. manufacturing. Federal spending also fell, in part, because of the longest government shutdown in history, which began Oct. 1, 2025, and lasted 43 days.\n\nStill, those subtractions were largely offset by robust spending by American households that have been eager to splurge even as new tariffs and sluggish wage growth chip away at their finances.\n\n“It’s kind of crazy: The American consumer just keeps spending,” said Tara Sinclair, chair of the economics department at George Washington University. “We know people aren’t feeling good about the economy, but that hasn’t really caused them to pull back.”\n\nA year ago, many economists predicted widespread slowdowns related to the Trump administration’s new tariffs, mass deportations and other immigration policies. That didn’t immediately happen. Although GDP shrank at an annual rate of 0.6 percent in the first three months of 2025, it had since picked up with outsize growth of 3.8 percent and 4.4 percent in the second and third quarters.\n\nWhile growth has recently moderated, the economy remains solid by many measures. The unemployment rate, at 4.3 percent, is near historic lows. Inflation has cooled in the past year to 2.4 percent, and households and businesses continue to spend.\n\nStill, economists caution that the outlook may be more fragile than it appears.\n\n“The economy appears reasonably strong, but if you take a closer look, things are actually quite wobbly,” said"
      },
      {
        "title": "US economy grew slower than expected in fourth quarter",
        "link": "https://www.foxbusiness.com/economy/us-economy-gdp-q4-2025",
        "published": "Fri, 20 Feb 2026 08:40:11 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "The U.S. economy grew at a much slower than expected pace in the fourth quarter, according to new data released on Wednesday.\n\nThe Commerce Department's Bureau of Economic Analysis (BEA) released its advance estimate for fourth quarter gross domestic product (GDP), which found the U.S. economy grew at an annual rate of 1.4% in the fourth quarter, which runs from October through December.\n\nEconomists surveyed by LSEG had expected the economy to grow at a 3% rate in the quarter. The fourth quarter's 1.4% growth was slower than the 4.4% GDP growth recorded in the third quarter.\n\nThis is a developing story. Please check back for updates."
      },
      {
        "title": "Higher tax helped UK government reach record January surplus",
        "link": "https://www.bbc.com/news/articles/c93w4egd3gzo?at_medium=RSS&at_campaign=rss",
        "published": "Fri, 20 Feb 2026 12:13:35 GMT",
        "source": "BBC News",
        "text": "Chief Secretary to the Treasury, James Murray, said: \"We know there is more to do to stop one in every £10 the government spends going on debt interest, and we will more than halve borrowing by 2030-31 so that money can be spent on policing, schools and the NHS.\""
      },
      {
        "title": "Tax season presents a boom-or-bust test for U.S. auto sales",
        "link": "https://www.cnbc.com/2026/02/20/us-auto-sales-tax-season-test.html",
        "published": "Fri, 20 Feb 2026 13:49:52 GMT",
        "source": "Business News",
        "text": "DETROIT – The strength of the U.S. automotive industry will face an early test this spring that has nothing to do with cars or trucks.\n\nWith tax season starting, industry experts are projecting that some Americans, many of whom have been priced out of the new vehicle market, will use anticipated higher tax returns to purchase a new or used vehicle.\n\nExtra cash on hand could lend a needed boost to an industry that's suffering from slowing vehicle sales — or it could reveal continued problems for the automotive industry with inflated prices and consumers still reluctant to spend on big-ticket items.\n\n\"Their new tax bill is actually going to be less, and they're going to be getting more in their tax return. It's going to be a little bit of a surprise, we think, for a lot of potential buyers out there,\" said Cox Automotive senior economist Charlie Chesbrough at a recent auto analyst conference.\n\nThe average IRS tax refund is up 10.9% so far this season, compared to the same point in 2025, according to early filing data. As of Feb. 6, the average refund amount was $2,290, compared with $2,065 reported about one year prior.\n\nThe increases were expected under tax changes by the Trump administration, including the One, Big Beautiful Bill Act signed in July. That legislation removed taxes on overtime and tips and allowed eligible taxpayers to deduct up to $10,000 in annual interest paid on loans for new, U.S.-assembled vehicles purchased, among other adjustments."
      },
      {
        "title": "U.S. runs record trade deficit in goods, despite Trump’s tariffs policy",
        "link": "https://www.washingtonpost.com/business/2026/02/19/tariffs-trade-deficit-2025/",
        "published": "Thu, 19 Feb 2026 20:41:11 +0000",
        "source": "Business",
        "text": "The U.S. merchandise trade deficit hit a record $1.2 trillion last year, despite President Donald Trump’s promise to eliminate it by imposing the highest tariffs in eight decades on foreign-made products. Thursday’s Commerce Department report represents the first full-year assessment of the president’s ambitious reordering of global trade. The persistence of the deficit in the face of steep new taxes on imports from China, the European Union and scores of other nations reflects the limits of Trump’s preferred policy tool, economists said.\n\nThe president has described the trade deficit in goods, which the U.S. has run every year since 1975, as a “national emergency” resulting from unfair trade practices on the part of foreign nations.\n\nA broader measure of the nation’s trade balance — including services such as travel, education and financial management — showed a full-year deficit of $901.5 billion, down slightly from the previous year, the Commerce Department said Thursday.\n\nExports of goods and services rose 6.2 percent to a record $3.4 trillion. Imports rose nearly 5 percent to a record $4.3 trillion.\n\nThe goods and services deficit for the month of December widened more than Wall Street analysts had expected, reaching $70.3 billion, up from $53 billion in November.\n\nThe trade deficit — reflecting the gap between the cost of goods Americans buy from abroad and the value of U.S. goods sold overseas — is driven largely by domestic economic policies, in the view of mainstream economists. The sizable U.S. budget deficit, a sign of a nation living beyond its means, inevitably draws in large amounts of foreign goods, despite tariffs, they note.\n\n“Tariffs are not the dial to turn if you want to change the overall balance of trade,” said Erica York, vice president of federal tax policy with the nonpartisan Tax Foundation.\n\nAlthough the president has failed thus far in his bid to shrink — let alone eliminate — the trade deficit, he has set in motion a fundamental reorderi"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe Federal Reserve's primary inflation rate was higher than expected, while fourth-quarter GDP growth slowed down more than forecasted. Texas Roadhouse's fourth-quarter earnings missed estimates due to high beef prices, but its strong comparable restaurant sales in the first quarter of 2026 kept its shares afloat. The Dow Jones index dropped due to surprise inflation data and a potential Supreme Court decision on Trump tariffs. Doordash's stock rose despite disappointing fourth-quarter results, as its investments started to show signs of payoff. Senator Elizabeth Warren criticized Amazon's massive tax break under Trump.\n\n## Market & Business Implications\n* The Federal Reserve's primary inflation rate came in hotter than expected, causing S&P 500 futures to add to losses (Article 1).\n* Texas Roadhouse's revenue in the quarter ending Dec. 30 increased 3.1% year over year to $1.48 billion, missing the Wall Street consensus estimate of $1.496 billion (Article 2).\n* Doordash's stock rose nearly 2% as Wall Street commended early progress in the food delivery platform's investment cycle, despite disappointing fourth-quarter results (Article 4).\n* Amazon received a tax break of $7.8 billion under the new tax law implemented by President Donald Trump, which is equivalent to the median U.S. household income for 100,000 years (Article 5).\n* The Dow Jones index dropped due to surprise inflation data and a potential Supreme Court decision on Trump tariffs (Article 3).\n\n## Beginner-Friendly Summary\nThe government's measure of inflation was higher than expected, and the economy grew more slowly than thought. A restaurant company called Texas Roadhouse had a tough quarter, but its sales are looking better now. The stock market was worried about this news. A food delivery company called Doordash had a bad quarter, but its investments are starting to pay off. A senator is upset about a big tax break that a company called Amazon got from the government.",
    "articles": [
      {
        "title": "Fed's Key Inflation Rate Hot; GDP Growth Tumbles (Live Coverage)",
        "link": "https://finance.yahoo.com/m/f5cac05b-d611-30e7-a882-4c7de8339600/fed%27s-key-inflation-rate-hot%3B.html?.tsrc=rss",
        "published": "Fri, 20 Feb 2026 13:53:22 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The Federal Reserve's primary inflation rate came in hotter than expected, while fourth-quarter GDP growth saw a bigger-than-forecast slowdown. S&P 500 futures added to losses after the data, as markets have one eye on a potential conflict with Iran and another on a possible Supreme Court Trump tariff ruling."
      },
      {
        "title": "Texas Roadhouse gets a pass from Wall Street. What's next might be out of its control",
        "link": "https://www.cnbc.com/2026/02/19/texas-roadhouse-gets-a-pass-from-wall-street-whats-next-might-be-out-of-its-control.html",
        "published": "Fri, 20 Feb 2026 00:04:26 GMT",
        "source": "Earnings",
        "text": "Texas Roadhouse missed Street estimates on both the top and bottom lines in the fourth quarter as high beef prices weighed on profits. But the restaurant chain's strong comparable restaurant sales through the first seven weeks of the first quarter of 2026 paired with no change in management's commodity inflation outlook for the year are keeping shares afloat Thursday evening. Revenue in the quarter ending Dec. 30 increased 3.1% year over year to $1.48 billion, missing the LSEG-complied Wall Street consensus estimate of $1.496 billion. Earnings per share dropped 26% on an annual basis to $1.28, missing expectations of $1.51, LSEG data showed. TXRH YTD mountain Texas Roadhouse YTD Shares of Texas Roadhouse rose about 2.5% in after-hours trading to around $187 per share. The move would erase Thursday's regular-hours trading losses. The stock was already off to a good start to 2026, gaining about 10% as of Thursday's close. Bottom line This was a weak quarter from Texas Roadhouse, but the market was giving it a pass because everyone knew beef costs were going to be an issue. On the surface, we were a little underwhelmed by the comp sales growth this quarter. After delivering 6.1% comp growth in the third quarter and guiding 5.4% growth through the first five weeks of the fourth quarter, sales growth slipped back to 4.2% for the entire quarter, missing analyst forecasts of about 5.2%. The 4.2% increase was driven by a 1.9% increase in traffic and 2.3% increase in average check. The results lagged due to a slowdown as the quarter progressed, with comps sales up 6.1%, 4.8% and 2.2% in October, November, and December, respectively. Adverse weather in December may have weighed on the results. Management also called out a negative impact from the timing of Christmas. Usually, this cadence would spell trouble for a restaurant chain or retailer. Positively, though, sluggishness was a temporary trend. One of the best things that came out of this earnings release was the company "
      },
      {
        "title": "Stock Market Today: Dow Falls On Inflation Data, Weak GDP; Trump Tariff Ruling May Be Up Next (Live Coverage)",
        "link": "https://finance.yahoo.com/m/2c689129-9ec6-3cce-adf5-d9bcf4c6ba63/stock-market-today%3A-dow-falls.html?.tsrc=rss",
        "published": "Fri, 20 Feb 2026 13:46:14 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Stock Market Today: The Dow Jones index dropped on surprise inflation data. A potential Supreme Court decision on the Trump tariffs is next."
      },
      {
        "title": "Doordash stock rises as investment cycle starts showing signs of a payoff",
        "link": "https://www.cnbc.com/2026/02/19/doordash-stock-investment-ai-tech-earnings.html",
        "published": "Thu, 19 Feb 2026 21:04:08 GMT",
        "source": "Earnings",
        "text": "Doordash 's stock rose nearly 2% on Thursday as Wall Street shook off disappointing fourth-quarter results and commended early progress in the food delivery platform's investment cycle.\n\nShares initially fell about 10% in extended trading after earnings fell short of Wall Street's expectations on the top and bottom lines and the company issued disappointing profit guidance.\n\nIn the first quarter, the company expects continued investments in Deliveroo, the British delivery platform it bought last year, to weigh on adjusted EBITDA. Doordash also anticipates a $20 million impact from recent U.S. winter storms and higher order costs driven by investments in longer-distance deliveries and cost increases in regulated markets.\n\nBut Wall Street managed to overlook Doordash's subpar results as the company's investments start to show signs of an early payoff.\n\n\"DASH's businesses are strong and accelerating, and unit economics are improving, giving it an ability to deliver more durable growth and invest,\" Morgan Stanley analyst Brian Nowak wrote in a note to clients."
      },
      {
        "title": "Elizabeth Warren Slams Amazon's Massive Tax Break Under Trump, Says It Would Take 100,000 Years For Average US Household To Match",
        "link": "https://finance.yahoo.com/news/elizabeth-warren-slams-amazons-massive-133051846.html?.tsrc=rss",
        "published": "Fri, 20 Feb 2026 13:30:51 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Sen. Elizabeth Warren (D-Mass.) criticized the enormous tax break of $7.8 billion that Amazon.com Inc. (NASDAQ:AMZN) and its founder, Jeff Bezos, received last year under the new tax law implemented by President Donald Trump.\n\nAccording to Warren’s post on X on Wednesday, the tax relief Amazon enjoyed in 2025 is equivalent to the median U.S. household income for 100,000 years, approximately $78,000.\n\nWarren used various comparisons to emphasize her point. She stated that the tax relief given to Amazon was four times the revenue generated by Taylor Swift‘s Eras Tour, the highest-grossing tour of all time, which made $2 billion. She further compared Amazon’s tax break to the earnings of celebrities like Kim Kardashian, basketball player LeBron James, and even the average S&P 500 CEO. According to Warren, despite their massive earnings, these celebrities make far less than the tax incentives being offered to Bezos and other billionaires.\n\nIt would take the average household around 100,000 YEARS to make as much money as Donald Trump gave to Amazon last year. pic.twitter.com/h0uTJHYDLk\n\nDon't Miss:\n\nThe Senator’s post highlights her ongoing criticism of corporate tax breaks, emphasizing the need for a country that prioritizes people over corporations. She said Trump took the taxpayers’ money that should have been used to lower healthcare costs and handed it over to Bezos.\n\n“Amazon and Jeff Bezos are getting the sweetest deal of all, thanks to Donald Trump,” Warren said.\n\nAmazon Tax Bill Sparks Debate\n\nWarren’s criticism comes as Amazon’s 10-K filing, earlier this month, showed that Republican tax cuts significantly reduced its tax bill from $9 billion in 2024 to $1.2 billion last year, even as profits rose.\n\nThe drop was largely driven by new depreciation breaks and expanded R&D incentives, Amazon later stated, referring to these elements as “changes by Congress.” The company also said that it invested an estimated $340 billion in the U.S. in 2025.\n\nSee Also: It’s no won"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nA7A5, a Russian ruble-based stablecoin, has grown significantly and facilitated billions of dollars in commercial activity, creating a \"shadow\" economy built on crypto. Meanwhile, Coinbase's Base is transitioning to a fully in-house codebase, replacing Optimism's tech stack. Bitcoin ETFs have seen significant outflows, with nearly $4 billion withdrawn over the past five weeks. Tether's USDT supply is experiencing its biggest monthly decline since 2022, with a decrease of around $1.5 billion in February. The total stablecoin market capitalization has risen 2.33% so far in February.\n\n## Market & Business Implications\n* A7A5 has facilitated $39 billion in sanctions-related crypto flows, according to a report from TRM Labs (Article 1).\n* Coinbase's Base is ditching Optimism's tech stack in favor of a fully in-house codebase, which will replace Optimism's optimistic proofs with Base-specific TEE/ZK proofs (Article 2).\n* Bitcoin ETFs have seen outflows of nearly $4 billion over the past five weeks, with $165.76 million in net outflows on February 19 (Article 4).\n* Tether's USDT supply has fallen by about $1.5 billion so far in February, following a $1.2 billion decrease in January (Article 5).\n* House Democrats are pressing Treasury Secretary Scott Bessent over the handling of World Liberty Financial's bid for a national trust bank charter to issue a dollar-backed token (Article 3).\n\n## Beginner-Friendly Summary\nThere's a special kind of money called A7A5 that's being used a lot in Russia. A big company called Coinbase is making some changes to how it works with another company called Optimism. Some people are taking their money out of special funds that invest in Bitcoin. The amount of a certain type of digital money called USDT is going down. These are some of the big things happening in the world of digital money right now.",
    "articles": [
      {
        "title": "Stablecoin A7A5 grows parallel system for sanctioned companies",
        "link": "https://cointelegraph.com/news/stablecoin-a7a5-parallel-network-sanctioned-companies?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 20 Feb 2026 13:32:33 +0000",
        "source": "Cointelegraph.com News",
        "text": "As cryptocurrency is becoming increasingly intertwined with the traditional financial world, it’s also forming the foundation of a parallel, shadow financial system.\n\nA January report from TRM Labs found a surge in illicit or illegal crypto use to an all-time high of $158 billion. This included a massive increase in crypto flows related to sanctions evasion.\n\nThis was led primarily by A7A5, a Russian ruble-based stablecoin launched by Russia-based company A7. Some $39 billion in sanctions-related crypto flows were attributed to the A7 wallet cluster.\n\nFar from a small, underground system for illicit activity, A7A5 has facilitated billions of dollars’ worth of commercial activity, creating a “shadow” economy built on crypto.\n\nSanctions and the rise of A7A5\n\nAfter Russia invaded Ukraine in February 2022, it faced a raft of sanctions excluding the country and companies based there from participating in the global financial system.\n\nMastercard and Visa suspended international operations for cards issued in Russia, while cards issued abroad stopped functioning in the country. Russian banks were also closed off from SWIFT, severely limiting the ability of companies based in the country to conduct commerce abroad.\n\nWhile these major Western payment networks were shut off, alternatives grew. Mir, the Russian payment network founded in 2017, expanded its market share after Visa and Mastercard’s exit.\n\nRussia also turned to crypto for international commerce. In December 2024, Russian Finance Minister Anton Siluanov noted that his government had passed legislation authorizing foreign trade in “digital financial assets” and Bitcoin (BTC) that was mined in Russia. While Siluanov did not recommend crypto as a form of investment, he claimed that it was “the future” in the context of global payments settlement.\n\nEnter A7A5. The coin was first introduced in February 2025 by the eponymous A7 financial platform. According to legal and professional services firm Astraea Group, A7 is co"
      },
      {
        "title": "Morning Minute: Base Breaks Up With Optimism",
        "link": "https://decrypt.co/358722/morning-minute-base-breaks-up-with-optimism",
        "published": "Fri, 20 Feb 2026 13:32:47 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nCreate an account to save your articles.\n\nCreate an account to save your articles.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors rebounded 1-3%, with SOL leading; BTC at $67.4k\n\nCME to offer 24/7 crypto futures & options trading starting May 29\n\nThe 3rd White House meeting on stablecoin yield shows little progress\n\nFederal judge in Tennessee blocks state-level enforcement against Kalshi\n\nPUNCH meme soars 200% to $32M as the monkey goes viral\n\n🔵 Base Breaks Up With Optimism\n\nCoinbase’s Base is going independent.\n\nMuch to the chagrin of the Superchain.\n\n📌 What Happened\n\nBase, the largest chain in the OP Stack Superchain, announced Wednesday it’s ditching Optimism’s tech stack in favor of a fully in-house codebase called base/base .\n\nOP fell as much as 20% on the news.\n\nBase published a blog post titled “A new, unified stack for Base Chain,” announcing it will consolidate its sequencer, proofs, and all core infrastructure into a single Base-managed repository.\n\nPreviously, Base relied on code from Optimism, Flashbots, and Paradigm spread across multiple teams and repos. The new stack replaces Optimism’s optimistic proofs with Base-specific TEE/ZK proofs (Base V1 hard fork, coming soon), and removes Optimism from the Base Security Council, replacing it with an independent signer.\n\nTwo more hard forks are planned, with Base V3 timed around Ethereum’s upcoming Glamsterdam upgrade.\n\nThere will be no disruption for end users, but node operators will need to migrate to base/base releases.\n\n🗣️ What They’re Saying\n\n“The mission Base launched with is the same mission we have today: make it the best place to build and onboard the next billion people into the onchain economy. We knew that this required creating"
      },
      {
        "title": "House Democrats press Treasury on World Liberty bank charter and UAE stake",
        "link": "https://cointelegraph.com/news/democrats-press-treasury-on-trump-world-liberty-financial?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 20 Feb 2026 12:46:02 +0000",
        "source": "Cointelegraph.com News",
        "text": "Democrats in the US House of Representatives are pressing Treasury Secretary Scott Bessent over how regulators are handling World Liberty Financial’s bid for a national trust bank charter to issue a dollar-backed token.\n\nIn a letter on Thursday, 41 House Financial Services Committee Democrats led by Representative Gregory Meeks cited systemic risk, foreign ownership and potential political pressure on the bank chartering process.\n\nThey asked Bessent to explain what safeguards exist to prevent foreign government officials or politically connected investors from using the charter process to gain leverage over the US financial system.\n\n​The lawmakers pointed to reporting that a senior royal from the United Arab Emirates quietly acquired almost half of World Liberty Financial for about $500 million, including a reported $187 million flowing to Trump-affiliated entities, while the company pursued a national trust bank charter with the Office of the Comptroller of the Currency (OCC).\n\nDemocrats’ letter to Treasury Secretary Scott Bessent. Source: Meeks.house.gov\n\nThey argued that the combination of digital asset trust structures, untested liquidity and resolution frameworks and foreign political interests raised questions that regulators “cannot afford to sidestep.”\n\nRelated: White House floats limited stablecoin rewards in third crypto, bank meeting\n\n​Democrats also questioned whether Executive Order 14215, which they say pulled traditionally independent financial regulators into closer White House oversight, could compromise the OCC’s autonomy in deciding on World Liberty’s application.\n\nThe letter asks Bessent to detail the role of the White House, the Office of Management and Budget, and the Treasury Department in OCC charter decisions, and to respond in writing by Thursday.\n\nWorld Liberty Financial’s high profile\n\nThe letter arrives as World Liberty Financial and other Trump-aligned crypto initiatives raise their profile in Washington and on Wall Street, including th"
      },
      {
        "title": "Bitcoin ETFs Lose Another $166M as Five-Week Withdrawals Near $4B",
        "link": "https://decrypt.co/358713/bitcoin-etfs-lose-another-166m-as-five-week-withdrawals-near-4b",
        "published": "Fri, 20 Feb 2026 11:16:02 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Spot Bitcoin ETFs outflows marked their third straight day of redemptions on February 19.\n\nTotal outflows over the past five weeks were just under $4B, following weekly outflows since mid-January.\n\nExperts remain split on whether the move marks a \"controlled reset,\" or whether selling pressure would persist.\n\nBitcoin ETFs logged another day of outflows Thursday, extending a five-week losing streak that has now erased nearly $4 billion from the products.\n\nSpot Bitcoin ETFs saw $165.76 million in net outflows on February 19, marking the third consecutive day of redemptions, according to SoSoValue data. The latest withdrawals bring the five-week total to just under $4 billion, following weekly outflows of $403.9 million, $359.9 million, $318.1 million, $1.49 billion, and $1.33 billion since mid-January.\n\nThe sustained outflows test whether institutional appetite for Bitcoin exposure is cooling or simply resetting after a strong 2025, with experts divided on whether the bleeding reflects structural weakness or a controlled deleveraging.\n\nBitcoin has bucked the bearish trend, edging up 1.4% over the past 24 hours to around $67,800, according to CoinGecko data, lifting the total crypto market cap by 1.6% to $2.4 trillion. Major altcoins, including Hyperliquid, Avalanche and Sui, have notched gains of around 4% in the same period, even as ETF flows remain in negative territory.\n\nThe rebound has improved sentiment, with users on prediction market Myriad, owned by Decrypt’s parent company, assigning a 44% chance of Bitcoin rallying to $84,000—up 8% on the day.\n\nRetreat or recalibration?\n\nFor Brickken analyst Enmanuel Cardozo, the ETF outflows tell a story of recalibration rather than retreat.\n\n\"After a strong 2025, it's natural to see leveraged funds and short-term allocators reduce exposure, especially in the current macro environment, which is still uncertain and thus volatile,\" Cardozo to"
      },
      {
        "title": "Tether USDT supply set for biggest monthly decline since 2022 FTX collapse",
        "link": "https://cointelegraph.com/news/tether-usdt-biggest-monthly-decline-ftx-collapse?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 20 Feb 2026 12:33:45 +0000",
        "source": "Cointelegraph.com News",
        "text": "Tether’s USDT, the world’s largest US dollar-pegged stablecoin, is heading for its steepest monthly supply decline in years as big holders step up redemptions, according to blockchain data.\n\nThe circulating supply of USDt (USDT) has fallen by about $1.5 billion so far in February, following a $1.2 billion decrease in January, according to Artemis Analytics data reported by Bloomberg. This puts USDT on track for its biggest monthly drop in three years, since the weeks following the collapse of cryptocurrency exchange FTX in November 2022.\n\nThe USDT supply logged a $2 billion decrease in December 2022 after the collapse of FTX and its 150 subsidiaries sent shockwaves through the crypto industry.\n\nThe current decline may signal a contraction in crypto market liquidity, as Tether’s USDT is the primary on-ramp for crypto investors. Its $183 billion market capitalization accounts for about 71% of the total stablecoin market, according to CoinMarketCap.\n\nTether USDT, monthly percentage supply change, monthly aggregate. Source: Artemis Analytics, Bloomberg\n\nCointelegraph reached out to Tether for comment on what is driving the February supply drop, but had not received a response by publication.\n\nRelated: BlackRock enters DeFi as institutional crypto push accelerates: Finance Redefined\n\nTotal stablecoin market cap flat in February\n\nThe pullback in USDT has not translated into a broader contraction across dollar-linked stablecoins.\n\nThe total market capitalization of stablecoins across all exchanges has risen 2.33% so far in February, from $300 billion to $307 billion, according to DeFiLlama data.\n\nTotal stablecoin market capitalization. Source: DeFiLlama\n\nWhile the two leading stablecoins, USDT and Circle’s USDC (USDC), decreased by 1.7% and 0.9%, respectively, the Trump-family-linked World Liberty Financial’s USD1 (USD1) stablecoin recorded a 50% increase in market capitalization over the past month and was valued at $5.1 billion as of Friday, according to DeFiLlama.\n\nRela"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-20T14:02:12.284917+00:00"
  }
}