{
  "Tech": {
    "summary": "## Executive Summary\nThe tech world has seen various developments, including the testing of a new electric Escalade, discussions on the need for new privacy laws in the US, and research on password managers' claims of being \"zero knowledge\". A new routing stack called Holo v0.9 has been built in Rust. At-home STI tests have become more convenient and private, but may not be for everyone.\n\n## Market & Business Implications\n* The 2026 electric Escalade IQL has been test-driven, with its enormous size being a notable feature, as reported in Article 1.\n* The US is in need of new privacy laws, as current laws have not kept up with the explosion in digital surveillance, according to Article 2.\n* Research has shown that password managers' claims of being \"zero knowledge\" may not be entirely true, particularly when account recovery is in place or password managers are set to share vaults, as stated in Article 4.\n* A new routing stack called Holo v0.9 has been built in Rust, as mentioned in Article 3.\n* At-home STI tests can be just as accurate as those performed in a doctor's office when used correctly, as noted in Article 5.\n\n## Beginner-Friendly Summary\nThere are some new things happening in the tech world. Someone got to test drive a really big electric car. There's also talk about how the US needs new rules to protect people's privacy. Some companies that help people keep their passwords safe might not be as safe as they say. A new tool for computers has been made. There are also tests that people can take at home to check for certain health issues, and they can be just as good as the tests done at a doctor's office.",
    "articles": [
      {
        "title": "The 9,000-pound monster I don’t want to give back",
        "link": "https://techcrunch.com/2026/02/22/the-9000-pound-monster-i-dont-want-to-give-back/",
        "published": "Sun, 22 Feb 2026 10:59:08 +0000",
        "source": "TechCrunch",
        "text": "Before heading on a trip to Tahoe last weekend, GM offered me the use of the company’s 9,000-pound monument to excess – the new 2026 electric Escalade IQL (starting at $130,405) – for a week to test-drive. Before you continue, note that I’m not a professional car reviewer. TechCrunch has excellent transportation writers; I am not one of them. I do, however, drive an electric car.\n\nI was immediately game. I’d first glimpsed one last summer at a car show, where some regional car dealers had stationed themselves at the end of a long field dotted with exquisite vintage automobiles. My immediate reaction was “Jesus, that’s enormous,” followed by a surprising admiration for its design, which, despite its enormous scale, shows restraint. For lack of a better word, I’m going to say it’s “strapping.” Its proportions just work.\n\nMy excitement waned pretty quickly when the car was dropped off at my house a day before our departure time. This thing is a monstrosity — at 228.5 inches long and 94.1 inches wide, it made our own cars look like toys. My first apartment in San Francisco was smaller. Trying to drive it up my driveway was a little harrowing, too; it’s so big, and its hood is so high, that if you’re ascending a road at a certain slope – we live midway down a hill; our mailbox is at the top of it – you can’t see whatever is directly in front of the car.\n\nI thought about just leaving it in the driveway for the duration of the trip. The other alternative was doing what I could to grow more comfortable with the prospect of driving it 200 miles to Tahoe City, so I tooled around in it that night and the next day, picking up dinner, heading to an exercise class — just basic stuff around town. When I ran into a friend on the street, I volunteered as quickly as possible that this was not my new car, that I was going to possibly review it, and wasn’t its size ridiculous? It felt like a tank. I thought: other than hotels that use SUVs like the Escalade to ferry guests around, what"
      },
      {
        "title": "America desperately needs new privacy laws",
        "link": "https://www.theverge.com/column/882516/privacy-laws-america",
        "published": "2026-02-22T08:00:00-05:00",
        "source": "The Verge",
        "text": "is a senior tech and policy editor focused on online platforms and free expression. Adi has covered virtual and augmented reality, the history of computing, and more for The Verge since 2011.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThis is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the dire state of tech regulation, follow Adi Robertson. The Stepback arrives in our subscribers’ inboxes at 8AM ET. Opt in for The Stepback here.\n\nHow it started\n\nIn 1973, long before the modern digital era, the US Department of Health, Education, and Welfare (HEW) published a report called “Records, Computers, and the Rights of Citizens.” Networked computers seemed “destined to become the principal medium for making, storing, and using records about people,” the report’s foreword began. These systems could be a “powerful management tool.” But with few legal safeguards, they could erode the basic human right to privacy — particularly “control by an individual over the uses made of information about him.”\n\nThese concerns weren’t just cheap talk in Washington. In 1974, Congress passed the Privacy Act, which set some of the first rules aimed at computerized records systems — limiting when government agencies could share information and outlining what access individuals should have. Over the course of the 20th century, the Privacy Act was joined by more privacy rules for fields including healthcare, websites for children, electronic communications, and even video cassette rentals. But over the past couple of decades, amid an explosion in digital surveillance by governments and private companies, Congress has repeatedly failed to keep up.\n\nLawmakers have weighed numerous plans for preserving Americans’ privacy, yet over and over, they’ve fizzled. Attempts to rein in government spying — like proposed updates to the Electronic Communications Privacy Act of 1986 — have been sandbagged by f"
      },
      {
        "title": "Holo v0.9: A Modern Routing Stack Built in Rust",
        "link": "https://github.com/holo-routing/holo/releases/tag/v0.9.0",
        "published": "Sun, 22 Feb 2026 12:57:35 +0000",
        "source": "Hacker News: Front Page",
        "text": "We read every piece of feedback, and take your input very seriously.\n\nInclude my email address so I can be contacted"
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "What to Know About At-Home STI Tests: Pros, Cons, and Recommendations (2026)",
        "link": "https://www.wired.com/story/at-home-sti-tests/",
        "published": "Sun, 22 Feb 2026 11:56:00 +0000",
        "source": "WIRED",
        "text": "Getting tested for sexually transmitted infections can feel complex, confusing, or embarrassing, but at-home STI tests can make the process easier and more private. Getting tested is important. STDs are more prevalent than they were a decade ago, with 2.2 million reported infections in 2024, according to the Center for Disease Control. Today, there are plenty of testing alternatives for people reluctant or unable to visit a doctor or clinic. But even though these tests can be convenient, they might not be for everyone. We break it all down below.\n\nWhat Are At-Home STI Tests?\n\nAt-home testing is nothing new. You can get at-home medical tests for everything from Covid-19 to drug testing to hormone levels or food sensitivities. You can examine your gut, your blood, or even your DNA. At-home STI tests use samples of your blood, urine, and/or samples collected from the vagina or rectum to detect whether or not you have a sexually transmitted infection. You'll collect these samples with swabs, finger lances, and/or cups. Depending on the test, you'll either send in your samples by mail to await results from the lab, or you'll process them at home in a dedicated device. These tests typically cost between $100 and $400.\n\n\"At-home STI tests can be just as accurate as those performed in a doctor's office when used correctly, since they often use the same laboratory testing methods,\" says Dr. Shannon Chatham, Medical Director at online health care company Wisp. Chatham says the key to accuracy is carefully following the collection instructions and using tests from reputable, FDA-approved, or CLIA-certified companies.\n\nDr. Kate McLean, Chief Medical Officer at at-home test company Evvy, agrees that at-home tests can match lab accuracy since the underlying technology is the same, but cautions that if you get a positive result, the next step will still bring you in contact with a medical professional: “A positive result should be paired with a care conversation to understand next"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nOpenAI CEO Sam Altman addressed concerns about AI's environmental impact, stating that concerns about water usage are \"totally fake\" but acknowledging energy consumption is a valid concern. A trick to hide Google's AI Overviews from search results has been discovered by typing \"–ai\" at the end of a query. Microsoft's new gaming CEO, Asha Sharma, vowed not to flood the gaming ecosystem with \"endless AI slop\". The Pentagon is reconsidering its relationship with Anthropic, an AI company, due to its objections to participating in certain deadly operations. \n\n## Market & Business Implications\n* OpenAI CEO Sam Altman said that the world needs to \"move towards nuclear or wind and solar very quickly\" to address energy consumption concerns, as stated in Article 1.\n* Microsoft's new gaming CEO, Asha Sharma, mentioned that \"monetization and AI\" will \"evolve and influence\" the future of gaming, as reported in Article 4.\n* The Pentagon is reconsidering its $200 million contract with Anthropic, an AI company, due to its objections to participating in certain deadly operations, as stated in Article 5.\n* Google's AI Overviews can be hidden from search results by typing \"–ai\" at the end of a query, as discovered in Article 2.\n* OpenAI considered referring a user's account to law enforcement after they described violent scenarios to ChatGPT, but ultimately decided it did not constitute an \"imminent and credible risk\" of harm, as reported in Article 3.\n\n## Beginner-Friendly Summary\nThere are some concerns about how AI is affecting the environment. The person in charge of OpenAI said that AI doesn't use a lot of water, but it does use a lot of energy. Someone found a way to hide AI summaries from Google search results. A new person is in charge of Microsoft's gaming department and they want to use AI in a way that is good for games. The US military is having some issues with an AI company because they don't want to do certain things that the military wants them to do.",
    "articles": [
      {
        "title": "Sam Altman would like remind you that humans use a lot of energy, too",
        "link": "https://techcrunch.com/2026/02/21/sam-altman-would-like-remind-you-that-humans-use-a-lot-of-energy-too/",
        "published": "Sat, 21 Feb 2026 21:38:01 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week while speaking at an event hosted by The Indian Express.\n\nFor one thing, Altman — who was in India for a major AI summit — said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real issue when “we used to do evaporative cooling in data centers.”\n\n“Now that we don’t do that, you see these things on the internet where, ‘Don’t use ChatGPT, it’s 17 gallons of water for each query’ or whatever,” Altman said. “This is completely untrue, totally insane, no connection to reality.”\n\nHe added that it’s “fair” to be concerned about “the energy consumption — not per query, but in total, because the world is now using so much AI.” In his view, this means the world needs to “move towards nuclear or wind and solar very quickly.”\n\nThere’s no legal requirement for tech companies to disclose how much energy and water they use, so scientists have been trying to study it independently. Data centers have also been connected to rising electricity prices.\n\nCiting a previous conversation with Bill Gates, the interviewer asked whether it’s accurate to say a single ChatGPT query currently uses the equivalent of 1.5 iPhone battery charges, to which Altman replied, “There’s no way it’s anything close to that much.”\n\nAltman also complained that many discussions about ChatGPT’s energy usage are “unfair,” especially when they focus on “how much energy it takes to train an AI model, relative to how much it costs a human to do one inference query.”\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately.\n\n\n\nOffer ends March 13. Save up to $300 or 30% to TechCrun"
      },
      {
        "title": "How to Hide Google’s AI Overviews From Your Search Results",
        "link": "https://www.wired.com/story/how-to-hide-google-ai-overviews-from-your-search-results/",
        "published": "Sun, 22 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Going online in 2026 means subjecting yourself to a relentless bombardment of generative AI tools. How about a few AI agents to get you started? Do you want to use this chatbot sidebar? Would you like every search query to be answered with an AI summary? While there’s no off switch to avoid this smorgasbord of AI tools entirely, there is one keyboard trick you can use to dodge Google’s AI Overviews for a brief respite.\n\nIf you don’t want to see an AI-generated summarization of webpage links when you use Google Search, you can type “–ai” at the end of your query. It’s an option WIRED readers highlighted under a recent article about scams found in Google’s AI Overviews. I’ve thoroughly enjoyed using this nifty addendum over the past week, and I wish Google offered a permanent toggle with similar zapping capabilities.\n\n“People find Search more helpful with AI Overviews, and they're coming back to search more as a result,” a Google spokesperson tells WIRED. “We offer a ‘web’ filter to see links only, but people only use it for a tiny fraction of searches.” The spokesperson compared AI Overviews to other features baked into the search results, like knowledge panels, that can’t be removed.\n\nIf you want to try this out, you can put any combination of letters or numbers attached to an en dash, like “–1” or “–z,” at the end of your Google search, and it works just the same, as reported by PCMag. It prevents AI Overviews from appearing completely. The en dash function in Google is designed to remove whatever topic you attach to it from the search results. The removal of AI Overviews seems incidental, and it’s unclear how long this trick will stick around. After typing in a result, you can also tap on the “Web” tab—sometimes hidden under “More”—right below the search bar to see site links.\n\nIn my tests, the –ai trick appears to be limited to search queries in computer browsers. When I tried it in the Safari and Chrome apps on iOS, Google’s AI-generated “web guide” still popped"
      },
      {
        "title": "Suspect in Tumbler Ridge school shooting described violent scenarios to ChatGPT",
        "link": "https://www.theverge.com/ai-artificial-intelligence/882814/tumbler-ridge-school-shooting-chatgpt",
        "published": "2026-02-21T10:22:57-05:00",
        "source": "AI | The Verge",
        "text": "is the Verge’s weekend editor. He has over 18 years of experience, including 10 years as managing editor at Engadget.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nThe suspect in the mass shooting at Tumbler Ridge, British Columbia, Jesse Van Rootselaar, was raising alarms among employees at OpenAI months before the shooting took place. This past June, Jesse had conversations with ChatGPT involving descriptions of gun violence that triggered the chatbot’s automated review system. Several employees raised concerns that her posts could be a precursor to real-world violence and encouraged company leaders to contact the authorities, but they ultimately declined.\n\nOpenAI spokesperson Kayla Wood told The Verge that, while the company considered referring the account to law enforcement, it was ultimately decided that it did not constitute an “imminent and credible risk” of harm to others. Wood said that a review of the logs did not indicate there was active or imminent planning of violence. The company banned Rootselaar’s account, but it does not appear to have taken any further precautionary action.\n\nWood said, “Our thoughts are with everyone affected by the Tumbler Ridge tragedy. We proactively reached out to the Royal Canadian Mounted Police with information on the individual and their use of ChatGPT, and we’ll continue to support their investigation.”\n\nOn February 10th, nine people were killed and 27 injured, including Rootselaar, in the deadliest mass shooting in Canada since 2020. Rootselaar was found dead at the scene of the Tumbler Ridge Secondary School, of an apparent self-inflicted gunshot wound, where most of the killings took place.\n\nThe decision not to alert law enforcement might look misguided in retrospect, but Wood said that OpenAI’s goal is to balance privacy with safety and avoid introducing unintended harm through overly broad use of law enforcement referrals.\n\nUpdated February 21st: Added statement from OpenA"
      },
      {
        "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
        "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
        "published": "Sat, 21 Feb 2026 17:41:27 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "In Brief\n\nMicrosoft announced a major gaming shakeup on Friday, with Microsoft Gaming CEO Phil Spencer departing the company, along with Xbox President Sarah Bond.\n\nSpencer will be replaced by former Instacart and Meta executive Asha Sharma. With Sharma’s most recent role as the president of Microsoft’s CoreAI product, these moves suggest that Microsoft might be doubling down on bringing AI into video games.\n\nThe company had already been experimenting with ways to combine AI and gaming, for example developing an AI gaming companion and releasing a buggy, AI-generated level from “Quake II.”\n\nIndeed, in an internal memo published by The Verge, Sharma wrote that Microsoft “will invent new business models and new ways to play” and said that “monetization and AI” will both “evolve and influence this future.” At the same time, she said that the company “will not chase short-term efficiency or flood our ecosystem with soulless AI slop.”\n\n“Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us,” Sharma added.\n\nThat’s just one of three “commitments” Sharma made in her memo. The others involve building “great games beloved by players” and prioritizing Xbox."
      },
      {
        "title": "AI Safety Meets the War Machine",
        "link": "https://www.wired.com/story/backchannel-anthropic-dispute-with-the-pentagon/",
        "published": "Fri, 20 Feb 2026 17:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "When Anthropic last year became the first major AI company cleared by the US government for classified use—including military applications—the news didn’t make a major splash. But this week a second development hit like a cannonball: The Pentagon is reconsidering its relationship with the company, including a $200 million contract, ostensibly because the safety-conscious AI firm objects to participating in certain deadly operations. The so-called Department of War might even designate Anthropic as a “supply chain risk,” a scarlet letter usually reserved for companies that do business with countries scrutinized by federal agencies, like China, which means the Pentagon would not do business with firms using Anthropic’s AI in their defense work. In a statement to WIRED, chief Pentagon spokesperson Sean Parnell confirmed that Anthropic was in the hot seat. “Our nation requires that our partners be willing to help our warfighters win in any fight. Ultimately, this is about our troops and the safety of the American people,” he said. This is a message to other companies as well: OpenAI, xAI and Google, which currently have Department of Defense contracts for unclassified work, are jumping through the requisite hoops to get their own high clearances.\n\nThere’s plenty to unpack here. For one thing, there’s a question of whether Anthropic is being punished for complaining about the fact that its AI model Claude was used as part of the raid to remove Venezuela's president Nicolás Maduro (that’s what’s being reported; the company denies it). There’s also the fact that Anthropic publicly supports AI regulation—an outlier stance in the industry and one that runs counter to the administration’s policies. But there’s a bigger, more disturbing issue at play. Will government demands for military use make AI itself less safe?\n\nResearchers and executives believe AI is the most powerful technology ever invented. Virtually all of the current AI companies were founded on the premise that i"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nWall Street has erased $47.5 billion from Peloton Interactive's valuation since its peak in 2021. The company's revenue has been declining since fiscal 2022, despite efforts to update its products and services. Meanwhile, the US stock market is experiencing volatility, but Warren Buffett remains unconcerned. The US is also bracing for a blizzard that has led to thousands of flight cancellations. Additionally, President Trump has announced a hike in global tariffs to 15% from 10%, effective immediately.\n\n## Market & Business Implications\n* Peloton Interactive's market cap has decreased from $49.3 billion to $1.8 billion since January 2021, with its connected fitness subscriber count falling 7% year over year (Article 1).\n* The Office of Energy Dominance Financing, led by Gregory Beard, has $289 billion in loan authority and plans to dispense capital at a record rate (Article 2).\n* Over 7,000 US flights have been canceled due to an intense blizzard forecasted to hit the Northeast, with major airlines waiving change and cancellation fees (Article 3).\n* Warren Buffett believes that market volatility is \"really nothing\" and that investors should not worry about short-term fluctuations (Article 4).\n* President Trump has announced an increase in global tariffs to 15% from 10%, effective immediately, with additional levies to follow (Article 5).\n\n## Beginner-Friendly Summary\nA big company called Peloton Interactive has lost a lot of value. The company used to be very successful, but now it's not doing well. There's also a big storm coming to the Northeast, and many flights have been canceled. A famous investor named Warren Buffett is not worried about the stock market being unstable. The President has also announced that the US will be charging more taxes on imported goods from other countries.",
    "articles": [
      {
        "title": "Wall Street Erases $47 Billion From This Once Unstoppable Company",
        "link": "https://finance.yahoo.com/news/wall-street-erases-47-billion-114500372.html",
        "published": "2026-02-21T11:45:00Z",
        "source": "Yahoo Finance",
        "text": "When the COVID-19 pandemic hit the economy, it supercharged the success of a certain company. However, those gains were short-lived, and this business is now feeling the pain.\n\nSince its market cap hit an all-time high of $49.3 billion in January 2021, this consumer discretionary stock has tanked. Today, it carries a valuation of $1.8 billion. Wall Street has erased $47.5 billion from this once unstoppable company in about five years.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nImage source: Getty Images.\n\nGone are the days of massive growth\n\nDuring the four-year stretch from the start of fiscal 2018 through fiscal 2021, Peloton Interactive (NASDAQ: PTON) did not post year-over-year revenue growth below 99%. Its innovative and tech-enabled exercise equipment was selling like hotcakes, as people searched for ways to work out at home during the worst days of the pandemic.\n\nSince the market loves a good growth story, it's not surprising that Peloton's stock was a darling on Wall Street. The share price skyrocketed 550% from its initial public offering in September 2019 to its peak in January 2021.\n\nPeloton showed that its success was fleeting, however. Starting in fiscal 2022, revenue began to drop. This is still the case today. The top line decreased by 3% in the fiscal 2026 second quarter (ended Dec. 31, 2025), despite a fresh product lineup and artificial intelligence features.\n\nThe company went from monster growth to a declining user base. The connected fitness subscriber count now totals less than 2.7 million, falling 7% year over year in the second quarter. Despite management's best efforts, whether it be hardware and software updates, new content, or distribution partnerships, nothing seems to be working.\n\nThe struggles can't be blamed on the economic environment. Fiscal 2026 is expected to be the fifth straight year that sales dip, so "
      },
      {
        "title": "The world's largest energy lender has a new head: Here's how it could shape U.S. policy",
        "link": "https://www.cnbc.com/2026/02/22/the-worlds-largest-energy-lender-has-a-new-head-heres-how-it-could-shape-us-policy.html",
        "published": "Sun, 22 Feb 2026 12:32:18 GMT",
        "source": "US Top News and Analysis",
        "text": "In this article CEG Follow your favorite stocks CREATE FREE ACCOUNT\n\nGregory Beard, director of the Department of Energy's Office of Energy Dominance Financing. Courtesy: U.S. Department of Energy\n\nFormer Apollo executive and longtime New Yorker Gregory Beard says he wouldn't have left the private sector for just any job. But opportunity came knocking in the form of Energy Secretary Chris Wright, who tapped Beard to run the Office of Energy Dominance Financing. Previously known as the Loan Programs Office and part of the Energy Department, the EDF is the largest energy lender in the world, with some $289 billion in loan authority currently. Beard first joined the EDF as a senior advisor in April 2025 from bitcoin miner Stronghold Digital Mining, before officially taking over as director on Jan. 29. \"If I didn't feel passionately about Secretary Wright's message and why the president chose him, I'd still be in the private sector,\" Beard said in an exclusive conversation with CNBC. Beard has only been at the helm for a few weeks, but he has big plans for the agency, including dispensing capital at a record rate. And at a time when the energy complex is seeing a generational shift and natural resources increasingly drive geopolitics, the EDF can be a key tool in shaping the future of energy in the U.S.\n\nShaking up the office\n\nBeard says the first order of business was to reexamine the loans granted during the Biden administration, the majority of which were approved in the months between Election Day 2024 and the inauguration. The result of the \"turnaround job,\" as he called it, impacted more than 80% of the Biden-era portfolio, or about $83.6 billion worth of loans, according to the Department of Energy. Most were focused on emissions-reducing projects. The review process included making sure projects that stayed in the portfolio align with the Trump administration's energy goals, Beard said. All told, roughly $30 billion in conditional loan commitments were either ca"
      },
      {
        "title": "Thousands of US flights canceled as Northeast braces for blizzard",
        "link": "https://www.foxbusiness.com/lifestyle/thousands-us-flights-canceled-northeast-braces-blizzard",
        "published": "Sun, 22 Feb 2026 08:02:01 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Thousands of flights have been canceled in the U.S. as communities in the Northeast rush to prepare for an intense blizzard that forecasters say will arrive on Sunday.\n\nThe total number of disrupted flights reached more than 7,000 as of 6 a.m., with 6,456 U.S. flights canceled and an additional 547 U.S. flights delayed so far through Tuesday.\n\nJetblue, American Airlines, Delta, Southwest and United have announced they will waive change and cancellation fees ahead of the looming storm over the expected impact on travel at many of the Northeast’s major flight hubs.\n\nThe nor’easter is forecast to bring snow totals of over a foot to parts of the Northeast beginning Sunday, according to FOX Weather.\n\nSHOVELING SNOW COULD POSE DANGEROUS HEALTH RISK FOR ONE GROUP, EXPERTS WARN\n\nBlizzard warnings are in place for New York City and the New Jersey coastline, while winter storm watches and warnings are in effect for Boston, Philadelphia, Washington, D.C., and Baltimore.\n\nThe heaviest snow will begin to fall Sunday night, with potential snow totals Sunday night into Monday topping 18–24 inches in New York City, Philadelphia and Boston, FOX Weather reports.\n\nTENNESSEE MAN DIES AFTER SUFFERING HEART ATTACK WHILE SHOVELING SNOW, ADDING TO STORM TOLL\n\nThe National Weather Service warned that the storm could bring wind gusts up to 55 mph, creating whiteout conditions that \"will make travel treacherous and potentially life-threatening.\"\n\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\n\nForecasters added that the \"strong winds, combined with the weight of heavy, wet snow, will likely result in scattered to numerous power outages.\""
      },
      {
        "title": "US stock market volatility is ‘really nothing’ says Warren Buffett. How to invest like the Oracle when others want out",
        "link": "https://finance.yahoo.com/news/us-stock-market-volatility-really-114700636.html",
        "published": "2026-02-21T11:47:00Z",
        "source": "Yahoo Finance",
        "text": "First and foremost, remember that market crashes and volatility are inevitable. That’s why sophisticated investors like Buffett structure their portfolios to sail through turbulence.\n\nIf you fall into that camp of investors who worry about upcoming market swings, here’s how you can prepare to weather the storm as Buffett does.\n\n“If it makes a difference to you whether your stocks are down 15% or not, you need to get a somewhat different investment philosophy,” he recommended in his annual shareholder update (5).\n\nNow, after over eight decades of picking stocks amid these swings, nothing fazes him. Buffett insists young investors with limited experience should have a similar attitude.\n\nFor Buffett, the market performance in 2025 was just a bump in the road to long-term gains. After all, the Oracle has been actively investing in stocks since 1941, when he was 11 years old, giving him much more historical context than the average investor.\n\nIn fact, the billionaire has seen much worse volatility in the past. Here’s why the world’s most famous investor is unconcerned by swings in the stock market, and why you should avoid trying to time the market when valuations get rocky.\n\nHis confidence appears to align with predictions from other financial gurus for 2026. In spite of fear of an AI bubble (2) and dips in the price of gold (3), most investment firms on Wall Street were bullish in their predictions for the market this year, with many analysts looking forward to another year of double-digit returns (4).\n\n“What's happened in the last 30, 45 days, 100 days, whatever you want to call it, it's really nothing,” he said (1).\n\nMost Americans earn a dismal 0.39% APY on their cash at big banks. Unlock up to 4.05% APY and pay $0 in account fees instead with a Wealthfront Cash Account\n\nDave Ramsey warns nearly 50% of Americans are making 1 big Social Security mistake — here’s what it is and 3 simple steps to fix it ASAP\n\nThanks to Jeff Bezos, you can now become a landlord for as l"
      },
      {
        "title": "Trump to hike global tariffs to 15% from 10%, 'effective immediately'",
        "link": "https://www.cnbc.com/2026/02/21/trump-tariffs.html",
        "published": "Sat, 21 Feb 2026 18:49:29 GMT",
        "source": "US Top News and Analysis",
        "text": "U.S. President Donald Trump speaks during a press briefing held at the White House February 20, 2026 in Washington, DC.\n\nPresident Donald Trump on Saturday said he would increase global tariffs to 15% from 10%, one day after the Supreme Court struck down a broad swath of the president's trade agenda.\n\nIn a Truth Social post, Trump said the new tariffs will be \"effective immediately.\" He also warned that additional levies would follow.\n\n\"I, as President of the United States of America, will be, effective immediately, raising the 10% Worldwide Tariff on Countries, many of which have been \"ripping\" the U.S. off for decades, without retribution (until I came along!), to the fully allowed, and legally tested, 15% level,\" he wrote.\n\n\"During the next short number of months, the Trump Administration will determine and issue the new and legally permissible Tariffs,\" he added.\n\nTrump's announcement claimed that the new tariffs will take effect without delay, but it is unclear if any official documents have been signed detailing the timing. A White House fact sheet issued Friday said the original 10% tariffs would go into effect on Tuesday, Feb. 24, at 12:01 a.m. ET.\n\nThe White House did not immediately respond to a CNBC request for clarification."
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nDenmark's military evacuated a US submariner who needed urgent medical care off the coast of Greenland. US President Donald Trump announced plans to deploy a hospital ship to Greenland, prompting a defense of Denmark's healthcare system from Prime Minister Mette Frederiksen. Meanwhile, India has delayed US trade talks after the Supreme Court rejected Trump tariffs. A UN-mandated fact-finding mission found that the siege of El Fasher in Sudan has \"the hallmarks of genocide\". \n\n## Market & Business Implications\n* The Danish Joint Arctic Command evacuated a crew member of a US submarine off the coast of Greenland for urgent medical treatment, according to Article 1.\n* India has delayed US trade talks after the Supreme Court rejected Trump tariffs, as reported in Article 2.\n* The Supreme Court's decision to strike down Trump's previous tariffs was followed by President Trump's announcement of new tariffs, leaving Europeans uncertain, as stated in Article 5.\n* A UN-mandated fact-finding mission found that the siege of El Fasher in Sudan has \"the hallmarks of genocide\", according to Article 3.\n* President Trump announced a 15% increase on tariffs across the board, as mentioned in Article 5.\n\n## Beginner-Friendly Summary\nSomething big happened in Greenland. A person from a US submarine got very sick, so Denmark's military helped them get to a hospital. The US President, Donald Trump, wants to send a special hospital ship to Greenland. But the leader of Denmark said their healthcare system is already good. There are also problems in other parts of the world, like Sudan, where something very bad happened to a city. And there are issues with trade talks between the US and India.",
    "articles": [
      {
        "title": "Danish military evacuates U.S. submariner who needed urgent medical care off Greenland",
        "link": "https://www.npr.org/2026/02/22/nx-s1-5722796/danish-military-evacuates-us-submariner-medical-care-greenland",
        "published": "Sun, 22 Feb 2026 06:08:48 -0500",
        "source": "NPR Topics: World",
        "text": "Danish military evacuates U.S. submariner who needed urgent medical care off Greenland\n\ntoggle caption Bo Amstrup/AP\n\nCOPENHAGEN, Denmark — Denmark's military says its arctic command forces evacuated a crew member of a U.S. submarine off the coast of Greenland for urgent medical treatment.\n\nThe Danish Joint Arctic Command, on its Facebook page, said the crew member was evacuated on Saturday some 7 nautical miles (8 miles; 13 kilometers) off Nuuk — the capital of the vast, ice-covered territory — and transferred to a hospital in the city. The crew member was retrieved by a Danish Seahawk helicopter that had been deployed on an inspection ship.\n\nSponsor Message\n\nAlso late Saturday, U.S. President Donald Trump announced plans to deploy a hospital ship to the Danish autonomous territory of Greenland, alleging that many people there are sick and not receiving care — prompting a defense of Denmark's healthcare system from Prime Minister Mette Frederiksen.\n\n\"Working with the fantastic Governor of Louisiana, Jeff Landry, we are going to send a great hospital boat to Greenland to take care of the many people who are sick, and not being taken care of there. It's on the way!!!\" Trump wrote on his Truth Social platform, referring to his special envoy for Greenland.\n\nThe historically strong bilateral ties after World War II between NATO allies Denmark and the United States have come under severe strain in recent months as Trump ratcheted up talk of a possible U.S. takeover of the mineral-rich and strategically located Arctic island.\n\nFrederiksen defended Denmark's health care system on Sunday, writing on Facebook that she was \"happy to live in a country where there is free and equal access to health for all. Where it's not insurances and wealth that determine whether you get proper treatment.\"\n\n\"You have the same approach in Greenland,\" she said, before adding: \"Happy Sunday to you all\" in front of a blushing, smiling emoji."
      },
      {
        "title": "India delays U.S. trade talks after Supreme Court rejects Trump tariffs, source says - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNamlqekFxTXZseEFQLTYzUTFVR2VIalktQzVIWFBpdnpkY1pIZ05fZkh2b0lxRWVHWW5ZNlpRSmE0dmRLNzd2OGppNGNSclhndFdKUG1hbTFidDNJZWZ0UGZVWFZKenFTSTNOY0Q1ZVhkMHZpSWFrdjRzTWx2aDYza1dVeFlNb05PTXdRUkJnMTZER2Ntc2pvMXlfSzJ2SjYwR1U3R3pXT3JURFVCRnA4eXdUd0JrZEJka0tmdnFUcFRQdw?oc=5",
        "published": "Sun, 22 Feb 2026 09:55:38 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "RSF siege of El Fasher in Sudan has ‘hallmarks of genocide’, UN mission finds",
        "link": "https://www.theguardian.com/world/2026/feb/19/rsf-siege-el-fasher-sudan-hallmarks-of-genocide-un-mission-north-darfur",
        "published": "Thu, 19 Feb 2026 17:59:17 GMT",
        "source": "World news | The Guardian",
        "text": "The siege and capture of the Sudanese city of El Fasher by the paramilitary Rapid Support Forces group last October bore “the hallmarks of genocide”, a UN-mandated fact-finding mission has said.\n\nIn a report detailing the harrowing 18-month occupation of the capital of North Darfur, investigators concluded that the RSF and allied militias deliberately inflicted conditions calculated to bring about the physical destruction of the Zaghawa and Fur ethnic communities.\n\n“The scale, coordination, and public endorsement of the operation by senior RSF leadership demonstrate that the crimes committed in and around El Fasher were not random excesses of war,” said Mohamed Chande Othman, the mission’s chair, who called for a thorough investigation of the perpetrators.\n\nView image in fullscreen A massive fire at a displacement camp in Sudan killed one child, injured other people and left homeless hundreds who had already had to flee to escape the fighting ravaging the country. Photograph: AFP/Getty Images\n\nThe report was published a day after the UK, Canada and the European Union denounced possible war crimes and crimes against humanity in Sudan during the nearly three-year war.\n\nIts release coincides with the latest wave of drone strikes that have left dozens dead across Sudan’s Kordofan region, an area where the UN has consistently said that grave abuses are taking place.\n\nUnicef said at least 15 children were killed this week when a drone struck a displacement camp in West Kordofan. Local rights defenders reported that another strike on a market in nearby North Kordofan left 28 people dead. Blame for the West Kordofan attack has been directed at the Sudanese army; while the RSF has been accused of carrying out the strike in North Kordofan.\n\nSince April 2023, the RSF has been waging war against the army after a falling out between its commander, Muhammad Hamdan Dagalo, and the army chief, Abdel Fattah al-Burhan, former allies who came to power after the 2019 Sudanese revolutio"
      },
      {
        "title": "Iran students stage first large anti-government protests since deadly crackdown",
        "link": "https://www.bbc.com/news/articles/c5yj2kzkrj0o?at_medium=RSS&at_campaign=rss",
        "published": "Sun, 22 Feb 2026 12:39:15 GMT",
        "source": "BBC News",
        "text": "\"I don't want to use the word 'frustrated,' because he understands he has plenty of alternatives, but he's curious as to why they haven't... I don't want to use the word 'capitulated,' but why they haven't capitulated,\" he said."
      },
      {
        "title": "Europe reacts to new tariffs announcement and more uncertainty",
        "link": "https://www.npr.org/2026/02/21/nx-s1-5721239/europe-reacts-to-new-tariffs-announcement-and-more-uncertainty",
        "published": "Sat, 21 Feb 2026 17:16:49 -0500",
        "source": "NPR Topics: World",
        "text": "Europe reacts to new tariffs announcement and more uncertainty\n\nPresident Trump announced a 15% increase on tariffs across the board. Europeans have been celebrating yesterday's SCOTUS decision, but have been doing so quietly.\n\nEMILY KWONG, HOST:\n\nToday, President Trump announced on Truth Social that he will raise his new global tariff to 15%. That is up from the 10% he imposed yesterday after the Supreme Court struck down his previous tariffs. While Europeans had been quietly hailing the Supreme Court's decision, they are now whipsawed by President Trump's announcement of new tariffs, leaving a lot at stake. So let's go now to NPR's Eleanor Beardsley in Paris to hear more. Hi, Eleanor.\n\nELEANOR BEARDSLEY, BYLINE: Hello, Emily.\n\nKWONG: What has the reaction been in Europe to this tariff news? And what has the official reaction been?\n\nBEARDSLEY: Well, it's been huge news all over the TVs and in the newspapers, but leaders are treading carefully. First off, the Supreme Court decision is an internal U.S. matter, and also, President Trump is seen as increasingly unpredictable and even erratic by Europeans, and no one wants to provoke him. They were shocked how he personally attacked the Supreme Court judges. And quite frankly, a lot of Europeans, after his Davos speech, were stunned. They had not heard him go - you know, ramble like that, and he went off on so many tangents, like, the U.S. 2020 election was stolen - and it wasn't stolen - and that was six years ago, so people were shocked.\n\nNow they're whipsawed. You know, the tariffs were struck down yesterday. Now there are new tariffs. It's hard to know how to react. And today, President Emmanuel Macron opened a big agriculture show in Paris, and he said, let's not celebrate too soon. And he said, we'll just have to adapt and look - you know, look at the consequences and adapt. The German Chancellor Friedrich Merz also spoke today. He's going to Washington in early March to meet with President Trump. Here he is talki"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe Olympics are returning to Los Angeles in 2028, but ticket prices will be significantly higher than in 1984. Thousands of US flights have been canceled due to a blizzard in the Northeast. Trump has announced plans to increase global tariffs to 15%. American Girl dolls are turning 40, but the brand is facing challenges in the modern era. The Trump administration is struggling to figure out how to spend an additional $500 billion on the military.\n\n## Market & Business Implications\n* The 2028 Olympics in Los Angeles will have ticket prices much higher than in 1984, with only a third of tickets costing under $100 (Article 1).\n* Thousands of US flights have been canceled due to a blizzard in the Northeast, with major airlines waiving change and cancellation fees (Article 2).\n* Trump has announced plans to increase global tariffs to 15%, which is a key part of his economic policy (Article 3).\n* American Girl doll sales have fallen to roughly $200 million in 2023, down from over $600 million around a decade ago (Article 4).\n* The Trump administration is struggling to figure out how to spend an additional $500 billion on the military, with logistical challenges and internal criticism (Article 5).\n\n## Beginner-Friendly Summary\nThe Olympics are coming back to Los Angeles, but it will cost a lot to go. Many flights in the US have been canceled because of a big snowstorm. Trump wants to add more taxes to things from other countries. American Girl dolls are 40 years old, but not as many people are buying them as before. The government is trying to decide how to spend a lot of extra money on the military.",
    "articles": [
      {
        "title": "Tickets for the 1984 Olympics in L.A. were $3. Could it happen again?",
        "link": "https://www.washingtonpost.com/business/2026/02/22/los-angeles-olympics-ticket-prices/",
        "published": "Sun, 22 Feb 2026 10:00:34 +0000",
        "source": "Business",
        "text": "The day before the Milan Cortina Olympics started earlier this month, Sarah Dunlay pulled out an old Ghirardelli chocolate box holding her ticket stubs from the 1984 Olympics. When Dunlay and her husband, Dennis Kissick, reminisce on the summer the Olympics came to Los Angeles, they note the highlights that many Angelenos still recall — the glorious weather, the remarkable reprieve from L.A.’s normally clogged traffic, the elation as the United States’ medal count piled up each day.\n\nShe also can hardly believe some of the prices on those old ticket stubs. She saw Olympic exhibition baseball at Dodger Stadium for $6. For $16, she saw the world’s best boxers compete. Her track and field tickets cost $33: “It seemed like a lot at the time.” (It’s a little over $100 in today’s dollars.)\n\n“It was all totally fun,” Dunlay said. “The spirit of it all, and the pageantry, and people from different countries.”\n\nNow, the Olympics are headed back to Los Angeles. When the Milan Cortina Games wrap up on Sunday, the world will start to look ahead to the 2028 Summer Olympics in L.A. But ticket prices will be much higher — organizers have said that only a third of tickets will cost under $100, and another third will cost more than $250. The experience of 1984, when many Angelenos were able to see five or 10 Olympic events, would be costly to replicate in 2028.\n\nBack then, Olympics ticket prices started at $3 (adjusted for inflation, that would be just under $10 today). According to a New York Times article at the time, half the tickets were under $10 — meaning in today’s dollars, half of all tickets were cheaper or around the cost of today’s cheapest seats, which will be $28. The average ticket cost $17 in 1984, which would be $55 today.\n\nIncomes are higher now, but by that measure too, today’s tickets are less affordable. That $10 ticket represented just under an hour of work for the median California worker in 1984. Today, a $100 ticket would cost more than two hours’ work at the"
      },
      {
        "title": "Thousands of US flights canceled as Northeast braces for blizzard",
        "link": "https://www.foxbusiness.com/lifestyle/thousands-us-flights-canceled-northeast-braces-blizzard",
        "published": "Sun, 22 Feb 2026 08:02:01 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Thousands of flights have been canceled in the U.S. as communities in the Northeast rush to prepare for an intense blizzard that forecasters say will arrive on Sunday.\n\nThe total number of disrupted flights reached more than 7,000 as of 6 a.m., with 6,456 U.S. flights canceled and an additional 547 U.S. flights delayed so far through Tuesday.\n\nJetblue, American Airlines, Delta, Southwest and United have announced they will waive change and cancellation fees ahead of the looming storm over the expected impact on travel at many of the Northeast’s major flight hubs.\n\nThe nor’easter is forecast to bring snow totals of over a foot to parts of the Northeast beginning Sunday, according to FOX Weather.\n\nSHOVELING SNOW COULD POSE DANGEROUS HEALTH RISK FOR ONE GROUP, EXPERTS WARN\n\nBlizzard warnings are in place for New York City and the New Jersey coastline, while winter storm watches and warnings are in effect for Boston, Philadelphia, Washington, D.C., and Baltimore.\n\nThe heaviest snow will begin to fall Sunday night, with potential snow totals Sunday night into Monday topping 18–24 inches in New York City, Philadelphia and Boston, FOX Weather reports.\n\nTENNESSEE MAN DIES AFTER SUFFERING HEART ATTACK WHILE SHOVELING SNOW, ADDING TO STORM TOLL\n\nThe National Weather Service warned that the storm could bring wind gusts up to 55 mph, creating whiteout conditions that \"will make travel treacherous and potentially life-threatening.\"\n\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\n\nForecasters added that the \"strong winds, combined with the weight of heavy, wet snow, will likely result in scattered to numerous power outages.\""
      },
      {
        "title": "Trump says he will increase his new global tariffs to 15%",
        "link": "https://www.bbc.com/news/articles/cn8z48xwqn3o?at_medium=RSS&at_campaign=rss",
        "published": "Sun, 22 Feb 2026 08:08:24 GMT",
        "source": "BBC News",
        "text": "Trump's tariffs are a key plank of his economic policy, which he has said will encourage businesses to invest and produce goods in the US rather than overseas. But the high court's decision marked a significant check on his power and a major blow to his second-term agenda."
      },
      {
        "title": "As American Girl turns 40, Mattel grapples with bringing dolls into a new era",
        "link": "https://www.cnbc.com/2026/02/22/american-girl-40th-anniversary-sales-mattel.html",
        "published": "Sun, 22 Feb 2026 13:00:01 GMT",
        "source": "Business News",
        "text": "In this article MAT Follow your favorite stocks CREATE FREE ACCOUNT\n\nThe original six American Girl historical characters — Kirsten Larson, Samantha Parkington, Molly McIntire, Felicity Merriman, Addy Walker and Josefina Montoya — are displayed at the brand’s flagship store, Luke Fountain\n\nThe flagship American Girl Place at Rockefeller Center in New York City feels frozen in time. The air smells faintly of vanilla. Young girls dart between doll displays clutching miniature shirts and sequined shoes. Beneath glittering chandeliers, the brand's iconic red boxes line shelves with museum-like precision. Blow dryers hum in the Doll Salon, and downstairs, pink-frosted cupcakes land on cafe tables before dolls sitting upright in their miniature highchairs. \"It feels timeless,\" said Jamie Cygielman, global head of dolls for Mattel , the brand's parent company. And yet, behind the scenes, the business of American Girl dolls is not what it once was. As American Girl turns 40, the brand is navigating more modern challenges: digital competition, shifting play patterns and an aging, more cost-conscious customer base. \"The anniversary is at precarious moment for American Girl and the whole doll industry,\" said Jaime Katz, an analyst who covers Mattel for Morningstar. \"Kids are more digital in play, and the [American Girl] brand has struggled.\" Around a decade ago, at its peak, American Girl was recording more than $600 million in annual sales. By 2023, annual sales had fallen to roughly $200 million — just a third of prior levels. While American Girl has shrunk back considerably from the mid-2010s, the brand has more recently posted five consecutive quarters of sales growth — one of the few steady performers inside Mattel's portfolio. \"Growing off a base that's down more than 60% doesn't mean the brand is back. It means it's stabilizing,\" Katz told CNBC. Earlier this month, Mattel reported fourth-quarter sales of $1.77 billion, falling short of Wall Street expectations after hol"
      },
      {
        "title": "Trump aides struggle with how to spend $500 billion more on military",
        "link": "https://www.washingtonpost.com/business/2026/02/21/trump-hegseth-budget-military/",
        "published": "Sun, 22 Feb 2026 04:43:00 +0000",
        "source": "Business",
        "text": "Trump administration officials have struggled to figure out how to increase U.S. military spending by a whopping $500 billion in their forthcoming budget, slowing the overall White House spending plan, four people familiar with the matter said. President Donald Trump last month agreed to a roughly 50 percent funding boost sought by Pete Hegseth, the defense secretary, in the White House’s annual budget proposal. The idea ran into internal criticism from several other officials, including White House budget chief Russell Vought, who warned about its potential impact on the widening federal deficit, said the people, who spoke on the condition of anonymity to reflect internal deliberations.\n\nSince Trump agreed to the higher number, White House aides and defense officials have run into logistical challenges surrounding where to put the money, because the amount is so large, the people said. The White House is more than two weeks behind its statutory deadline to send its budget proposal to Congress, in part because it is unclear how precisely to spend the additional $500 billion, according to the people familiar with the matter.\n\nSenior Pentagon officials have consulted with former senior defense officials as they grapple with the challenge, said one person familiar with the matter. Part of the discussion centers on how much emphasis should go into buying weapons the military already uses versus investing in high-end technologies, such as artificial intelligence, that the Pentagon envisions as part of its future.\n\nThe roughly $900 billion defense budget approved last year was the largest in U.S. history. While other nations have also increased their military spending, the United States already spends more on defense than the next nine countries combined, according to 2023 data from the Peter G. Peterson Foundation, a nonpartisan think tank.\n\n“I’m not surprised they’re having difficulty doing that,” said G. William Hoagland, senior vice president at the Bipartisan Policy "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market has seen various developments, including a potential opportunity to invest in a European supercar brand that has risen over 950% in the past decade. Meanwhile, software stocks such as RingCentral and Five9 have rallied after alleviating concerns about artificial intelligence's impact on their business models. Texas Roadhouse's shares have remained afloat despite missing estimates due to high beef prices. Additionally, the Dow Jones Futures are looming with Nvidia earnings ahead and a recent global tariff hike to 15%. Ferrari's unique business model and strong profitability metrics have also been highlighted.\n\n## Market & Business Implications\n* Ferrari's operating margin was 29.5% last year, and its free cash flow soared 50% in 2025, making it a strong performer in the automotive sector (Article 1).\n* RingCentral and Five9's earnings have quelled concerns about AI's impact on their business models, leading to a surge in their shares (Article 2).\n* Texas Roadhouse's strong comparable restaurant sales in the first seven weeks of the first quarter of 2026 have kept its shares afloat despite a weak quarter (Article 4).\n* The iShares Expanded Tech-Software Sector ETF has plunged about 23% this year, led by declines in stocks like Atlassian, Unity Software, and Rapid7 (Article 2).\n* Ferrari's order book is full toward the end of 2027, with its first electric vehicle, the Luce, expected to have a starting price tag of around $500,000 (Article 1).\n\n## Beginner-Friendly Summary\nThere are some new things happening in the stock market. A car company from Europe has done very well and might be a good investment. Some software companies were doing poorly because people were worried about artificial intelligence, but they just had good news and their stocks went up. A restaurant company called Texas Roadhouse had a bad quarter, but people are still hopeful about it. There are also some big changes happening with tariffs and stocks. A company called Ferrari is doing well and has a new expensive electric car.",
    "articles": [
      {
        "title": "Buy the Dip: Meet the Supercharged Automotive Stock That Can Beat the S&P 500 Over the Next 5 Years (Hint: It's Not Tesla or Ford)",
        "link": "https://www.fool.com/investing/2026/02/22/buy-the-dip-supercharged-stock-tesla-ford-sp500/?.tsrc=rss",
        "published": "Sun, 22 Feb 2026 13:37:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Shares of this European supercar brand have risen more than tenfold in the past decade.\n\nInvestors that want to put money to work in the automotive sector might consider Tesla, given that it's an innovative and tech-driven force. Or perhaps a more traditional name, like Ford Motor Company, comes to mind.\n\nThere's another auto stock, which is trading 28% below its peak (as of Feb. 17), that is more deserving of investors' capital right now. It has still produced a monster 952% gain over the past decade.\n\nIt's time to buy the dip, as this business could beat the S&P 500 index over the next five years.\n\nStraddling the line between car company and luxury brand\n\nFerrari (RACE +0.12%) operates a unique business model. Yes, it sells vehicles to consumers across the globe. It's an ultra-exclusive luxury brand, too. This means that its financial performance stands out in the industry.\n\nIn 2025, Ferrari posted a year-over-year revenue gain of 7%. It sold just 13,640 cars during the 12-month period, which is a tiny figure that highlights management's objective of capping volume in order to maintain brand strength. These figures on their own aren't driving excitement among the investment community.\n\nHowever, the company reported an operating margin of 29.5% last year, which is unheard of among its peer group. And its free cash flow soared 50% in 2025.\n\nThose profitability metrics are strong because Ferrari benefits from incredible pricing power. It just introduced its first ever electric vehicle (EV), the Luce, which Car and Driver expects will have a starting price tag of around $500,000. Despite these high prices, Ferrari's order book is full toward the end of 2027. Owning one of these machines is a status symbol.\n\nExpand NYSE : RACE Ferrari Today's Change ( 0.12 %) $ 0.43 Current Price $ 366.93 Key Data Points Market Cap $65B Day's Range $ 361.14 - $ 368.02 52wk Range $ 328.00 - $ 519.10 Volume 22K Avg Vol 744K Gross Margin 51.93 % Dividend Yield 0.92 %\n\nEarnings growth will"
      },
      {
        "title": "Beaten-down software stocks RingCentral and Five9 rally as earnings quell some AI concerns",
        "link": "https://www.cnbc.com/2026/02/20/ringcentral-ring-five9-fivn-rally-ai-sell-off.html",
        "published": "Fri, 20 Feb 2026 23:39:30 GMT",
        "source": "Earnings",
        "text": "Shares of RingCentral and Five9 surged on Friday after earnings from both software firms alleviated recent fears that artificial intelligence is eating away at their business models.\n\nRingCentral popped 34%, while Five9 rallied about 12% after topping Wall Street's estimates and issuing upbeat guidance. Both companies, which provide customer service solutions like voice integration, said accelerating AI adoption has boosted demand.\n\nNew AI tools, capable of building apps and websites in a matter of minutes, have spooked investors in recent weeks, leading to a massive selloff across the software sector.\n\nThe worry is that these products, emerging from the likes of Anthropic and OpenAI, will displace the software-as-a-service industry's longstanding business models as firms lean on quicker and more efficient AI tools.\n\nSo far this year, the iShares Expanded Tech-Software Sector ETF tracking the sector has plunged about 23%, led to the downside by Atlassian , Unity Software and Rapid7 , which have shed more than half their value.\n\nSoftware giants Salesforce and Microsoft have dropped 30% and 18%, respectively."
      },
      {
        "title": "Here's Walmart's $1 trillion secret",
        "link": "https://finance.yahoo.com/news/heres-walmarts-1-trillion-secret-133058210.html?.tsrc=rss",
        "published": "Sun, 22 Feb 2026 13:30:58 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\n\nWhat we're watching\n\nWhat we're reading\n\nEconomic data releases and earnings\n\nI get to chat with a ton of fascinating people each week here at Yahoo Finance.\n\nIt's one of the perks of the gig.\n\nEvery day I leave our New York City headquarters smarter than the day before. Phoebe Gates, daughter of Microsoft's (MSFT) Bill and Melinda Gates, took me inside her new startup, Phia. It's an AI-powered shopping assistant that, frankly, I need to start using to cut down my clothing shopping time.\n\nNextdoor (NXDR) founder Nirav Tolia challenged me about why I didn't like his quarter during Opening Bid. I stated my case because, hey, of course I read earnings releases and do my old-school research. I think Nirav appreciated me putting in the work.\n\nFigma (FIG) CFO Praveer Melwani concisely shared why his company will survive the AI era. I think what he said made sense, and I would say the company has a chance based on its Q4 results.\n\nAnd Bausch & Lomb (BLCO) CEO Brent Saunders said he has a breakthrough contact lens innovation on the way. I've been wearing contacts since age 15, so this caught my attention. I also found it interesting that Brent is now tying employee bonuses to AI literacy.\n\nStaying on healthcare, Joshua Meier, founder of privately held Chai Discovery, told me how his AI platform will upend drug discovery.\n\nAmid all this, I recorded three Opening Bid Unfiltered podcasts, which will be released soon. I left all three reminded of how AI will probably clean out the headquarters of most corporate offices by 2030. That's not me being an alarmist — it could be the blunt truth. Some companies you've never heard of are doing major work in AI.\n\nTune in to Monday's podcast episode with Alex Faherty, co-founder of red-hot retailer Faherty. I didn't ask Faherty how he's using AI, but keep an eye on this company — I believe it will go public in the no"
      },
      {
        "title": "Texas Roadhouse gets a pass from Wall Street. What's next might be out of its control",
        "link": "https://www.cnbc.com/2026/02/19/texas-roadhouse-gets-a-pass-from-wall-street-whats-next-might-be-out-of-its-control.html",
        "published": "Fri, 20 Feb 2026 00:04:26 GMT",
        "source": "Earnings",
        "text": "Texas Roadhouse missed Street estimates on both the top and bottom lines in the fourth quarter as high beef prices weighed on profits. But the restaurant chain's strong comparable restaurant sales through the first seven weeks of the first quarter of 2026 paired with no change in management's commodity inflation outlook for the year are keeping shares afloat Thursday evening. Revenue in the quarter ending Dec. 30 increased 3.1% year over year to $1.48 billion, missing the LSEG-complied Wall Street consensus estimate of $1.496 billion. Earnings per share dropped 26% on an annual basis to $1.28, missing expectations of $1.51, LSEG data showed. TXRH YTD mountain Texas Roadhouse YTD Shares of Texas Roadhouse rose about 2.5% in after-hours trading to around $187 per share. The move would erase Thursday's regular-hours trading losses. The stock was already off to a good start to 2026, gaining about 10% as of Thursday's close. Bottom line This was a weak quarter from Texas Roadhouse, but the market was giving it a pass because everyone knew beef costs were going to be an issue. On the surface, we were a little underwhelmed by the comp sales growth this quarter. After delivering 6.1% comp growth in the third quarter and guiding 5.4% growth through the first five weeks of the fourth quarter, sales growth slipped back to 4.2% for the entire quarter, missing analyst forecasts of about 5.2%. The 4.2% increase was driven by a 1.9% increase in traffic and 2.3% increase in average check. The results lagged due to a slowdown as the quarter progressed, with comps sales up 6.1%, 4.8% and 2.2% in October, November, and December, respectively. Adverse weather in December may have weighed on the results. Management also called out a negative impact from the timing of Christmas. Usually, this cadence would spell trouble for a restaurant chain or retailer. Positively, though, sluggishness was a temporary trend. One of the best things that came out of this earnings release was the company "
      },
      {
        "title": "Dow Jones Futures Loom After Trump Hikes Global Tariff To 15%; Nvidia Earnings Ahead",
        "link": "https://finance.yahoo.com/m/3a31782f-5969-3157-9772-a6293c1ebb72/dow-jones-futures-loom-after.html?.tsrc=rss",
        "published": "Sun, 22 Feb 2026 13:17:23 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "There are no important events for this country at this time. Select \"All\" to see top events in other countries or view all events."
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nBitcoin miner Bitdeer has liquidated all of its corporate Bitcoin holdings, reducing its treasury balance to zero. Meanwhile, Robinhood's head of crypto notes that investors are exploring more cryptocurrencies despite the market downturn. Ethereum is set to undergo an upgrade, known as Hegota, which will include a proposal called FOCIL to ensure the network remains censorship-resistant. Additionally, investor capital is flowing from tokens into publicly listed crypto companies as new token launches struggle. \n\n## Market & Business Implications\n* Bitdeer has sold all of its corporate Bitcoin holdings, reducing its treasury balance to zero, according to the company's latest operational update (Article 1).\n* Crypto investors are increasingly exploring beyond the top three cryptocurrencies as the market downturn continues, according to Robinhood's head of crypto (Article 1).\n* Ethereum's upcoming Hegota upgrade will include FOCIL, a proposal designed to ensure the network remains censorship-resistant at the protocol level (Article 2).\n* More than 80% of new token launches have fallen below their token generation event price, with typical drawdowns ranging between 50% and 70% within roughly 90 days of listing (Article 3).\n* Fundraising for crypto-related initial public offerings reached about $14.6 billion in 2025, up sharply from the prior year (Article 3).\n\n## Beginner-Friendly Summary\nA big company that mines Bitcoin, called Bitdeer, has sold all of its Bitcoin. Even though the crypto market is not doing well, people are still interested in buying and trading different types of cryptocurrencies. There's a big change coming to a cryptocurrency called Ethereum to help keep it safe and fair. Some people are losing money when they buy new cryptocurrencies because their value often goes down after they are released. Instead of investing in these new cryptocurrencies, some people are putting their money into bigger, more established companies that work with cryptocurrencies.",
    "articles": [
      {
        "title": "Here’s what happened in crypto today",
        "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 22 Feb 2026 13:02:36 +0000",
        "source": "Cointelegraph.com News",
        "text": "Today in crypto, Bitcoin miner Bitdeer liquidated all Bitcoin holdings, Robinhood’s head of crypto says that crypto investors are exploring more cryptocurrencies despite the market downfall. Meanwhile, US President Donald Trump raises global tariff rate to 15%.\n\nBitcoin miner Bitdeer dumps entire BTC reserves, holdings drop to zero\n\nBitcoin mining firm Bitdeer has sold all of its corporate Bitcoin holdings, reducing its treasury balance to zero, according to the company’s latest operational update.\n\nIn its latest weekly report, Bitdeer disclosed that its “pure holdings,” excluding customer deposits, have fallen to 0 Bitcoin (BTC). The report shows the company produced 189.8 BTC during the period and sold the full amount, alongside an additional 943.1 BTC, which was liquidated from its existing treasury reserves.\n\nBitdeer’s Bitcoin holdings drop to 0. Source: Bitdeer\n\nIn its earlier update on Feb. 13, the miner still held 943.1 BTC, selling 179.9 BTC out of 183.4 BTC mined that week, leaving its treasury intact despite routine sales of newly mined coins.\n\nMining firms commonly sell a portion of production to fund electricity, hosting and equipment costs, but they also maintain a treasury balance to keep exposure to Bitcoin’s price appreciation. Fully liquidating reserves is less typical.\n\nCrypto investors' interest moves ‘pretty wide’ beyond majors as dip drags: Exec\n\nCrypto investors are increasingly exploring beyond the top three cryptocurrencies as the market downturn continues, according to Robinhood's head of crypto, Johann Kerbrat.\n\n“I think what we see from our customers is that they actually see it as an opportunity,” Kerbrat told Cointelegraph during an exclusive interview, adding that they are seeing it as “an opportunity to buy the dip.”\n\n“So we actually see a lot of customers continuing to trade crypto and diversifying, not just on the top two or three assets, but actually going pretty wide,” he said, referring to the largest two cryptocurrencies by marke"
      },
      {
        "title": "'Ethereum Is Going Hard': Vitalik Buterin Backs Censorship Resistance Upgrade",
        "link": "https://decrypt.co/358792/ethereum-going-hard-vitalik-buterin-backs-censorship-resistance-upgrade",
        "published": "Sat, 21 Feb 2026 20:21:03 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief FOCIL will headline Ethereum’s Hegota upgrade set for later in 2026.\n\nThe proposal forces the inclusion of valid transactions to limit censorship.\n\nCritics warn it could expose validators to unforeseen risk, particularly when it comes to sanctioned addresses.\n\nEthereum is doubling down on its cypherpunk roots. Developers have scheduled Fork-Choice Enforced Inclusion Lists, or FOCIL, as the consensus-layer headliner for the network’s upcoming Hegota upgrade.\n\nThe Hegota upgrade is a coordinated change to the network’s core rules that developers expect to roll out in the second half of 2026. The proposal, entered as EIP-7805, is designed to ensure that Ethereum remains censorship-resistant at the protocol level by forcing validators to include all transactions.\n\nWith FOCIL, if a proposed block ignores valid transactions from inclusion lists, then the chain can fork away from it, guaranteeing that any valid public-mempool transaction gets included within a bounded number of slots.\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nWhile some validators in the past have ignored certain transactions, including those tied to sanctioned addresses or protocols—such as the once-sanctioned Tornado Cash—this network change would ensure they're included.\n\nIn an X post on Thursday, Ethereum co-founder Vitalik Buterin said FOCIL works in combination with EIP-8141, which he said makes smart accounts—including multisig, quantum-resistant signatures, key changes, and gas sponsorship—“first-class citizens.”\n\n“FOCIL enables censorship-resistant rapid inclusion of any transaction,” Buterin wrote. “Hence, with FOCIL and 8141 together, anything, including smart wallet txs, gas sponsored txs, and even privacy protocol txs, can be included on-chain through one of 17 different actors (the proposer or the includers) that are"
      },
      {
        "title": "Crypto capital rotates from tokens to stocks as new launches struggle: DWF",
        "link": "https://cointelegraph.com/news/crypto-capital-rotates-from-tokens-to-stocks-as-new-launches-struggle-dwf?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 22 Feb 2026 12:56:14 +0000",
        "source": "Cointelegraph.com News",
        "text": "Investor capital increasingly flows from tokens into publicly listed crypto companies as new token launches struggle, according to research and commentary from market maker DWF Labs.\n\nDrawing on Memento Research data covering hundreds of token launches across major centralized and decentralized exchanges, the firm said more than 80% of projects have fallen below their token generation event (TGE) price. Typical drawdowns range between 50% and 70% within roughly 90 days of listing, suggesting public buyers often face immediate losses after launch.\n\nDWF Labs managing partner Andrei Grachev told Cointelegraph that the figures reflect a consistent post-listing pattern rather than short-term market volatility. He said most tokens reach a price peak within the first month and then trend downward as selling pressure builds.\n\n“TGE price is the exchange-listed price set before launch,” Grachev said. “This is the price the token is set to open at on the exchange, so we can see how much the price actually changes due to volatility in the first few days,” he added.\n\nThe analysis focused on structured launches tied to projects with products or protocols, rather than memecoins. Airdrops and early investor unlocks were identified as major sources of selling pressure.\n\nRelated: Kraken-backed SPAC raises $345M in upsized Nasdaq IPO\n\nCrypto IPOs, M&A surge as capital shifts from tokens\n\nIn contrast, capital formation has strengthened in traditional markets tied to the sector. Fundraising for crypto-related initial public offerings (IPOs) reached about $14.6 billion in 2025, up sharply from the prior year, while merger and acquisition (M&A) activity surpassed $42.5 billion, the highest level in five years.\n\nGrachev said the shift should be understood as a rotation rather than a withdrawal of capital. If capital were simply leaving crypto, you wouldn't see IPO raises jump 48x year-over-year to $14.6 billion, M&A hit a 5-year high of over $42.5 billion, and crypto equity performance out"
      },
      {
        "title": "Marketers Could Use AI to Make Sure You See Their Ads—Here's How",
        "link": "https://decrypt.co/358789/marketers-use-ai-make-sure-you-see-ads",
        "published": "Sat, 21 Feb 2026 17:01:03 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief AdGazer is a model that predicts human ad attention using eye-tracking–trained AI.\n\nPage context drives up to one-third of ad attention outcomes.\n\nAn academic demo could quickly evolve into real ad-tech deployment.\n\nSomewhere between the article you're reading and the ad next to it, a quiet war is being waged for your eyeballs. Most display ads lose it because people just hate ads—so much that big tech companies like Perplexity or Anthropic are trying to steer away from those invasive burdens, looking for better monetization models.\n\nBut a new AI tool from researchers at the University of Maryland and Tilburg University wants to change that—by predicting, with unsettling accuracy, whether you'll actually look at an ad before anyone bothers placing it there.\n\nThe tool is called AdGazer, and it works by analyzing both the advertisement itself and the webpage content surrounding it—then forecasting how long a typical viewer will stare at the ad and its brand logo based on extensive historical data of advertisement research.\n\n<span data-mce-type=\"bookmark\" style=\"width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nThe team trained the system on eye-tracking data from 3,531 digital display ads. Real people wore eye-tracking equipment, browsed pages, and their gaze patterns were recorded. AdGazer learned from all of it.\n\nWhen tested on ads it had never seen before, it predicted attention with a correlation of 0.83—meaning its forecasts lined up with actual human gaze patterns about 83% of the time.\n\nUnlike other tools that focus on the ad itself, AdGazer reads the whole page around it. A financial news article next to a luxury watch ad performs differently than that same watch ad next to a sports score ticker.\n\nThe surrounding context, according to the study published in the Journal of Marketing, accounts for at least 33% of how much attention an ad gets—and about "
      },
      {
        "title": "AI agent OpenClaw confirms ban on Bitcoin, crypto discussions in Discord",
        "link": "https://cointelegraph.com/news/openclaw-discord-bans-bitcoin-crypto-discussions?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sun, 22 Feb 2026 11:00:05 +0000",
        "source": "Cointelegraph.com News",
        "text": "The developer behind the fast-growing open-source AI agent framework OpenClaw has confirmed that any mention of Bitcoin or other cryptocurrencies on its Discord server can lead to removal.\n\nIn a Saturday post on X, a user revealed that they were blocked from OpenClaw’s Discord simply for referencing Bitcoin block height as a timing mechanism in a multi-agent benchmark.\n\nIn response, OpenClaw creator Peter Steinberger confirmed the action, writing that members had accepted “strict server rules” upon joining and that the community maintains a “no crypto mention whatsoever” policy.\n\nOpenClaw confirms ban on crypto. Source: Steinberger\n\nSteinberger later agreed to re-add the user, asking them to email their username so he could restore their access to the server.\n\nRelated: Ethereum’s Trustless Agents standard is the missing link for AI payments\n\nOpenClaw’s crypto problem began with a fake token\n\nTrouble began during a rebrand after Steinberger received a trademark notice related to the project’s original name. In the short window between releasing old social accounts and claiming new ones, scammers seized the abandoned handles and promoted a Solana-based token called $CLAWD.\n\nThe token surged to roughly $16 million in market capitalization within hours before collapsing more than 90% after Steinberger publicly denied involvement. Early buyers accused the developer.\n\nSteinberger responded at the time by warning users he would never launch a cryptocurrency and that any token claiming association with him was fraudulent. Security researchers later identified hundreds of exposed OpenClaw instances online and dozens of malicious plug-ins, many designed to target crypto traders.\n\nOpenClaw has expanded rapidly since launching in late January, surpassing 200,000 GitHub stars within weeks and attracting a wide developer audience interested in autonomous agents.\n\nRelated: Deel taps MoonPay to roll out stablecoin salary payouts in UK, EU\n\nCrypto firms bullish on AI agents\n\nIndustr"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-22T13:45:24.178612+00:00"
  }
}