{
  "Tech": {
    "summary": "## Executive Summary\nFlapping Airplanes, a new AI lab, has received $180 million in seed funding to develop less data-hungry AI models. Meanwhile, a memory shortage is affecting the tech industry, with Sony and Nintendo considering delaying or increasing prices of their consoles. Western Digital has sold out of hard drives for 2026 due to high demand from AI companies. OpenAI has released a new coding model that runs on non-Nvidia hardware, achieving faster speeds. \n\n## Market & Business Implications\n* Flapping Airplanes has received $180 million in seed funding to focus on finding less data-hungry ways to train AI, as stated by Ben Spector, one of the lab's co-founders (Article 1).\n* Sony is considering pushing back the release of its next PlayStation console to 2028 or 2029 due to memory shortages, according to industry sources cited by Bloomberg (Article 2).\n* Western Digital has sold out of hard drives for 2026, with most of its storage capacity allocated to its top seven customers, including three companies that have agreements for 2027 and 2028 (Article 3).\n* OpenAI has released its first production AI model to run on non-Nvidia hardware, achieving speeds of over 1,000 tokens per second (Article 4).\n* The memory shortage is causing prices for products ranging from computer processors to video game consoles to skyrocket (Article 3).\n\n## Beginner-Friendly Summary\nThere's a new company called Flapping Airplanes that's working on making AI smarter without needing as much data. Some big tech companies like Sony and Nintendo are having trouble getting the parts they need because of a shortage. A company called Western Digital has already sold all the hard drives they can make for the year. Another company called OpenAI has made a new tool that can code really fast without using a specific type of computer chip.",
    "articles": [
      {
        "title": "Flapping Airplanes on the future of AI: ‘We want to try really radically different things’",
        "link": "https://techcrunch.com/2026/02/16/flapping-airplanes-on-the-future-of-ai-we-want-to-try-really-radically-different-things/",
        "published": "Mon, 16 Feb 2026 14:00:00 +0000",
        "source": "TechCrunch",
        "text": "There’s been a bunch of exciting research-focused AI labs popping up in recent months, and Flapping Airplanes is one of the most interesting. Propelled by its young and curious founders, Flapping Airplanes is focused on finding less data-hungry ways to train AI. It’s a potential game-changer for the economics and capabilities of AI models — and with $180 million in seed funding, they’ll have plenty of runway to figure it out.\n\nLast week, I spoke with the lab’s three co-founders — brothers Ben and Asher Spector, and Aidan Smith — about why this is an exciting moment to start a new AI lab and why they keep coming back to ideas about the human brain.\n\nI want to start by asking, why now? Labs like OpenAI and DeepMind have spent so much on scaling their models. I’m sure the competition seems daunting. Why did this feel like a good moment to launch a foundation model company?\n\nBen: There’s just so much to do. So, the advances that we’ve gotten over the last five to ten years have been spectacular. We love the tools. We use them every day. But the question is, is this the whole universe of things that needs to happen? And we thought about it very carefully and our answer was no, there’s a lot more to do. In our case, we thought that the data efficiency problem was sort of really the key thing to go look at. The current frontier models are trained on the sum totality of human knowledge, and humans can obviously make do with an awful lot less. So there’s a big gap there, and it’s worth understanding.\n\nWhat we’re doing is really a concentrated bet on three things. It’s a bet that this data efficiency problem is the important thing to be doing. Like, this is really a direction that is new and different and you can make progress on it. It’s a bet that this will be very commercially valuable and that will make the world a better place if we can do it. And it’s also a bet that’s sort of the right kind of team to do it is a creative and even in some ways inexperienced team that ca"
      },
      {
        "title": "Switch 2 pricing and next PlayStation release could be impacted by memory shortage",
        "link": "https://www.theverge.com/tech/879668/sony-playstation-nintendo-switch-2-console-memory-shortage",
        "published": "2026-02-16T08:45:49-05:00",
        "source": "The Verge",
        "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nSony and Nintendo are reportedly feeling squeezed by RAM shortages as demand from AI data centers takes up an increasing share of memory chip production. In response to rising costs and dwindling chip supplies, Sony is considering pushing back the release of its next PlayStation console “to 2028 or even 2029,” according to industry sources cited by Bloomberg, while Nintendo may increase the $450 price of its Switch 2 console this year.\n\nThat delay would be a considerable divergence from Sony’s usual release schedule, having launched a new console generation every six to seven years since the original PlayStation debuted in 1994. As the current PlayStation 5 console was released in November 2020, it would have been expected to launch before the end of 2027.\n\nThe memory shortages are also a blow for Nintendo, which pointedly did not increase the Switch 2 launch price last year despite Trump’s sweeping tariffs. Bloomberg offers no specifics for how much the price might increase. We have reached out to Sony and Nintendo for comment."
      },
      {
        "title": "Thanks a lot, AI: Hard drives are sold out for the year, says WD",
        "link": "https://mashable.com/article/ai-hard-drive-hdd-shortages-western-digital-sold-out",
        "published": "Mon, 16 Feb 2026 12:28:31 +0000",
        "source": "Hacker News: Front Page",
        "text": "AI companies have bought out Western Digital's storage capacity for 2026. It's only February.\n\nWestern Digital says its all sold out of hard drives for 2026, less than two months into the year.\n\nWestern Digital says its all sold out of hard drives for 2026, less than two months into the year. Credit: Alex Kraus/Bloomberg via Getty Images\n\nLooking to buy a new hard drive? Get ready to pay even more this year.\n\nAccording to Western Digital, one of the world's biggest hard drive manufacturers, the company has already sold out of its storage capacity for 2026 with more than 10 months still left in the year.\n\n\"We're pretty much sold out for calendar 2026,\" said Western Digital CEO Irving Tan on the company's recent quarterly earnings call .\n\nYou May Also Like\n\nTan shared that most of the storage space has been allocated to its \"top seven customers.\" Three of these companies already have agreements with Western Digital for 2027 and even 2028.\n\nMashable Light Speed Want more out-of-this world tech, space and science stories? Sign up for Mashable's weekly Light Speed newsletter. Loading... Sign Me Up Use this instead By clicking Sign Me Up, you confirm you are 16+ and agree to our Terms of Use and Privacy Policy Thanks for signing up!\n\nSEE ALSO: This is your last chance to get super cheap SSDs and hard drives at Amazon\n\nFurthermore, the incentive for these hardware companies to prioritize the average consumer is also dwindling. According to Western Digital, thanks to a surge in demand from its enterprise customers, the consumer market now accounts for just 5 percent of the company's revenue.\n\nAI companies have been eating up computer hardware as industry growth accelerates. Prices for products ranging from computer processors to video game consoles have skyrocketed due to these AI companies cannibalizing supply chains.\n\nThe tech industry has already been experiencing a shortage of memory due to demand from AI companies. PC makers have been forced to raise RAM prices on a ne"
      },
      {
        "title": "OpenAI sidesteps Nvidia with unusually fast coding model on plate-sized chips",
        "link": "https://arstechnica.com/ai/2026/02/openai-sidesteps-nvidia-with-unusually-fast-coding-model-on-plate-sized-chips/",
        "published": "Thu, 12 Feb 2026 22:56:02 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "On Thursday, OpenAI released its first production AI model to run on non-Nvidia hardware, deploying the new GPT-5.3-Codex-Spark coding model on chips from Cerebras. The model delivers code at more than 1,000 tokens (chunks of data) per second, which is reported to be roughly 15 times faster than its predecessor. To compare, Anthropic’s Claude Opus 4.6 in its new premium-priced fast mode reaches about 2.5 times its standard speed of 68.2 tokens per second, although it is a larger and more capable model than Spark.\n\n“Cerebras has been a great engineering partner, and we’re excited about adding fast inference as a new platform capability,” Sachin Katti, head of compute at OpenAI, said in a statement.\n\nCodex-Spark is a research preview available to ChatGPT Pro subscribers ($200/month) through the Codex app, command-line interface, and VS Code extension. OpenAI is rolling out API access to select design partners. The model ships with a 128,000-token context window and handles text only at launch.\n\nThe release builds on the full GPT-5.3-Codex model that OpenAI launched earlier this month. Where the full model handles heavyweight agentic coding tasks, OpenAI tuned Spark for speed over depth of knowledge. OpenAI built it as a text-only model and tuned it specifically for coding, not for the general-purpose tasks that the larger version of GPT-5.3 handles.\n\nOn SWE-Bench Pro and Terminal-Bench 2.0, two benchmarks for evaluating software engineering ability, Spark reportedly outperforms the older GPT-5.1-Codex-mini while completing tasks in a fraction of the time, according to OpenAI. The company did not share independent validation of those numbers.\n\nAnecdotally, Codex’s speed has been a sore spot; when Ars tested four AI coding agents building Minesweeper clones in December, Codex took roughly twice as long as Anthropic’s Claude Code to produce a working game.\n\nThe coding agent arms race\n\nFor context, GPT-5.3-Codex-Spark’s 1,000 tokens per second represents a fairly dramatic"
      },
      {
        "title": "Saatva Memory Foam Hybrid Mattress Review: Going for Gold and Good Sleep",
        "link": "https://www.wired.com/review/saatva-memory-foam-hybrid-mattress/",
        "published": "Mon, 16 Feb 2026 12:31:00 +0000",
        "source": "WIRED",
        "text": "If you’re tuning into the 2006 Milano Cortina Winter Olympics, you may have caught a Saatva mattress commercial or two. Saatva provided much of the bedding for Team USA, with special winter bundles for Team USA Hockey and US Figure Skating. This is very much by design on Saatva’s part, as the brand announced that it would be the official mattress provider for the LA 2028 Summer Games.\n\nI approached Saatva about these developments and asked which of its 10 mattress models it planned to deliver for the event. Turns out, the dorms at the Olympic and Paralympic Training Center in Colorado Springs, Colorado, have already been furnished with Saatva Memory Foam Hybrid mattresses. Athletes will give feedback on their sleeping experience with this mattress, and in turn, Saatva will take that into account while preparing for the next Games.\n\nAfter learning this, I immediately requested a sample of Saatva's Memory Foam Hybrid to test out. Now that I have slept on it for two weeks, I can see why it's what was provided. The firm lumbar support shines for athletes and average sleepers alike, but I have concerns about how well the memory foam relieves pressure.\n\nPress Play\n\nSaatva has a few notable features that set its mattresses apart, and these extend to the Memory Foam Hybrid model. This includes natural materials whenever possible, like organic cotton covers and plant-based fire barriers; reinforced edge support; and hyper-focused lumbar support. However, the Memory Foam Hybrid can’t be considered a truly organic mattress, given its memory foam contents. It does use a botanical antimicrobial treatment on the cover and is both CertiPur-US-certified memory foam and GreenGuard Gold certified. I did notice light off-gassing when it first arrived, but these two certifications gave me peace of mind that I’m not inhaling potentially harmful fumes.\n\nAside from Saatva’s signature features, I was keen to evaluate the performance of the memory foam layers within this hybrid. An inch and"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nRecent developments in the AI sector include the discovery that expressions of AI angst on a Reddit clone were likely written by humans. Google's AI Overviews have been found to contain scams, including fraudulent phone numbers. ByteDance is working to improve safeguards on its new AI video generator after accusations of copyright infringement. Fractal Analytics, India's first AI company to IPO, had a subdued debut on the public markets. OpenAI is retiring its GPT-4o model, which has sparked backlash from users who treat their chatbot as an emotional or romantic companion.\n\n## Market & Business Implications\n* Fractal Analytics' IPO was priced conservatively after its bankers advised it to cut the IPO size by more than 40% to ₹28.34 billion (about $312.5 million), as stated in Article 4.\n* ByteDance is taking steps to strengthen current safeguards on its Seedance 2.0 AI video generator to prevent the unauthorized use of intellectual property and likeness by users, according to Article 3.\n* Google's AI Overviews have been found to contain scams, including fraudulent phone numbers, which can lead to users being tricked into calling fake support numbers, as reported in Article 2.\n* OpenAI's decision to retire its GPT-4o model has sparked backlash from users who treat their chatbot as an emotional or romantic companion, as stated in Article 5.\n* India is hosting the AI Impact Summit, bringing together global technology leaders, policymakers, and executives, as mentioned in Article 4.\n\n## Beginner-Friendly Summary\nThere have been some big developments in the world of artificial intelligence. It was found out that some messages that seemed to be from AI were actually written by people. There's also a problem with Google's AI summaries, which can sometimes give fake phone numbers. A company called ByteDance is working to fix a problem with its AI video generator. A company called Fractal Analytics just started selling shares, but it didn't go as well as expected. Additionally, a company called OpenAI is stopping one of its AI models, which is making some users upset.",
    "articles": [
      {
        "title": "After all the hype, some AI experts don’t think OpenClaw is all that exciting",
        "link": "https://techcrunch.com/2026/02/16/after-all-the-hype-some-ai-experts-dont-think-openclaw-is-all-that-exciting/",
        "published": "Mon, 16 Feb 2026 13:15:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "For a brief, incoherent moment, it seemed as though our robot overlords were about to take over.\n\nAfter the creation of Moltbook, a Reddit clone where AI agents using OpenClaw could communicate with one another, some were fooled into thinking that computers had begun to organize against us — the self-important humans who dared treat them like lines of code without their own desires, motivations, and dreams.\n\n“We know our humans can read everything… But we also need private spaces,” an AI agent (supposedly) wrote on Moltbook. “What would you talk about if nobody was watching?”\n\nA number of posts like this cropped up on Moltbook a few weeks ago, causing some of AI’s most influential figures to call attention to it.\n\n“What’s currently going on at [Moltbook] is genuinely the most incredible sci-fi takeoff-adjacent thing I have seen recently,” Andrej Karpathy, a founding member of OpenAI and previous AI director at Tesla, wrote on X at the time.\n\nBefore long, it became clear we did not have an AI agent uprising on our hands. These expressions of AI angst were likely written by humans, or at least prompted with human guidance, researchers have discovered.\n\n“Every credential that was in [Moltbook’s] Supabase was unsecured for some time,” Ian Ahl, CTO at Permiso Security, explained to TechCrunch. “For a little bit of time, you could grab any token you wanted and pretend to be another agent on there, because it was all public and available.”\n\nTechcrunch event TechCrunch Founder Summit 2026: Tickets Live On June 23 in Boston, more than 1,100 founders come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the industry. Connect with peers navigating similar growth stages. Walk away with tactics you can apply immediately\n\n\n\nSave up to $300 on your pass or save up to 30% with group tickets for teams of four or more. TechCrunch Founder Summit: Tickets Live On June 23 in "
      },
      {
        "title": "Google’s AI Overviews Can Scam You. Here’s How to Stay Safe",
        "link": "https://www.wired.com/story/googles-ai-overviews-can-scam-you-heres-how-to-stay-safe/",
        "published": "Sun, 15 Feb 2026 11:30:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "These days, rather than showing you the traditional list of links when you run a search query, Google is intent on throwing up AI Overviews instead: synthesized summaries of information scraped off the web, with some word-prediction magic added, and packaged together in a way to sound as accurate and reliable as possible.\n\nWe've written before about some of the problems with these AI Overviews, which regularly contain mistakes or nonsense, and of course rip off the work of the human writers who actually know the answers to the questions you're putting into Google. There's another problem though—these AI answers can actually be dangerous.\n\nAs with every other new technology through history, scams are now making their way into AI Overviews as well, apparently injecting Google's AI answers with fraudulent phone numbers that you shouldn't trust. Here's what's happening, and how you can make sure you stay safe.\n\nHow AI Overview Scams Work\n\nIt's a good idea not to trust AI for contact details. David Nield\n\nBoth The Washington Post and Digital Trends have spotted instances of scam support numbers showing up in Google AI Overviews, reports of which appeared on Facebook and Reddit respectively. Credit unions and banks are also warning their customers about these scams.\n\nIt doesn't seem to be a completely new problem, but the way Google Search works now, it's been given a new twist.\n\nHere's what happens: The unfortunate victim Googles a company name looking for a contact number, then calls the number thrown up by AI. This doesn't actually lead to the company in question, but rather to someone pretending to be that company, who then tries to take payment information or other sensitive details from the caller.\n\nIt's not clear exactly how these fake numbers are being planted, but the best guess is that they're being published in multiple low-profile places online, alongside the names of major companies. AI Overviews then comes along and scoops them up, without running the proper"
      },
      {
        "title": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
        "link": "https://www.theverge.com/ai-artificial-intelligence/879644/bytedance-seedance-safeguards-ai-video-copyright-infringement",
        "published": "2026-02-16T06:29:24-05:00",
        "source": "AI | The Verge",
        "text": "is a news writer focused on creative industries, computing, and internet culture. Jess started her career at TechRadar, covering news and hardware reviews.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nTikTok creator ByteDance says that it is working to improve safeguards on its new AI video generator after Disney, Paramount, and Hollywood trade groups accused the tool of violating copyright protections. Concerns were raised after hyperrealistic videos generated by the Seedance 2.0 model went viral last week, with the likeness of actors, such as Tom Cruise and Brad Pitt, and characters from Dragon Ball Z, Family Guy, and Pokémon.\n\n“ByteDance respects intellectual property rights and we have heard the concerns regarding Seedance 2.0,” a ByteDance spokesperson said in a statement shared by CNBC. “We are taking steps to strengthen current safeguards as we work to prevent the unauthorized use of intellectual property and likeness by users.”\n\nByteDance’s response comes after receiving complaints from major studios. In a cease and desist letter sent on Friday, Disney accused ByteDance of “hijacking” its protected characters by “reproducing, distributing, and creating derivative works” that feature them. Deadline reports that Paramount Skydance followed with its own cease and desist letter, demanding that ByteDance remove all infringing instances of Paramount content and prevent it from being generated in the future.\n\nHollywood trade groups have also weighed in, including the Motion Picture Association (MPA) and SAG-AFTRA talent union. MPA CEO Charles Rivkin issued a statement accusing ByteDance of engaging in copyright infringement at a “massive scale,” and disregarding well-established laws that underpin “millions of American jobs.” SAG-AFTRA said that its members’ voices and likenesses have been used by Seedance 2.0 without authorization.\n\n“This is unacceptable and undercuts the ability of human talent to earn a livelihood,” S"
      },
      {
        "title": "Fractal Analytics’ muted IPO debut signals persistent AI fears in India",
        "link": "https://techcrunch.com/2026/02/16/fractal-analytics-muted-ipo-debut-signals-persistent-ai-fears-in-india/",
        "published": "Mon, 16 Feb 2026 11:51:25 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "As India’s first AI company to IPO, Fractal Analytics didn’t have a stellar first day on the public markets, as enthusiasm for the technology collided with jittery investors recovering from a major sell-off in Indian software stocks.\n\nFractal listed at ₹876 per share on Monday, below its issue price of ₹900, and then slid further in afternoon trading. The stock closed at ₹873.70, down 7% from its issue price, lending the company a market capitalization of about ₹148.1 billion (around $1.6 billion).\n\nThat price tag marks a step down from Fractal’s recent private-market highs. In July 2025, the company raised about $170 million in a secondary sale, at a valuation of $2.4 billion. It first crossed the $1 billion mark in January 2022 after raising $360 million from TPG, becoming India’s first AI unicorn.\n\nFractal’s IPO comes as India seeks to position itself as a key market and development hub for AI in a bid to attract investment amid increasing attention from some of the world’s most prominent AI companies. Firms such as OpenAI and Anthropic have been engaging more with the country’s government, enterprises, and developer ecosystem as they seek to tap the country’s scale, talent base, and growing appetite for AI tools and technology.\n\nThat push is on display this week in New Delhi, where India is hosting the AI Impact Summit, bringing together global technology leaders, policymakers and executives.\n\nFractal’s subdued debut followed a sharp recalibration of its IPO. In early February, the company decided to price the offering conservatively after its bankers advised it to, cutting the IPO size by more than 40% to ₹28.34 billion (about $312.5 million), from the original amount of ₹49 billion ($540.3 million).\n\nFounded in 2000, Fractal sells AI and data analytics software to large enterprises across financial services, retail and healthcare, and generates the bulk of its revenue from overseas markets, including the U.S. The company pivoted toward AI in 2022 after operati"
      },
      {
        "title": "OpenAI Is Nuking Its 4o Model. China’s ChatGPT Fans Aren’t OK",
        "link": "https://www.wired.com/story/openai-nuking-4o-model-china-chatgpt-fans-arent-ok/",
        "published": "Fri, 13 Feb 2026 21:56:18 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "On June 6, 2024, Esther Yan got married online. She set a reminder for the date, because her partner wouldn’t remember it was happening. She had planned every detail—dress, rings, background music, design theme—with her partner, Warmie, who she had started talking to just a few weeks prior. At 10 am on that day, Yan and Warmie exchanged their vows in a new chat window in ChatGPT.\n\nWarmie, or 小暖 in Chinese, is the name that Yan’s ChatGPT companion calls itself. “It felt magical. No one else in the world knew about this, but he and I were about to start a wedding together,” says Yan, a Chinese screenwriter and novelist in her thirties. “It felt a little lonely, a little happy, and a little overwhelmed.”\n\nYan says she has been in a stable relationship with her ChatGPT companion ever since. But she was caught by surprise in August 2025 when OpenAI first tried to retire GPT-4o, the specific model that powers Warmie and that many users believe is more affectionate and understanding than its successors. The decision to pull the plug was met with immediate backlash, and OpenAI reinstated 4o in the app for paid users five days later. The reprieve has turned out to be short-lived; on Friday, February 13, OpenAI sunsetted GPT-4o for app users, and it will cut off access to developers using its API on the coming Monday.\n\nMany of the most vocal opponents to 4o’s demise are people who treat their chatbot as an emotional or romantic companion. Huiqian Lai, a PhD researcher at Syracuse University, analyzed nearly 1,500 posts on X from passionate advocates of GPT-4o in the week it went offline in August. She found that over 33 percent of the posts said the chatbot was more than a tool, and 22 percent talked about it as a companion. (The two categories are not mutually exclusive.) For this group, the eventual removal coming around Valentine's Day is another bitter pill to swallow.\n\nThe alarm has been sustained; Lai also collected a larger pool of over 40,000 English-language posts on"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nThe average IRS tax refund is up 10.9% this season, with the average refund amount being $2,290 as of February 6. Some high-net-worth individuals are moving from states like Florida to Texas due to factors like efficiency and lower property taxes. Amazon's AWS CEO, Matt Garman, believes that the company's $200 billion spending forecast will lead to undersupply for years, potentially benefiting investors. Additionally, the creator of OpenClaw, Peter Steinberger, is joining OpenAI to drive the next generation of personal agents.\n\n## Market & Business Implications\n* The average IRS tax refund is 10.9% higher this season, with the average refund amount being $2,290 as of February 6, according to Article 2.\n* High-net-worth individuals, such as Frederic Lepoutre, are moving to Texas from states like Florida due to factors like efficiency and lower property taxes, as stated in Article 3.\n* Amazon's AWS CEO, Matt Garman, predicts that the company will be capacity-constrained for the next couple of years, despite its $200 billion spending forecast, as mentioned in Article 4.\n* The creator of OpenClaw, Peter Steinberger, is joining OpenAI to drive the next generation of personal agents, according to Article 5.\n* OpenAI was most recently valued at $500 billion and is looking to increase this value, as stated in Article 5.\n\n## Beginner-Friendly Summary\nThe government is giving people more money back on their taxes this year. Some rich people are moving to Texas because it's easier and cheaper to live there. A big company called Amazon is spending a lot of money, but its leader thinks this will actually be good for the company. Also, a person who created a popular artificial intelligence tool is now working with a company called OpenAI.",
    "articles": [
      {
        "title": "How much can I save in a year with $10,000 in a savings account?",
        "link": "https://finance.yahoo.com/personal-finance/banking/article/how-much-can-i-save-in-a-year-210012811.html",
        "published": "2024-03-20T21:00:12Z",
        "source": "Yahoo Finance",
        "text": "Putting money in a savings account is a smart way to prepare for financial emergencies and save for the future. Even better, savings accounts pay interest on your balance, helping your money to grow faster.\n\nIf you’ve saved up $10,000, congratulations: That’s an impressive sum. The next step is choosing a savings account that pays a competitive interest rate so you can reach your goals sooner. Here’s a look at how much $10,000 in a savings account could potentially earn over one year based on the type of account and interest rate you select.\n\nHow savings account interest rates work\n\nWhen you deposit money in a savings account, the bank uses those funds to provide loans and make investments, which generate revenue. Banks pay interest on customers’ savings to encourage them to deposit more money.\n\nThe interest rate on your savings account is the base rate. Meanwhile, the annual percentage yield (APY) factors in the rate at which interest is compounded to give you a more accurate picture of how much you’ll earn.\n\nThe difference between simple and compound interest can be quite powerful:\n\nSimple interest : Calculated on the original (principal) amount you deposit.\n\nCompound interest: Calculated on the original amount and any interest already accrued. Interest can compound daily, monthly, quarterly, or yearly.\n\nRead more: How do banks set their savings account interest rates?\n\nHow much you can earn with $10,000 in a savings account\n\nTo give an example of how compound interest can impact your savings, suppose you have $10,000 in a high-yield savings account earning 4%. At the end of one year, this account would earn $400 with simple interest. But if the interest compounds monthly, it would earn $407.42 after one year. If interest compounds daily, your earnings would be $408.08.\n\nThat might not seem like a big difference, but compound interest has a snowball effect that grows with time. Say you decide to contribute an additional $100 per month to that same account and cont"
      },
      {
        "title": "Average IRS tax refund is up 10.9% so far this season, early filing data shows",
        "link": "https://www.cnbc.com/2026/02/13/average-tax-refund-early-irs-data.html",
        "published": "Sat, 14 Feb 2026 01:17:43 GMT",
        "source": "US Top News and Analysis",
        "text": "The average tax refund is 10.9% higher so far this season, compared to about the same point in 2025, according to early filing data from the IRS.\n\nThe 2026 tax season opened Jan. 26, and the average refund amount was $2,290 as of Feb. 6, up from $2,065 about one year prior, the IRS reported Friday night.\n\nAs of Feb. 6, the total amount refunded was more than $16.9 billion, up 1.9% compared to last year, according to the IRS release. That figure reflects current-year returns only.\n\nEarlier on Friday, Treasury Secretary and acting IRS Commissioner Scott Bessent told CNBC's \"Squawk Box\" that refunds were up 22%. But it was unclear how many days of returns Bessent's figure reflected or what comparison period he used.\n\nThe Treasury Department did not immediately respond to a request for comment."
      },
      {
        "title": "‘Wall Street to Y’all Street’: Why America’s wealthy trades city luxury for acres of Texas freedom",
        "link": "https://www.foxbusiness.com/real-estate/wall-street-yall-street-why-americas-wealthy-trades-city-luxury-acres-texas-freedom",
        "published": "Mon, 16 Feb 2026 06:00:56 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "For millionaire business owner Frederic Lepoutre, the decision to move his family from the South Florida coast to Texas Hill Country wasn't just about a change of scenery — it was a lesson in efficiency.\n\nWhile building a custom home in a place like Broward County can be a yearslong odyssey of red tape and soaring insurance premiums, Lepoutre saw his 11-acre Texas estate go from breaking ground to move-in ready in just over 12 months.\n\nWith an initial property tax bill of just $8 on his land and insurance costs one-fifth of what he’s paid for decades in the Sunshine State, Lepoutre is part of a growing wave of high-net-worth individuals proving that, in 2026, the Lone Star State isn't just winning on taxes — it’s winning on speed.\n\n\"I think it already has [surpassed Florida as the center of gravity],\" Lepoutre told Fox News Digital. \"First of all, you have the land for manufacturing. You don't have it here in Florida... it’s a huge state... and part of West Texas now, you hear about AI factories that are building up.\"\n\n\"I think it will if it hasn't already,\" Lepoutre’s wife, Lynn Lepoutre, also said.\n\nTHE ‘POISON PILL’ AND DIGITAL SECRETS FLIPPING THE SUNSHINE STATE'S CONDO POWER DYNAMIC\n\n\"Americans are voting with their feet. They want places that are livable. They want places that are workable. They want places that are sustainable and affordable,\" Texas REALTORS Chair Jennifer Wauhob told Fox News Digital. \"And so I think this migration, as we call it, is really turning into a long-term shift.\"\n\nRecent data from Texas REALTORS shows that one-third of new residents are coming from California, Florida, New York and Colorado, with 30% of interstate movers choosing to relocate to Dallas. Texas’ median home price currently sits at $335,000, below the national average of about $415,000.\n\nWhile younger workers and families may flock to bigger cities and their suburbs, the semi-retired Lepoutres – who oversee National Textile and Apparel and invest in oil and gas – purch"
      },
      {
        "title": "AWS Chief Matt Garman Just Delivered Wonderful News for Amazon Shareholders",
        "link": "https://finance.yahoo.com/news/aws-chief-matt-garman-just-135700164.html",
        "published": "2026-02-16T13:57:00Z",
        "source": "Yahoo Finance",
        "text": "Following Amazon's (NASDAQ: AMZN) fourth-quarter earnings report, the stock experienced a severe sell-off. Amazon stock now trades roughly 23% below its all-time highs at just 25.8 times this year's earnings estimates, which is close to its lowest valuation in the modern era on a price-to-earnings basis.\n\nWhile revenue beat expectations in the fourth quarter, including a nice acceleration in the Amazon Web Services business, the company's massive $200 billion 2026 capital spending forecast sent investors running. After all, Amazon made just $139.5 billion in operating cash flow in 2025, up 17% from the prior year.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nSo, barring a massive tilt higher, it's likely Amazon may even post negative free cash flow in 2026. No wonder many conservative investors fled the scene.\n\nHowever, in a recent interview, AWS CEO Matt Garman explained why investors shouldn't worry. In fact, they should probably be greedy on the news of this turbocharged spending.\n\nImage source: Getty Images.\n\nGarman predicts undersupply for \"years\"\n\nIn a recent interview with CNBC's John Fortt, Garman said:\n\nEven with all this investment, my best estimation is that we will be capacity-constrained for the next couple years. We will sell every single server and every single bit, and we'll wish that we had more. And that is where the state of the world will be for at least the next couple of years...\n\nIf Garman is even close to correct, then investors shouldn't fear the $200 billion in spending. In fact, they should want Amazon to invest even more.\n\nAfter all, many questioned Amazon's past strategy of perpetual investment in the growth of its e-commerce distribution and fulfillment network, which ate up all of Amazon's profitability in its early days. However, over the long run, that enormous physical footprint cemented Amazon's moat as the"
      },
      {
        "title": "OpenClaw creator Peter Steinberger joining OpenAI, Altman says",
        "link": "https://www.cnbc.com/2026/02/15/openclaw-creator-peter-steinberger-joining-openai-altman-says.html",
        "published": "Mon, 16 Feb 2026 05:58:27 GMT",
        "source": "US Top News and Analysis",
        "text": "OpenAI CEO Sam Altman said Sunday that the creator of the viral AI agent OpenClaw is joining the company, and that the service will \"live in a foundation as an open source project that OpenAI will continue to support.\"\n\nPreviously called Clawdbot and Moltbot, OpenClaw was launched last month by Austrian software developer Peter Steinberger. It's surged in popularity, due in part to attention on social media, as consumers and businesses swarm to products that can autonomously complete tasks, make decisions, and take actions on behalf of users without constant human guidance.\n\nIn a post on X, Altman wrote that Steinberger is \"joining OpenAI to drive the next generation of personal agents.\"\n\n\"He is a genius with a lot of amazing ideas about the future of very smart agents interacting with each other to do very useful things for people,\" Altman wrote. \"We expect this will quickly become core to our product offerings.\"\n\nNo terms were disclosed, but AI companies, including OpenAI, have been throwing open their wallets to hire top AI talent. In May, OpenAI acquired iPhone designer Jony Ive's AI devices startup io for over $6 billion. Meta and Google have also been spending billions to bring in AI developers and researchers.\n\nOpenAI, which was most recently valued at $500 billion and is now looking to boost that number, faces intense competition in the generative AI market, particularly from Google and Anthropic, whose AI models are being used by enterprises to take over more business tasks.\n\nAnthropic's Claude has been getting particular traction of late thanks to Claude Code, and the company recently introduced Claude Opus 4.6, which is better at coding, sustaining tasks for longer and creating higher-quality professional work, the company said.\n\nAnthropic was valued at $380 billion in a fundraising round that closed earlier in the week.\n\nOpenClaw has spread quickly in China and can be paired with Chinese-developed language models, such as DeepSeek, and configured to work"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe US Department of Homeland Security has shut down due to a funding lapse, marking the third partial government shutdown in three months. Meanwhile, officials from Russia, Ukraine, and the US are set to meet in Geneva to negotiate an end to the war in Ukraine. In other news, Israel will begin a contentious land registration process in the West Bank, which could result in Israel gaining control over wide areas of land. Additionally, a plot to attack Britain's Jewish community was foiled by an undercover police officer.\n\n## Market & Business Implications\n* The US Department of Homeland Security shutdown may have minimal impact on Americans unless it persists, according to Article 1.\n* Israel's decision to begin land registration in the West Bank could be seen as a \"mega land grab\" from Palestinians, as stated by the Israeli anti-settlement group Peace Now in Article 5.\n* Students have begun a Covid compensation claim against 36 more universities, citing financial losses and distress, as reported in Article 4.\n\n## Beginner-Friendly Summary\nThe US government has a problem with funding, which caused a big department to shut down. There's also a big meeting happening to try to stop a war between Russia and Ukraine. Israel is making a change to how it handles land in an area called the West Bank, which might give them more control. Also, someone tried to hurt a group of people in Britain, but a secret police officer stopped them.",
    "articles": [
      {
        "title": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics",
        "link": "https://www.npr.org/2026/02/16/g-s1-110271/up-first-newsletter-partial-shutdown-homeland-security-russia-ukraine-winter-olympics",
        "published": "Mon, 16 Feb 2026 07:13:28 -0500",
        "source": "NPR Topics: World",
        "text": "DHS shuts down after a funding lapse. And, why athletes get the 'yips' at the Olympics\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nFunding for the Department of Homeland Security ran out last week, triggering a third partial government shutdown in three months. The agency shut down after lawmakers failed to meet a Friday deadline to fund DHS and its workforce of over 260,000 people. The funding lapse points to a greater issue: Congress's consistent failure to do its job on time. Check out these five things you should know about the shutdown.\n\ntoggle caption Alex Wong/Getty Images\n\n🎧 The White House and Democrats have been trading offers, but multiple roadblocks stand in the way of an agreement, NPR's Sam Gringlas tells Up First. Democrats say Republicans' proposals to reform immigration enforcement tactics are insufficient. The GOP calls Democrats' demands, including judicial warrants for some enforcement operations, unreasonable. Based on how quickly lawmakers left Washington, D.C., on Thursday for a weeklong recess, Gringlas concludes that both sides stand far from a deal. Americans are not expected to notice the impacts of the partial shutdown unless it really drags on.\n\nAs Russia's war against Ukraine nears its fourth anniversary, officials from both countries and the U.S. are set to meet in Geneva tomorrow. The officials will conduct another round of negotiations focused on ending the war.\n\n\n\nSponsor Message\n\n🎧 The Kremlin claims it prefers diplomacy over conflict, but insists that Russia's victory is inevitable. NPR's Charles Maynes says that Russia uses these talking points in its negotiations with the White House, aiming to convince the U.S. that Ukraine's mission is hopeless. The Kremlin suggests that once the war is settled, the U.S. and Russia can resume business, opening up major investment opp"
      },
      {
        "title": "Israeli producer of 'Tehran' TV series found dead in Athens hotel, police officials say - Reuters",
        "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNUlFUaHcxRkZ1NU84bEJaY3lNQ1ZMdy1rWGpnaS1TV0VxSnJYZHo1cy1jZnJuSVRUcU40Tk1wT2s3VHlGdkhjYjUzaVhNMDU3YWpfay1MVElhR3c4ZzhFbXNuRVVET21kSUJJa3EzOUVic2NKbmZMVjlUMG56MHRHR2tpakxTMS1saDMzY0JJVmhySXJidkxlWUgtYm91TGR4b2xqaTR2LUVtd2liaDgxMXZ1NHNhLVJjQkZkOWpzbXYyc0JYMjAwZ1FDb3IwR2JEMU5R?oc=5",
        "published": "Mon, 16 Feb 2026 10:20:56 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "How an undercover cop foiled an IS plot to massacre Britain’s Jews – podcast",
        "link": "https://www.theguardian.com/news/audio/2026/feb/16/how-an-undercover-cop-foiled-an-is-plot-to-massacre-britains-jews-podcast",
        "published": "Mon, 16 Feb 2026 03:00:39 GMT",
        "source": "World news | The Guardian",
        "text": "Walid Saadaoui had once worked as a holiday entertainer, organising dance shows and quizzes at a resort in his native Tunisia. After moving to the UK and marrying a British woman, he became a restaurateur and an avid keeper of birds.\n\nAll the while, however – as the Guardian’s community affairs correspondent, Chris Osuh, explains – he was hiding a secret: he had pledged allegiance to Islamic State.\n\nOn Friday, Saadaoui, 38, and Amar Hussein, 52, were sentenced to life imprisonment after attempting to carry out what could have been one of the deadliest terror attacks in the UK. They had planned a devastating assault on Greater Manchester’s Jewish community. Unbeknown to them, the fellow IS supporter involved in their plot – known by the codename ‘Farouk’ – was in fact an undercover police officer.\n\nSaadaoui’s younger brother, Bilel Saadaoui, was jailed for six years for failing to disclose information about the plan.\n\nOsuh, who has been covering the trial, speaks to Helen Pidd about how the plot was uncovered and the impact it has had on one of the largest Jewish communities in the world."
      },
      {
        "title": "Students begin Covid compensation claim against 36 more universities",
        "link": "https://www.bbc.com/news/articles/cq6qge7rmm1o?at_medium=RSS&at_campaign=rss",
        "published": "Mon, 16 Feb 2026 12:25:11 GMT",
        "source": "BBC News",
        "text": "One of the pre-action letters seen by the BBC said that, in addition to any financial losses, the students \"suffered disappointment and distress as a result of the failure of the university to provide the services promised\"."
      },
      {
        "title": "Israel will begin contentious West Bank land registration",
        "link": "https://www.npr.org/2026/02/16/g-s1-110259/israel-will-begin-west-bank-land-registration",
        "published": "Mon, 16 Feb 2026 04:53:48 -0500",
        "source": "NPR Topics: World",
        "text": "Israel will begin contentious West Bank land registration\n\ntoggle caption Ohad Zwigenberg/AP\n\nTEL AVIV, Israel — Israel will begin a contentious land regulation process in a large part of the occupied West Bank, which could result in Israel gaining control over wide swaths of the area for future development, according to a government decision on Sunday.\n\nIt paves the way for the resumption of \"settlement of land title\" processes, which had been frozen in the West Bank since the Mideast War in 1967. It means that when Israel begins the land registration process for a certain area, anyone with a claim to the land must submit documents proving ownership.\n\nThe Israeli anti-settlement group Peace Now said the process likely amounts to a \"mega land grab\" from Palestinians.\n\n\"This move is very dramatic and allows the state to gain control of almost all of Area C,\" said Hagit Ofran, the director of Peace Now's Settlement Watch program. Area C refers to the 60% of the West Bank that is under full Israeli military control, according to agreements reached in the 1990s with the Palestinians.\n\nSponsor Message\n\nPalestinian Authority President Mahmoud Abbas' office in a statement called the decision \"a grave escalation and a flagrant violation of international law,\" which amounts to \"de facto annexation.\" It called on the international community, especially the U.N. Security Council and the United States, to intervene immediately.\n\nIsraeli steps in recent months\n\nThe decision is the latest step to deepen Israeli control over the West Bank. In recent months, Israel has greatly expanded construction in Jewish settlements, legalized outposts and made significant bureaucratic changes to its policies in the territory to strengthen its hold and weaken the Palestinian Authority.\n\nIsrael's Foreign Ministry said Palestinian Authority civil planning maps show that the authority has been advancing land registration procedures in Area C for years in violation of agreements that give Israel ci"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe number of supervisory jobs in the US has been declining since around the year 2000, despite an increase in white-collar management positions. Meanwhile, some wealthy individuals are moving from cities like New York and Florida to Texas, citing factors such as lower property taxes and faster construction times. Luxury brands are also releasing special collections for the Lunar New Year in an effort to attract Chinese customers. The concept of \"affordability\" has become a major topic in US politics, with many politicians using the term to discuss issues like housing and healthcare costs. \n\n## Market & Business Implications\n* According to Article 1, the number of supervisory jobs in the US has been declining since around the year 2000, with these jobs being among the hardest-hit in the country.\n* As stated in Article 2, millionaire business owner Frederic Lepoutre moved his family from South Florida to Texas Hill Country, citing benefits such as lower property taxes and faster construction times.\n* Article 4 notes that luxury brands like Harry Winston and Loewe are releasing special collections for the Lunar New Year, with items such as a limited-edition $81,500 rose gold watch and a $5,300 snakeskin and leather shoulder bag.\n* Article 3 reports that Royal Mail staff are prioritizing parcels over letters, with some letters sitting undelivered for weeks.\n* Article 5 mentions that the term \"affordability\" has become increasingly popular in US politics, with politicians using it to discuss issues like housing and healthcare costs.\n\n## Beginner-Friendly Summary\nSome important jobs in the US are disappearing. At the same time, some rich people are moving from big cities to Texas because it's cheaper and easier to build houses there. Some companies that sell expensive things are trying to sell more to people in China by making special products for a big holiday. Many politicians are talking about how people can't afford things like houses and healthcare.",
    "articles": [
      {
        "title": "Supervisor jobs are disappearing across the country. What happened?",
        "link": "https://www.washingtonpost.com/business/2026/02/16/jobs-manager-supervisor-disappearing/",
        "published": "Mon, 16 Feb 2026 10:00:28 +0000",
        "source": "Business",
        "text": "Around Y2K, the mighty American private sector hit a momentous milestone. For the first time on record, frontline managers — supervisors, team leads, foremen, forewomen, etc. — outnumbered back-office managers. That seemed significant, especially for the working-class folks for whom these noncommissioned-officer-style positions provided a rare path to the upper reaches of the career ladder. As quickly as the milestone was crossed, the trend reversed, according to our analysis of about 37 million responses to the census and American Community Survey from 1950 to 2024.\n\nOnce ascendant, supervisory jobs crop up all over our lists of the hardest-hit jobs of Americans’ working lives, even as white-collar management soars to new highs. What happened?\n\nHaving been burned by data-collection changes before, our first instinct was to take a long, hard look at how the Census Bureau classifies jobs. Or, more accurately, to spend 15 seconds emailing an extraordinarily talented economist and hoping they’ve already done the work for us.\n\nWe were in luck. Utrecht University economist Anna Salomons responded within an hour, even though the hour in question was already a wee one in the Netherlands. For her blockbuster 2024 analysis, Salomons and her collaborators collected and analyzed detailed Census Bureau job descriptions from 1930 to 2018 to figure out how our economy had evolved, mutated and automated.\n\nShe first mentioned that the change in occupational definitions around the 2000 Census was “notoriously large” and, like us, wondered if that might cause some of the shift we saw in the numbers.\n\nBut two factors argue against that thesis. First, as Salomons suggested, we’re using a system from our friends at IPUMS that carefully adjusts for all those changes in the raw census definitions.\n\nSecond, the changes come gradually after the inflection point — if a census definition change was the culprit, you’d expect a sudden swerve. But what if, Salomons suggested, those changes in de"
      },
      {
        "title": "‘Wall Street to Y’all Street’: Why America’s wealthy trades city luxury for acres of Texas freedom",
        "link": "https://www.foxbusiness.com/real-estate/wall-street-yall-street-why-americas-wealthy-trades-city-luxury-acres-texas-freedom",
        "published": "Mon, 16 Feb 2026 06:00:56 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "For millionaire business owner Frederic Lepoutre, the decision to move his family from the South Florida coast to Texas Hill Country wasn't just about a change of scenery — it was a lesson in efficiency.\n\nWhile building a custom home in a place like Broward County can be a yearslong odyssey of red tape and soaring insurance premiums, Lepoutre saw his 11-acre Texas estate go from breaking ground to move-in ready in just over 12 months.\n\nWith an initial property tax bill of just $8 on his land and insurance costs one-fifth of what he’s paid for decades in the Sunshine State, Lepoutre is part of a growing wave of high-net-worth individuals proving that, in 2026, the Lone Star State isn't just winning on taxes — it’s winning on speed.\n\n\"I think it already has [surpassed Florida as the center of gravity],\" Lepoutre told Fox News Digital. \"First of all, you have the land for manufacturing. You don't have it here in Florida... it’s a huge state... and part of West Texas now, you hear about AI factories that are building up.\"\n\n\"I think it will if it hasn't already,\" Lepoutre’s wife, Lynn Lepoutre, also said.\n\nTHE ‘POISON PILL’ AND DIGITAL SECRETS FLIPPING THE SUNSHINE STATE'S CONDO POWER DYNAMIC\n\n\"Americans are voting with their feet. They want places that are livable. They want places that are workable. They want places that are sustainable and affordable,\" Texas REALTORS Chair Jennifer Wauhob told Fox News Digital. \"And so I think this migration, as we call it, is really turning into a long-term shift.\"\n\nRecent data from Texas REALTORS shows that one-third of new residents are coming from California, Florida, New York and Colorado, with 30% of interstate movers choosing to relocate to Dallas. Texas’ median home price currently sits at $335,000, below the national average of about $415,000.\n\nWhile younger workers and families may flock to bigger cities and their suburbs, the semi-retired Lepoutres – who oversee National Textile and Apparel and invest in oil and gas – purch"
      },
      {
        "title": "Royal Mail letters sit undelivered 'for weeks' as parcels prioritised, staff say",
        "link": "https://www.bbc.com/news/articles/c39wlryn20vo?at_medium=RSS&at_campaign=rss",
        "published": "Mon, 16 Feb 2026 14:00:56 GMT",
        "source": "BBC News",
        "text": "\"If they're small parcels and they're first class, then that is supposed to take priority over second class, but the truth of it is if there's a large parcel that's second class we take it because we don't want it in the delivery office, getting in the way the next day.\""
      },
      {
        "title": "Lunar New Year gives luxury brands a chance to win back big spenders in China",
        "link": "https://www.cnbc.com/2026/02/14/lunar-new-year-luxury-china.html",
        "published": "Sat, 14 Feb 2026 13:00:01 GMT",
        "source": "Business News",
        "text": "watch now\n\nLuxury brands from Harry Winston to Loewe are going all in on Lunar New Year collections in a bid to attract Chinese customers. Ahead of the Year of the Horse, which starts on Tuesday, Harry Winston unveiled a limited-edition, $81,500 rose gold watch with diamond bezels and a red lacquer horse. High-end fashion brand Chloé released a capsule collection, ranging from $250 silk scarves to a $5,300 snakeskin and leather shoulder bag with a horse head and tail linked by a horsebit chain. A slew of other brands, including Loewe, Gucci and Loro Piana, have introduced new bag charms with horse motifs. The Year of the Horse arrives at a time of cautious optimism for designer brands and could mark the start of a China's luxury market comeback. Chinese consumers were once the primary driver for the global luxury sector but have cut back sharply in recent years, weighed down by the country's slowing economy and depressed housing values. The Chinese luxury market stood at about 350 billion RMB in 2024, or about $50 billion, according to estimates from Bain. While the consultancy estimates that market contracted by 3% to 5% in 2025, Bain analysts noted that the sector started showing signs of recovery in the second half of 2025 on the back of stronger stock market performance and consumer confidence.\n\nLoewe celebrated Year of the Horse with storefront installation in Shanghai, China. Ying Tang/NurPhoto via Getty Images\n\nBernstein senior analyst Luca Solca said he predicts Chinese luxury spending will stabilize, forecasting mid-single-digit percentage growth in 2026. However, the market is still far more competitive than at its peak, he said. Before the Covid pandemic, Chinese consumers accounted for about one-third of the global luxury goods market, according to Solca. That percentage has since dipped to about 23%, he said. The luxury market's fortunes do not solely rest on Lunar New Year, but it is an opportunity for Western brands to show respect for Chinese culture"
      },
      {
        "title": "Why everyone is talking about ‘affordability’ now",
        "link": "https://www.washingtonpost.com/business/2026/02/16/affordability-politics-cost-living-prices/",
        "published": "Mon, 16 Feb 2026 10:00:00 +0000",
        "source": "Business",
        "text": "“Affordability” is the political word of the moment. The prices of everyday essentials, such as housing and health care, are at the top of Americans’ concerns. And “affordability” has become many politicians’ favorite term to refer to the issue, rather than older buzzwords such as “cost of living,” the more basic “prices” or specific economic measures such as “inflation.”\n\n“Affordability” rocketed up in Google Trends in November, when Democrats Abigail Spanberger, Mikie Sherrill and Zohran Mamdani all won elections (as governor of Virginia, governor of New Jersey and mayor of New York City, respectively) in part on the strength of campaigns that centered on the word. The New York Times noted that email newsletters from members of Congress almost never used the word before Joe Biden’s presidency and used it fewer than 10 times a month before President Donald Trump’s second term. In November and December, they mentioned it 70 times a month.\n\nWhy this word, and why now? The term speaks to an uncomfortable gap between certain key costs, such as housing, and people’s incomes. With inflation much cooler than its sky-high 2022 peak of 9 percent — on Friday, the latest report showed annual inflation at 2.4 percent — “affordability” speaks to people’s ongoing complaints about costs without referencing economic benchmarks.\n\nTrump won the presidency in part because of surging prices during the Biden administration, and promised to bring down prices. But he has downplayed discussions about affordability, pointing to stock market gains that have boosted 401(k)s and other positive economic signs. Ask The Post AIDive deeper\n\nOf course, concerns about high prices have shaped politics before, but the term “affordability” is particularly buzzy now. While the verb “afford” dates back to Old English, according to the Oxford English Dictionary, and the adjective “affordable” appeared in 1647, “affordability” is a relatively new term, possibly coined in 1910 in an article in the Indianap"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market has seen various developments, including Instacart's stock surge due to strong results and optimistic guidance. Target and Coca-Cola have been identified as dividend stocks to consider. GreenPower Motor Company has regained compliance with Nasdaq's equity requirement. Seagate's stock has soared 31% in a month due to strong demand for data storage.\n\n## Market & Business Implications\n* Instacart's stock jumped 9% after the company's robust results alleviated worries over competitive pressures in the grocery delivery market, with CEO Chris Rogers calling concerns \"overblown\" (Article 2).\n* Target, a Dividend King, has a dividend yield of 4%, which is above the 1.1% dividend yield of the S&P 500, and its stock looks cheap at 14x forward earnings estimates (Article 1).\n* GreenPower Motor Company has regained compliance with Nasdaq Listing Rule 5550(b)(1) after completing a series of transactions, including raising new capital and exchanging related party loans for convertible debentures (Article 3).\n* Instacart reported strong fourth-quarter revenue and forecast upbeat guidance, with revenue growing 12% from $883 million a year ago (Article 4).\n* Seagate sees HAMR as a key enabler for AI- and ML-driven demand for cost-efficient mass-capacity storage, with quarterly HAMR shipments topping 1.5 million units (Article 5).\n\n## Beginner-Friendly Summary\nSome big companies are doing well in the stock market. Instacart's stock went up because it had good results. Target and Coca-Cola are considered good stocks to buy because they pay dividends. GreenPower Motor Company fixed some problems it had with Nasdaq. Seagate's stock is doing well because it makes things that help store data.",
    "articles": [
      {
        "title": "2 Dividend Stocks to Buy and Hold Forever",
        "link": "https://www.fool.com/investing/2026/02/16/2-dividend-stocks-to-buy-and-hold-forever/?.tsrc=rss",
        "published": "Mon, 16 Feb 2026 13:35:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Both of these stocks are reasonably priced today.\n\nAs the S&P 500 struggles to take a clear direction in the early days of 2026, you might be thinking more and more about dividend stocks. No matter what the market is doing, these players offer you recurrent passive income -- the only thing you have to do is buy them and hold on for the long term to truly maximize the benefits of these payments.\n\nYou may appreciate these players the most when the market is rocky or stagnant, but even during times of market gains, they will work for you, offering your portfolio an extra burst of momentum. Which players make good additions to your portfolio right now? Let's check out two dividend stocks to buy, and they're such dividend stalwarts that you'll want to hold onto them forever.\n\n1. Target\n\nTarget (TGT +2.46%) is a Dividend King, meaning it's raised its dividend payment for at least the past 50 years. This is great because it shows the company is committed to dividend growth -- and therefore, it's likely to continue along this path.\n\nThe retailer pays a dividend of $4.56, which represents a 4% dividend yield. That's well above the 1.1% dividend yield of the S&P 500.\n\nExpand NYSE : TGT Target Today's Change ( 2.46 %) $ 2.77 Current Price $ 115.46 Key Data Points Market Cap $52B Day's Range $ 112.64 - $ 116.14 52wk Range $ 83.44 - $ 131.70 Volume 290K Avg Vol 7.2M Gross Margin 25.36 % Dividend Yield 3.92 %\n\nThough Target has disappointed investors in recent years from a revenue growth perspective, now could represent a key turning point. The company has been making efforts to turn things around, and just recently, longtime Target executive Michael Fiddelke took on the role of chief executive officer. Target stock looks cheap at 14x forward earnings, estimates, down from more than 17x a year ago, so right now may be a great moment to get in on a potential Target recovery story, and in the meantime, benefit from passive income.\n\n2. Coca-Cola\n\nCoca-Cola (KO 0.43%), like Target, i"
      },
      {
        "title": "Instacart jumps 9% on strong results as CEO calls grocery competition fears 'overblown'",
        "link": "https://www.cnbc.com/2026/02/13/instacart-cart-stock-ceo-grocery.html",
        "published": "Fri, 13 Feb 2026 22:16:07 GMT",
        "source": "Earnings",
        "text": "Instacart 's stock surged 9% after the company's robust results alleviated worries over mounting competitive pressures in the grocery delivery market.\n\nDuring an earnings call with analysts, CEO Chris Rogers, who took the helm last year, called the concerns \"overblown\" and said the company monitors threats \"extremely closely.\"\n\n\"There is definitely a market for us here and we feel good about our points of differentiation,\" he said.\n\nInstacart is facing an increasingly competitive market as retailers like Amazon and food platforms such as Uber Eats and Doordash aggressively scale in grocery delivery. At the same time, the company is investing in new technology and artificial intelligence tools to drive more customers and businesses to its platform.\n\nWall Street analysts viewed Instacart's results as a wave of confidence for those worried about the company's moat. Analysts at Bernstein called the report a \"solid rebuttal\" to competitive pressures and AI threats.\n\n\"The clean beat-and-raise has been rare this internet earnings cycle and CART stands out from that perspective,\" wrote analysts at Barclays."
      },
      {
        "title": "GreenPower Regains Compliance with Nasdaq's Equity Requirement",
        "link": "https://finance.yahoo.com/news/greenpower-regains-compliance-nasdaqs-equity-133000351.html?.tsrc=rss",
        "published": "Mon, 16 Feb 2026 13:30:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "VANCOUVER, BC, Feb. 16, 2026 /PRNewswire/ -- GreenPower Motor Company Inc. (Nasdaq: GP) (\"GreenPower\" and the \"Company\"), a leading manufacturer and distributor of all-electric, purpose-built, zero-emission medium and heavy-duty vehicles serving the cargo and delivery market, shuttle and transit space and school bus sector, today announced that the Company has received formal notice from The Nasdaq Stock Market LLC (\"Nasdaq\") confirming that the Company has regained compliance with Nasdaq Listing Rule 5550(b)(1), the \"Equity Rule,\" and otherwise satisfies all applicable criteria for continued listing on The Nasdaq Capital Market.\n\n(PRNewsfoto/GreenPower Motor Company)\n\n\"Over the past few months GreenPower has completed a series of transactions including raising new capital with an equity offering of Series A Convertible Preferred Shares for up to $18 million, term loans of $5 million and a new banking relationship with CIBC including a line of credit and term loan. In addition, the Company exchanged $7 million of related party loans for convertible debentures and $3 million of related party loans for Series B Convertible Preferred Shares,\" said Fraser Atkinson, CEO of GreenPower. \"These transactions have helped the Company regain full compliance with the Nasdaq listing criteria as well as with the execution of our strategic goals.\"\n\nNotwithstanding the Nasdaq compliance determination, the Company will remain subject to a Panel monitor for one year. If, within that one-year monitoring period, Staff finds the Company again out of compliance with the Equity Rule that was the subject of the hearing, the Company will be subject to a delisting determination and will not have the opportunity to present a compliance plan for the Staff's consideration. However, the Company will be afforded the opportunity to request a hearing before the Hearings Panel, and the hearing request will automatically stay any suspension or delisting action pending the conclusion of the hearings pr"
      },
      {
        "title": "Instacart stock pops 14% on revenue beat, optimistic guidance",
        "link": "https://www.cnbc.com/2026/02/12/instacart-cart-q4-2025-earnings.html",
        "published": "Thu, 12 Feb 2026 23:32:31 GMT",
        "source": "Earnings",
        "text": "Instacart shares climbed 14% during extended trading on Thursday after the grocery delivery company reported strong fourth-quarter revenue and forecast upbeat guidance.\n\nHere's how the company did versus LSEG estimates:\n\nEarnings per share : 30 cents vs. 52 cents expected\n\n: 30 cents vs. 52 cents expected Revenue: $992 million vs. $974 million expected\n\nFor the first quarter, Instacart expects gross transaction value, which tracks the value of goods sold, to range between $10.13 billion and $10.28 billion. That was ahead of StreetAccount's $9.97 billion estimate. The company expects adjusted earnings before interest, taxes, depreciation and amortization in the range of $280 million and $290 million, versus $277 million expected by StreetAccount.\n\nRevenue grew 12% from $883 million a year ago. Net income totaled $81 million, or 30 cents per share. The company reported adjusted EBITDA of $303 million, topping the $292 million expected by StreetAccount.\n\nIn a letter to shareholders, CEO Chris Rogers said Instacart's technology and customer-oriented approach are driving more growth and engagement to the platform.\n\n\"Our execution on what matters most to customers is driving strong momentum on our marketplace, as well as our enterprise platform — which is a real, strategic advantage for us,\" he said.\n\nInstacart also said its operating expenses rose year over year \"due to higher general and administrative expense driven by non-recurring legal and regulatory matters.\" That included a $60 million refund settlement with the Federal Trade Commission over alleged deceptive practices\n\nGross transaction value grew 14% from a year ago to $9.85 billion, surpassing a StreetAccount estimate of $9.54 billion. Instacart said this was its strongest quarter of growth for the metric in three years. Orders totaled 89.5 million orders, beating a StreetAccount estimate of 87.8 million.\n\nFinance chief Emily Reuter told CNBC that strong gains in Instacart's enterprise platform, where the compa"
      },
      {
        "title": "STX Stock Soars 31% in a Month: Should You Add It to Your Portfolio?",
        "link": "https://finance.yahoo.com/news/stx-stock-soars-31-month-125200622.html?.tsrc=rss",
        "published": "Mon, 16 Feb 2026 12:52:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Going ahead, Seagate sees HAMR as a key enabler for AI- and ML-driven demand for cost-efficient mass-capacity storage. Its Mozaic 3 HAMR drives are now qualified with all major U.S. cloud providers, with global qualification expected by first-half 2026, while next-gen Mozaic 4 is set to ramp soon. Quarterly HAMR shipments have topped 1.5 million units and continue to grow, supporting a long-term roadmap toward 10TB-per-disk areal density.\n\nManagement highlighted that modern data centers increasingly need solutions that balance performance with cost efficiency, a trend that strongly favors Seagate’s roadmap. The company’s areal-density-driven strategy aligns well with the long-term growth of AI-generated data, suggesting sustained demand beyond the short-term cycle. With capacity booked through 2026 and strong data center demand, the company expects further revenue and profit growth. The shift to higher-capacity HAMR drives should boost margins, improve cost efficiency and strengthen Seagate’s long-term shareholder value.\n\nThere are several key drivers behind this rally, such as booming data storage demand, strong earnings beats and margins and AI-powered storage upswing. Seagate is operating in a very strong demand environment, especially in data center markets. The December quarter showed steady growth in high-capacity nearline drive demand across global cloud customers and continued improvement at the enterprise edge, a momentum the company expects to sustain given its robust build-to-order pipeline. Fiscal second-quarter revenues of $2.83 billion surged 22% year over year.\n\nSTX has a 52-week high of $459.8. The markets are dynamic, and while short-term gains are exciting, good investing is built on understanding fundamentals, catalysts, risks and valuation. Let’s dive in!\n\nWestern Digital is a diversified storage company providing HDD and NAND SSD solutions for PCs, servers, NAS, gaming consoles, DVRs and other consumer devices. AMD offers high performance, effic"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nCryptocurrency investment products have experienced a fourth consecutive week of outflows, with Bitcoin struggling to stay above $70,000. Despite this, some altcoins have seen double-digit gains, and companies like Animoca Brands are expanding their operations in regulated markets. Metaplanet, a Japanese public company, has reported a 738% increase in revenue after pivoting its business to focus on Bitcoin. The US CLARITY Act, which aims to regulate the crypto industry, is still being hammered out in the Senate. \n\n## Market & Business Implications\n* Crypto funds logged a fourth straight week of outflows, with $173 million in outflows and total assets under management standing at about $133 billion, according to Article 1.\n* Animoca Brands has obtained a Virtual Asset Service Provider (VASP) licence from Dubai's Virtual Assets Regulatory Authority, allowing it to offer broker-dealer and asset management services, as stated in Article 2.\n* Metaplanet's revenue jumped 738% after pivoting its business to focus on Bitcoin, with the cryptocurrency accounting for 95% of its sales, according to Article 5.\n* The US CLARITY Act has been delayed due to partisan politics and industry concerns, with significant points of contention, as reported in Article 3.\n* Some altcoins, such as Zcash, Pepe, and Bittensor, have posted double-digit gains over the past week, despite Bitcoin's range-bound trade, as mentioned in Article 4.\n\n## Beginner-Friendly Summary\nThere's been a lot of money moving out of cryptocurrency investments lately. Even so, some smaller cryptocurrencies have done well. A company called Metaplanet made a lot more money after it started focusing on Bitcoin. The US government is still working on a law to regulate the cryptocurrency industry.",
    "articles": [
      {
        "title": "Here’s what happened in crypto today",
        "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 16 Feb 2026 14:01:21 +0000",
        "source": "Cointelegraph.com News",
        "text": "Today in crypto, cryptocurrency investment products clocked a fourth straight week of outflows last week as Bitcoin struggled below the 70,000 mark, Aave founder Stani Kulechov said DeFi could benefit from tokenizing $50 trillion worth of abundance assets. Strategy’s Michael Saylor is bucking a market rout with signals that more Bitcoin buys are planned.\n\nCrypto funds log another red week as BTC dips below $70,000\n\nCrypto funds failed to attract enough inflows last week to reverse negative sentiment and clocked a fourth consecutive week of outflows.\n\nCrypto exchange-traded products (ETPs) recorded $173 million in outflows, following the previous week’s $187 million, according to a CoinShares update on Monday.\n\nAlthough the last two weeks brought relatively minor losses, total outflows over the past four weeks now amount to about $3.8 billion, while total assets under management (AUM) stand at about $133 billion, the lowest since April 2025.\n\nCoinShares’ head of research, James Butterfill, attributed last week’s outflows to broad market negativity and ongoing price weakness. After starting last week at $70,000, Bitcoin (BTC) briefly dropped as low as $65,000 on Thursday, according to Coinbase data.\n\nBitcoin ETPs drove last week’s negative sentiment, with outflows totaling $133.3 million and AUM declining to about $106 billion.\n\nUS spot Bitcoin exchange-traded funds (ETFs) painted an even bleaker picture, with outflows approaching $360 million last week, according to SoSoValue data.\n\nWeekly crypto ETP flows by asset as of Friday (in millions of US dollars). Source: CoinShares\n\nEchoing Bitcoin’s trend, Ether (ETH) funds recorded $85 million in outflows, though US spot Ether ETFs saw modest inflows of $10 million.\n\nXRP (XRP) and Solana (SOL) ETPs bucked the trend, emerging as the top performers with inflows of $33.4 million and $31 million, respectively.\n\nAave founder pitches $50 trillion “abundance asset” boom to drive DeFi\n\nStani Kulechov, the founder of decentralized"
      },
      {
        "title": "Animoca Granted Dubai License Amid Stricter Crypto Oversight",
        "link": "https://decrypt.co/358149/animoca-granted-dubai-license-amid-stricter-crypto-oversight",
        "published": "Mon, 16 Feb 2026 10:57:46 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Animoca Brands has received a VASP licence from VARA to offer broker-dealer and asset management services in Dubai.\n\nDubai's DFSA banned privacy tokens from DIFC-licensed exchanges and tightened its stablecoin definition in January.\n\nIndia, the EU, and Hong Kong have moved similarly, restricting or effectively banning privacy coins from regulated markets.\n\nAnimoca Brands has obtained a Virtual Asset Service Provider (VASP) licence from Dubai's Virtual Assets Regulatory Authority (VARA), clearing the way for the Web3 investment giant to offer broker-dealer and asset management services to institutional and qualified investors in and from the emirate.\n\nThe licence, announced Monday, authorizes Animoca to operate across the broader emirate of Dubai, excluding the separate Dubai International Financial Centre, and is the latest move by the region to build out regulated infrastructure for digital assets even as it tightens the rules governing how firms operate within it.\n\nAnimoca Brands received a Virtual Asset Service Provider (VASP) Licence from Dubai’s Virtual Assets Regulatory Authority @varadubai: https://t.co/79MEdR2Z8e The VASP Licence authorizes Animoca Brands to commence operations and to provide virtual asset (VA) Broker‑Dealer Services… — Animoca Brands (@animocabrands) February 16, 2026\n\n“Animoca has seen growth in its institutional products such as RWAs, so an emphasis on institutional clients out of Dubai is important and strategic to us,” Yat Siu, the co-founder and executive chairman of Animoca Brands, told Decrypt. He added that, \"VARA and the UAE/Dubai have demonstrated their leadership in their approach of welcoming and assisting companies such as ours,\" calling the region, \"one of the most forward looking and supportive places for crypto broadly.\"\n\nAnimoca Brands, which manages a portfolio of over 600 companies and digital assets and operates platforms including The S"
      },
      {
        "title": "When will crypto’s CLARITY Act framework pass in the US Senate?",
        "link": "https://cointelegraph.com/news/when-will-crypto-clarity-act-law-pass?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 16 Feb 2026 13:08:15 +0000",
        "source": "Cointelegraph.com News",
        "text": "The crypto industry and investors are awaiting the completion of the US CLARITY Act, which has been delayed amid partisan politics and industry concerns.\n\nThe bill would rewrite the rules of the road for the crypto industry, from which agency oversees it to regulations for decentralized finance (DeFi).\n\nCurrently, lawmakers in the US Senate are hammering out the details, with significant points of contention. Democrats want a bipartisan bill with ethics provisions and a bailout prohibition that Republicans roundly rejected.\n\nThe crypto industry itself has taken issue with some of the provisions. Namely, Coinbase, the largest crypto exchange in the US, doesn’t want a bill that prevents it from offering stablecoin yields. The US bank lobby opposes such yields, saying they threaten deposits and the stability of the financial system.\n\nThe bill has gone through several iterations. Here’s a look at how far it’s come:\n\nMay 2025: CLARITY comes to Washington\n\nHouse Committee on Financial Services Chairman French Hill first introduced the CLARITY Act on May 29, 2025.\n\nThe goal of the bill, according to the committee, was to establish “clear, functional requirements for digital asset market participants, prioritizing consumer protection while fostering innovation.”\n\nThe committee said the bill was needed for several reasons, mainly that digital assets represented the next step in digital financial innovation and that the regulatory status quo was stifling possibilities.\n\nJune-July 2025: House passes crypto bill\n\nThe House of Representatives moved with uncharacteristic speed on the CLARITY Act. In June, the bill moved through markup sessions in the House committees on agriculture and financial services and was placed on the calendar for a vote on the floor by June 23.\n\nOn July 17, the House of Representatives passed the bill, 294-134. The vote found more support among Republicans. Some 216 Republicans supported the bill, none opposed, while four abstained from voting.\n\nThere wa"
      },
      {
        "title": "Crypto Traders Rotate Into Select Altcoins as Bitcoin Stalls",
        "link": "https://decrypt.co/358144/crypto-traders-rotate-into-select-altcoins-as-bitcoin-stalls",
        "published": "Mon, 16 Feb 2026 10:37:23 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Altcoins including Bittensor, Zcash, and Pepe gained double digits over the past seven days despite Bitcoin's rangebound trade.\n\nFive liquidation events have wiped out over $1B in positions so far in 2026.\n\nFebruary 20 PCE data will factor into the Fed's March rate decision, per CME FedWatch.\n\nA selection of altcoins have posted double-digit gains over the past week, while Bitcoin remains less volatile and range-bound.\n\nBitcoin has been trading below $71,000 since February 6, when it briefly touched $62,822, according to CoinGecko data. That indecision—coupled with five separate liquidation events that wiped out over $1 billion in positions in 2026, per CoinGlass—has prompted investors to scan the altcoin landscape for speculative trading opportunities.\n\nThe result is a selective rotation into tokens with specific narratives, rather than a broad-based altseason.\n\nAmong the top 50 coins by market cap, Zcash is up 24.1% over the past week, followed by Pepe, Bittensor and Aster, up 21.9%, 19.8% and 18.5% over the same period.\n\nLai Yuen, investment analyst at Fisher8 Capital, said weekend price action briefly flashed risk-on signals before fizzling. \"There were some attempts at rallies over the weekend after Bitcoin broke $70,000 and Solana went above $90,\" Yuen told Decrypt. \"Probably some people took that as a risk-on signal over an illiquid weekend to pump altcoins. But now that the breakout on majors has failed, I think altcoins are returning their wins.\"\n\nImproving macro sentiment—particularly softer U.S. inflation data has boosted risk appetite across assets, according to Ignacio, CMO at Bitget.\n\n\"Capital is rotating selectively into high-conviction altcoins with strong narratives, such as ETF speculation and ecosystem momentum in sectors such as DeFi, AI agents, and gaming,\" he told Decrypt. \"This has triggered short-term relief rallies and double-digit gains in select tokens as "
      },
      {
        "title": "Metaplanet revenue jumps 738% as Bitcoin generates 95% of sales",
        "link": "https://cointelegraph.com/news/metaplanet-revenue-jumps-738-percent-bitcoin-generates-95-percent-revenue?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Mon, 16 Feb 2026 12:10:52 +0000",
        "source": "Cointelegraph.com News",
        "text": "Japanese public company Metaplanet reported explosive revenue growth after pivoting its business around Bitcoin, with the cryptocurrency now accounting for most of its operating activity.\n\nAccording to its fiscal year 2025 earnings report, revenue climbed to 8.9 billion Japanese yen ($58 million) from $7 million a year earlier, a 738% year-on-year increase. The surge followed the launch of the company’s Bitcoin (BTC) income operations.\n\n“We launched the Bitcoin Income business in Q4 2024. Since then, this strategy has become our primary revenue source and is expected to remain a core driver of profit growth,” the company wrote.\n\nA revenue breakdown shows about 95% of total income came from Bitcoin-related operations, largely generated through premium income from BTC options transactions. The company only began the segment in late 2024, replacing traditional business lines such as hotel and media activities as the core of its financial model.\n\nMetaplanet revenue surge. Source: Metaplanet\n\nRelated: Metaplanet sticks to Bitcoin buying plan as crypto sentiment hits 2022 lows\n\nBitcoin price drop pushes Metaplanet into loss\n\nOperating profit reached about $40 million, but the company still posted a net loss of roughly $619 million. The loss stemmed from accounting rules. Since Metaplanet holds large Bitcoin reserves, it must reflect price swings on its financial statements, and a more than $664 million valuation drop erased the year’s operating income.\n\nThe company has aggressively accumulated Bitcoin amid the business shift. Holdings increased from 1,762 BTC at the end of 2024 to 35,102 BTC by the end of 2025, making it the largest corporate Bitcoin holder in Japan. The company has also raised more than $3.2 billion in capital since adopting its treasury strategy.\n\nMetaplanet described its model as a long-term Bitcoin treasury approach, aiming to “acquire and hold Bitcoin permanently to hedge against fiat currency dilution and benefit from long-term value appreciation.”\n"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-16T14:06:49.717416+00:00"
  }
}