{
  "Tech": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "Why Tech Giants Are Accused of Causing Social Media Addiction",
        "link": "https://www.nytimes.com/video/technology/100000010701326/why-tech-giants-are-accused-of-causing-social-media-addiction.html",
        "published": "Thu, 12 Feb 2026 23:01:17 +0000",
        "source": "NYT > Technology",
        "text": "Why Tech Giants Are Accused of Causing Social Media Addiction\n\nIn a series of landmark trials, plaintiffs are alleging that Meta, TikTok, Snap and YouTube caused personal injury through addictive products. Our technology reporter Cecilia Kang describes what’s at stake for tech giants and social media users.\n\nBy Cecilia Kang, Christina Thornell, Laura Salaberry, Nikolay Nikolov and Thomas Vollkommer\n\nFebruary 12, 2026"
      },
      {
        "title": "Senators Urge Top Regulator to Stay Out of Prediction Market Lawsuits",
        "link": "https://www.wired.com/story/senators-urge-top-regulators-to-stay-out-of-prediction-market-lawsuits/",
        "published": "Fri, 13 Feb 2026 19:31:24 +0000",
        "source": "WIRED",
        "text": "A group of 23 Democratic US senators sent a letter Friday to the top federal regulator overseeing prediction markets, urging the agency to avoid weighing in on pending court cases over the legality of offerings on the platforms tied to “sports, war, and other prohibited events.”\n\nPrediction markets, which sell contracts tied to the outcome of real-world developments, have exploded in popularity over the past year, attracting an increasingly mainstream fanbase eager to wager on everything from geopolitical conflicts to fashion choices to the Super Bowl. As they expanded, the platforms have become a magnet for ethical and legal controversies. On Thursday, for example, Israeli authorities announced that two people had been arrested on suspicion of using classified military information to place bets on Polymarket, one of the biggest players in the industry.\n\nThe letter from the senators reflects a growing divide over how Polymarket and competitors like Kalshi should be handled. The US government currently considers prediction markets to be derivative markets, which means they fall under the jurisdiction of the Commodity Futures Trading Commission. But state authorities, who have emerged as some of the industry’s staunchest critics, are arguing the platforms should be subject to the same local regulations as gambling products.\n\nThere are at least 19 ongoing federal lawsuits challenging Kalshi’s legality, according to an analysis by National Public Radio. In one case in Massachusetts, a judge banned the company from offering sports contracts after the state sued it for operating without a gambling license. Polymarket then filed a counter lawsuit against Massachusetts arguing that state regulators don’t have authority over its business.\n\nIn his first public remarks about prediction markets since taking office in December, CFTC chairman Michael Selig suggested that the agency might wade into the battles, noting that it has the “expertise and responsibility to defend its exc"
      },
      {
        "title": "Join Our Livestream: The Hype, Reality, and Future of EVs",
        "link": "https://www.wired.com/story/livestream-the-hype-reality-and-future-of-electric-vehicles/",
        "published": "Fri, 13 Feb 2026 19:21:47 +0000",
        "source": "WIRED",
        "text": "As electric vehicles have gone mainstream, buyers are facing a smorgasbord of options, and Tesla—once untouchable—is no longer the dominant force. Last year was a tough one for Elon Musk’s auto brand: Sales efforts faltered, and the company lost its title of world’s largest EV maker to China’s BYD.\n\nToday, it feels like all automakers—including luxury brands—are racing to release their own EVs. But at the same time, some companies are scaling back production plans. So where is the market headed? Will the US build out EV charging infrastructure fast enough? Will gas-powered vehicles soon be obsolete? Will an American company ever dominate the EV market again? And what policies might shape what comes next?\n\nJoin WIRED’s next livestream to discuss these issues and more.\n\nOn the Panel\n\nJulian Chokkattu: Senior editor at WIRED overseeing personal technology, gadgets, and gizmos. He has reviewed consumer products for a decade.\n\nAarian Marshall: Staff writer at WIRED covering transportation systems and cities. She's covered Tesla for close to a decade, and the EV industry for the last five years.\n\nJeremy White: Senior writer leading WIRED's automotive and luxury coverage, with a wider focus on innovation in consumer products and compiling WIRED's Gear section.\n\nAsk a Question\n\nTo leave questions for our panel to answer during the livestream, head to the comment section below.\n\nHow to Join\n\nJoin the livestream on Tuesday, February 24, at 12 pm ET / 9 am PT. The event will be streamed right here, so be sure to bookmark this page now and return on the day. For subscribers who are not able to join, a replay of the livestream will be available after the event.\n\nSubscribe now to get access to this livestream, plus full access to WIRED.\n\nIn the meantime, check out past livestreams, which cover everything from China's growing global dominance and influence to a discussion of the tech industry's allegiance to Trump."
      },
      {
        "title": "20 Best Presidents' Day Deals on Gear Our Reviewers Actually Used (2026)",
        "link": "https://www.wired.com/story/presidents-day-deals-2026/",
        "published": "Fri, 13 Feb 2026 18:37:33 +0000",
        "source": "WIRED",
        "text": "Presidents’ Day Deals have officially landed, and there's a lot of stuff to sift through. We cross-referenced our myriad buying guides and reviews to find the products we'd recommend that are actually on sale for a truly good price. We know because we checked! Find highlights below, and keep in mind that most of these deals end on February 17.\n\nBe sure to check out our roundup of the Best Presidents' Day Mattress Sales for discounts on beds, bedding, bed frames, and other sleep accessories. We have even more deals here for your browsing pleasure.\n\nWIRED Featured Deals\n\nBranch Ergonomic Chair Pro for $449 ($50 off)\n\nThe Branch Ergonomic Chair Pro is our very favorite office chair, and this price matches the lowest we tend to see outside of major shopping events like Black Friday and Cyber Monday. It's accessibly priced compared to other chairs, and it checks all the boxes for quality, comfort, and ergonomics. Nearly every element is adjustable, so you can dial in the perfect fit, and the seven-year warranty is solid. There are 14 finishes to choose from."
      },
      {
        "title": "Record Low Snow in the West Will Mean Less Water, More Fire, and Political Chaos",
        "link": "https://www.wired.com/story/record-low-snow-in-the-west-will-mean-less-water-more-fire-and-political-chaos/",
        "published": "Fri, 13 Feb 2026 18:25:53 +0000",
        "source": "WIRED",
        "text": "States across the western US are facing record low snowpack levels in the middle of the winter season. The snowpack crisis, which could mean a drier, more wildfire-prone summer, is coming as states are racing unsuccessfully against a deadline to agree on terms to share water in the Colorado River Basin, the source of water for 40 million people across seven states in the West.\n\n“Barring a genuinely miraculous turnaround” in the remainder of the winter, says Daniel Swain, a climate scientist at the University of California Agriculture and Natural Resources, the low snowpack “has the potential to worsen both the ecological and political crisis on the Colorado Basin, and then also produce really adverse wildfire conditions in some parts of the West.”\n\nData provided by the US Department of Agriculture show that as of February 12, snowpack was at less than half its normal level in areas across nine Western states—some of the lowest levels seen in decades. It’s common for a particular basin or small area of the West to have low snowpack at this time of year. What’s worrisome, Swain says, is how widespread the snow drought is, stretching in a swath from the bottom of Washington to much of Arizona and New Mexico, and touching as far east as Colorado.\n\n“The numbers are really, really bad,” Swain says. “If this were November, they might be less meaningful. We're not in November—we're heading toward mid-February. The normal numbers are pretty high. To be at half of them means that, in absolute terms, the deficit is large.”\n\nAs much of the East Coast has frozen in the first weeks of the year, many Western states are experiencing some of their warmest winters on record: Parts of Colorado saw temperatures close to 80 degrees Fahrenheit at the start of this week. While precipitation has remained steady in many states—parts of Washington even saw disastrous flooding in December—it’s simply not cold enough in many areas for snow to fall or stay in snowpack.\n\nA study released last ye"
      }
    ]
  },
  "AI": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "Why Tech Giants Are Accused of Causing Social Media Addiction",
        "link": "https://www.nytimes.com/video/technology/100000010701326/why-tech-giants-are-accused-of-causing-social-media-addiction.html",
        "published": "Thu, 12 Feb 2026 23:01:17 +0000",
        "source": "NYT > Technology",
        "text": "Why Tech Giants Are Accused of Causing Social Media Addiction\n\nIn a series of landmark trials, plaintiffs are alleging that Meta, TikTok, Snap and YouTube caused personal injury through addictive products. Our technology reporter Cecilia Kang describes what’s at stake for tech giants and social media users.\n\nBy Cecilia Kang, Christina Thornell, Laura Salaberry, Nikolay Nikolov and Thomas Vollkommer\n\nFebruary 12, 2026"
      }
    ]
  },
  "Finance": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "Here’s the inflation breakdown for January 2026 — in one chart",
        "link": "https://www.cnbc.com/2026/02/13/heres-the-inflation-breakdown-for-january-2026-in-one-chart.html",
        "published": "Fri, 13 Feb 2026 20:04:23 GMT",
        "source": "US Top News and Analysis",
        "text": "A worker stocks beef filets in the meat section of a grocery store in Washington. Tom Williams | Cq-roll Call, Inc. | Getty Images\n\nInflation decelerated in January as price pressures eased across a range of consumer staples such as food and gasoline, though they remain elevated for certain categories, including electricity and home heating, economists said. The consumer price index, a key inflation gauge, rose 2.4% in January from 12 months earlier, the Bureau of Labor Statistics said Tuesday. That was down from 2.7% in December and lower than expected. Inflation is still running above the target of policymakers at the Federal Reserve, the U.S. central bank, which aims for an inflation level around 2%, economists said.\n\nEffect of tariffs and immigration policy\n\nInflation would likely be at the Fed's target absent Trump administration policies on tariffs and immigration, said Mark Zandi, chief economist at Moody's. Tariffs levied by President Donald Trump on a host of trading partners have put upward pressure on prices, as many businesses pass at least some of those import taxes on to U.S. consumers, economists said. Immigration policy has also put some upward pressure on prices for services by reducing labor supply, they said.\n\n\"Broadly speaking, inflation is still too high for most Americans and the Fed,\" Zandi said. \"But I think we've seen the worst of it. If there are no changes in policy — to tariffs and immigration policy — we should get inflation back to something more comfortable by this time next year.\" The Yale University Budget Lab estimated in January that the U.S.' effective tariff rate had risen to 16.9%, the highest since 1932. The Supreme Court is poised to rule on the constitutionality of a large swath of Trump's tariffs in the coming weeks.\n\n'Big caveat' in CPI report\n\nThe slowdown in inflation was \"relatively broad-based\" in January, aside from \"some pockets of acceleration in services (particularly transportation costs),\" Jason Pride, chief of in"
      },
      {
        "title": "Venezuela oil sales top $1 billion, funds won’t go to Qatar account anymore, Energy secretary says",
        "link": "https://www.cnbc.com/2026/02/13/venezuela-oil-sales-qatar-chris-wright-trump.html",
        "published": "Fri, 13 Feb 2026 17:50:43 GMT",
        "source": "US Top News and Analysis",
        "text": "Venezuela's interim President Delcy Rodríguez and U.S. Energy Secretary Chris Wright speak with the media after attending a meeting, marking the highest-level U.S. visit focused on energy policy to the OPEC nation in nearly three decades, as Washington conducts its first on-the-ground assessment of the oil industry it aims to help rebuild, in Caracas, Venezuela, Feb. 11, 2026.\n\nVenezuela oil revenue will no longer be deposited in an account in Qatar, Energy Secretary Chris Wright told NBC News in an interview this week.\n\n\"An account was set up in Qatar, controlled by the U.S. government the whole time, to land that money in and then send the money from there down to Venezuela,\" Wright told NBC News on Thursday.\n\n\"Now we have an account at the U.S. Treasury. The money won't go to Qatar anymore,\" the energy secretary said.\n\nThe Trump administration has taken control of Venezuela's oil sales after capturing former President Nicolás Maduro in a military raid last month. Wright met Venezuela's interim president, Delcy Rodríguez, in Venezuela this week, the highest-ranking U.S. official to visit the country in decades.\n\nWright told NBC News that revenue from Venezuelan oil sales now tops $1 billion. The U.S. has short-term agreements to sell another $5 billion of the country's crude over the next few months, he said. The oil has gone to U.S. refineries and Europe so far, he said.\n\nThe U.S. deposited the initial $500 million of oil sales in the Qatar account before transferring the funds back to Venezuela, Wright said. Democrats in Congress have questioned the transparency and legality of the arrangement.\n\nSen. Chuck Schumer, D-N.Y., and Sen. Adam Schiff, D-Calif., introduced legislation Thursday that directs the Government Accountability Office to conduct an independent audit of the Qatar account."
      },
      {
        "title": "AI disruption could spark a ‘shock to the system’ in credit markets, UBS analyst says",
        "link": "https://www.cnbc.com/2026/02/13/ai-credit-markets.html",
        "published": "Fri, 13 Feb 2026 18:19:01 GMT",
        "source": "US Top News and Analysis",
        "text": "The stock market has been quick to punish software firms and other perceived losers from the artificial intelligence boom in recent weeks, but credit markets are likely to be the next place where AI disruption risk shows up, according to UBS analyst Matthew Mish.\n\nTens of billions of dollars in corporate loans are likely to default over the next year as companies, especially software and data services firms owned by private equity, get squeezed by the AI threat, Mish said in a Wednesday research note.\n\n\"We're pricing in part of what we call a rapid, aggressive disruption scenario,\" Mish, UBS head of credit strategy, told CNBC in an interview.\n\nThe UBS analyst said he and his colleagues have rushed to update their forecasts for this year and beyond because the latest models from Anthropic and OpenAI have sped up expectations of the arrival of AI disruption.\n\n\"The market has been slow to react because they didn't really think it was going to happen this fast,\" Mish said. \"People are having to recalibrate the whole way that they look at evaluating credit for this disruption risk, because it's not a '27 or '28 issue.\"\n\nInvestor concerns around AI boiled over this month as the market shifted from viewing the technology as a rising tide story for technology companies to more of a winner-take-all dynamic where Anthropic, OpenAI and others threaten incumbents. Software firms were hit first and hardest, but a rolling series of sell-offs hit sectors as disparate as finance, real estate and trucking.\n\nIn his note, Mish and other UBS analysts lay out a baseline scenario in which borrowers of leveraged loans and private credit see a combined $75 billion to $120 billion in fresh defaults by the end of this year.\n\nCNBC calculated those figures by using Mish's estimates for increases of up to 2.5% and up to 4% in defaults for leveraged loans and private credit, respectively, by late 2026. Those are markets which he estimates to be $1.5 trillion and $2 trillion in size."
      },
      {
        "title": "Dubai's DP World replaces CEO after Epstein links emerge",
        "link": "https://www.cnbc.com/2026/02/13/dubais-dp-world-replaces-ceo-after-epstein-links-emerge.html",
        "published": "Fri, 13 Feb 2026 15:43:49 GMT",
        "source": "US Top News and Analysis",
        "text": "Sultan Ahmed Bin Sulayem of Dubai speaks at a news conference on Nov. 10, 2005 in New York City.\n\nThe CEO of Dubai's largest port has been replaced by the company after details of his past relationship with the late sex offender Jeffrey Epstein were made public.\n\nOn Friday, DP World announced in a statement that it had appointed Essa Kazim as chairman of its board of directors and Yuvraj Narayan as group chief executive officer, replacing Sultan Ahmed bin Sulayem.\n\nThe U.S. Department of Justice's latest release of files related to Epstein revealed that the financier once referred to Sulayem as a \"close personal friend\" and called him one of his most trusted friends in other files. Sulayem has not been accused of any criminal wrongdoing.\n\nA disclosure to Nasdaq Dubai, where DP World maintains listed bonds, said Sulayem had resigned \"effective immediately.\"\n\nSulayem was at the helm of Dubai's largest port operator as chairman since 2007 and CEO since 2016.\n\nThe statement made no mention of Sulayem but said the company \"affirmed that the new appointments support its strategy for sustainable growth and reinforce its role in strengthening global supply chains and supporting Dubai's position as a leading hub for trade and logistics.\"\n\nCNBC sought comment from Sulayem through DP World, where he served as chairman and CEO, but did not receive a response.\n\nKazim was most recently the governor of the DIFC, Dubai's financial center. Narayan was deputy CEO and CFO at DP World since 2005.\n\nSulayem is one of Dubai's most prominent business figures, coming from one of the Emirate's main families. His father was an advisor to the ruling Al Maktoum family and Sulayem played a key role in the ascendance of Dubai as an economic hub.\n\nSulayem oversaw the growth of Dubai's Jebel Ali port into a major deep-water shipping hub and the expansion of DP World into an international logistics empire that now oversees ports handling a tenth of the world's container trade.\n\nHe also led Nakheel P"
      },
      {
        "title": "Anthropic taps ex-Microsoft CFO, Trump aide Liddell for board",
        "link": "https://www.cnbc.com/2026/02/13/anthropic-ai-chris-liddell-microsoft-trump-board.html",
        "published": "Fri, 13 Feb 2026 17:37:47 GMT",
        "source": "US Top News and Analysis",
        "text": "Chris Liddell, then the White House deputy chief of staff for policy, during an American Workforce Policy Advisory Board meeting in the East Room of the White House in Washington, June 26, 2020.\n\nAnthropic on Friday announced it has appointed longtime executive and political operative Chris Liddell to its board of directors.\n\nLiddell previously served as the chief financial officer of Microsoft , the vice chairman of General Motors and the deputy White House chief of staff during President Donald Trump's first term. He has also been involved in three presidential transition cycles, according to his website.\n\nAnthropic's decision to add Liddell to its board could foster some goodwill with the Trump administration, which has lashed out at the artificial intelligence startup in recent months.\n\nDavid Sacks, the venture capitalist serving as the administration's AI and crypto czar, accused Anthropic of supporting \"woke AI\" in October because of its stance on regulation.\n\n\"My career has taught me the governance of transformative technologies matters as much as the technologies themselves,\" Liddell said in a statement on Friday. \"Anthropic's approach — building AI that's both capable and responsible — is critical for our future, and it's why I'm proud to be joining the company's Board.\""
      }
    ]
  },
  "World News": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "How Bangladesh Went From Revolution to Elections",
        "link": "https://www.nytimes.com/video/world/100000010700965/how-bangladesh-went-from-revolution-to-fresh-elections.html",
        "published": "Fri, 13 Feb 2026 19:05:10 +0000",
        "source": "NYT > World News",
        "text": "How Bangladesh Went From Revolution to Elections\n\nBangladesh held the first national elections since a student revolution in the summer of 2024. Standing outside the Dhaka university, the epicenter of the student movement, New York Times correspondent Anupreeta Das explains what the recent elections mean for the country’s future.\n\nBy Anupreeta Das, Katrin Bennhold, Leila Medina, James Surdam, Parin Behrooz and Lam Yik Fei\n\nFebruary 13, 2026"
      },
      {
        "title": "Why Iran’s Nuclear Program Isn’t the Only Threat",
        "link": "https://www.nytimes.com/video/world/middleeast/100000010701285/why-irans-nuclear-program-isnt-the-only-threat.html",
        "published": "Thu, 12 Feb 2026 19:03:57 +0000",
        "source": "NYT > World News",
        "text": "Why Iran’s Nuclear Program Isn’t the Only Threat\n\nWhile talks with Iran have focused on its nuclear program, Israel’s greater immediate concern is Iran’s rebuilding of its ability to launch missiles at Israel, as it did during last year’s war. Our national security reporter Mark Mazzetti breaks down the latest intelligence.\n\nBy Mark Mazzetti, Coleman Lowndes, Christina Shaman, James Surdam, Jon Hazell, Rafaela Balster and Samuel Granados\n\nFebruary 11, 2026"
      },
      {
        "title": "Britain's High Court says government illegally banned Pro-Palestinian group",
        "link": "https://www.npr.org/2026/02/13/nx-s1-5713346/britain-court-palestine-action-ban",
        "published": "Fri, 13 Feb 2026 06:10:04 -0500",
        "source": "NPR Topics: World",
        "text": "Britain's High Court says government illegally banned Pro-Palestinian group\n\ntoggle caption Kirsty Wigglesworth/AP\n\nLONDON — Britain's High Court ruled Friday that the government's decision to outlaw the protest group Palestine Action as a terrorist organization was unlawful, but it kept the ban in place pending another hearing while the government prepares an appeal.\n\nJudges Victoria Sharp, Jonathan Swift and Karen Steyn said \"the nature and scale of Palestine Action's activities\" did not meet the \"level, scale and persistence\" that would justify proscription.\n\nThe judges said they were \"satisfied that the decision to proscribe Palestine Action was disproportionate.\"\n\nThe government banned Palestine Action after activists broke into a Royal Air Force base in June to protest British military support for Israel's military offensive against Hamas in Gaza, which killed tens of thousands of Palestinians.\n\nThe government declared the pro-Palestinian direct-action group a terrorist organization alongside the likes of al-Qaida and Hamas, making membership in or support for Palestine Action a crime punishable by up to 14 years in prison. Since then, more than 2,700 people have been arrested at protests for holding signs saying \"I support Palestine Action.\" Almost 700 have been charged under the Terrorism Act, although no one has yet been convicted.\n\nSponsor Message\n\nSupporters of Palestine Action and civil liberties groups say the arrests for peaceful protest ride roughshod over free speech and the right to protest.\n\nPalestine Action co-founder Huda Ammori said the decision \"is a monumental victory both for our fundamental freedoms here in Britain and in the struggle for freedom for the Palestinian people, striking down a decision that will forever be remembered as one of the most extreme attacks on free speech in recent British history.\"\n\nYasmine Ahmed, U.K. director of Human Rights Watch, called the court ruling \"a shot in the arm for British democracy.\" She said the Brit"
      },
      {
        "title": "Who will police Gaza, and how?",
        "link": "https://www.npr.org/2026/02/13/g-s1-109343/gaza-israel-police",
        "published": "Fri, 13 Feb 2026 05:01:00 -0500",
        "source": "NPR Topics: World",
        "text": "Who will police Gaza, and how?\n\ntoggle caption Majdi Mohammed/AP\n\nTEL AVIV, Israel — On Oct. 30, 2023, just three weeks after the deadly Oct. 7 Hamas-led attack on Israel sparked Israel's war in Gaza, U.S. security officials stationed in Jerusalem drew up a plan for what should be done when the war ends, according to a copy of the U.S. proposal obtained by NPR.\n\nThe memo, titled \"Gaza Exit Strategy and the Morning After,\" made two main recommendations to the Biden administration: to immediately set up Palestinian and international security forces to prevent Hamas from resurging in postwar Gaza, and to create a \"dramatic change of Israel's policy in the West Bank\" that would rein in Israeli settlers and ensure a political horizon for creating a Palestinian state.\n\nSponsor Message\n\nNow, more than three months into a declared ceasefire, the Trump administration has not yet set up security forces in Gaza, though Trump in mid-February is expected to announce an international stabilization force with thousands of troops from several countries to deploy in Gaza, along with efforts to raise billions of dollars for reconstruction, a U.S. official with knowledge of the subject, but who was not authorized to speak to the media, told NPR. And the U.S. has tolerated Israeli settler violence and Israeli government measures that undermine prospects for Palestinian statehood.\n\nEven under the Biden administration, efforts to prepare a new Palestinian security force to replace Hamas in postwar Gaza ran into problems.\n\nWhile the Gaza war raged on, U.S. security officials expanded an initiative to train hundreds of Palestinian Authority Security Forces in advanced law enforcement techniques, including SWAT training, according to three former U.S. military and law enforcement officers involved in the effort.\n\nBut those efforts were eventually hamstrung by concerns from both Israel and the U.S. that security training given to Palestinians could be turned against Israel, according to the "
      },
      {
        "title": "World leaders to discuss the future of Europe's security in Munich",
        "link": "https://www.npr.org/2026/02/13/nx-s1-5711635/world-leaders-to-discuss-the-future-of-europes-security-in-munich",
        "published": "Fri, 13 Feb 2026 04:47:38 -0500",
        "source": "NPR Topics: World",
        "text": "World leaders to discuss the future of Europe's security in Munich\n\nLEILA FADEL, HOST:\n\nLet's head now to Munich. And I want you to picture a hotel ballroom brimming with presidents and prime ministers, diplomats and spies. You can think of the Munich Security Conference as a kind of Davos for defense. This year, more than six decades into the annual gathering, the stakes are higher than ever. Our colleague, All Things Considered co-host Mary Louise Kelly, is there. And she's in her element and on the line. Hi, Mary Louise.\n\nMARY LOUISE KELLY, BYLINE: Hey. Good morning, Leila.\n\nFADEL: Good morning. It sounds very busy there. Where exactly are you and what's the scene?\n\nKELLY: We are in the thick of it. I am speaking to you from a balcony looking down over the main entrance of the conference. There are black cars and limos pulling up. It is next-level security. I think we went through four or five different security checks on the way in, and that is because of the density of VIPs all around us. I looked one way, and there's the prime minister of Denmark, and then you look another and there's a U.S. senator. A full quarter of the Senate is here, by the way, so they are everywhere.\n\nThe head of MI6 is supposed to be here. I have not spotted her yet. All kinds of intelligence, spy chiefs. So it's great eavesdropping, aside from anything else. And we are talking to all kinds of people, everybody who we can get to take our questions - foreign ministers, NATO types, you name it.\n\nFADEL: So we mentioned earlier, the stakes are higher than ever. Just break down why.\n\nKELLY: There is a palpable sense that around us at this conference, they're trying to figure out a new world order in real time. You hear it walking up and down the stairs. You hear it in the queue to the ladies' room. This is people, America's allies, talking through, how do they stand on their own? How does Europe provide for their own security? And that follows, you may remember, the bombshell speech that JD "
      }
    ]
  },
  "Business": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "The Hidden Number Driving U.S. Job Growth",
        "link": "https://www.nytimes.com/video/business/economy/100000010706277/explaining-us-job-growth-healthcare-ai-trump.html",
        "published": "Fri, 13 Feb 2026 12:55:40 +0000",
        "source": "NYT > Business",
        "text": "The Hidden Number Driving U.S. Job Growth\n\nAfter a year of just 181,000 new jobs, January’s 131,000 increase in the U.S. workforce was surprisingly positive. Ben Casselman, The New York Times’ chief economic correspondent, explains the numbers.\n\nBy Ben Casselman, Christina Thornell, Christina Shaman, June Kim and Nikolay Nikolov\n\nFebruary 13, 2026"
      },
      {
        "title": "How packaging and logistics companies are automating their warehouses",
        "link": "https://www.cnbc.com/2026/02/13/shipping-auotmation-logistics-labor.html",
        "published": "Fri, 13 Feb 2026 12:30:01 GMT",
        "source": "Business News",
        "text": "In this article FDX\n\nUPS\n\nDPW-DE Follow your favorite stocks CREATE FREE ACCOUNT\n\nDHL Autonomous Robot at work. Source: DHL\n\nWorkers at DHL Group used to walk close to a half marathon each day just to classify, pick and move items across massive warehouses. Now, their distance and efforts are greatly reduced by autonomous mobile robots that can unload containers for the package delivery and supply chain management company with a speed of up to 650 cases per hour. \"That is what we look forward to, and where we've been successful in deploying technology at scale over the last five years, going from when we started in 2020 with 240 projects, and now we're up to 10,000 projects,\" Tim Tetzlaff, DHL's global head of digital transformation, told CNBC. The company's autonomous innovations have accelerated processes at 95% of DHL's global warehouses. Item-picking robots in one warehouse have increased units picked per hour by 30%, while autonomous forklifts at that same warehouse have contributed a 20% increase in efficiency, the company said. Tetzlaff said automation is important for the company because it's such a labor-intensive business. \"We still have the ambition to grow our business even further, but if you look at where these distribution centers should be located … it's typically very tough to find additional labor or even additional spaces just to build these warehouses there,\" he said. DHL is one of multiple fulfillment companies moving toward automation and leveraging artificial intelligence as the industry works toward greater efficiency. On an earnings call with analysts in late January, United Parcel Service CEO Carol Tomé said the company deployed automation in 57 buildings in the fourth quarter, bringing its total to 127 automated buildings, with plans for 24 more in 2026. \"This year, we plan to further automate our network and as a result, we expect to increase the percentage of U.S. volume we process through automated facilities to 68% by the end of the ye"
      },
      {
        "title": "Spirit Airlines sells more planes, calls back 500 flight attendants from furlough ahead of spring break",
        "link": "https://www.cnbc.com/2026/02/12/spirit-airlines-sells-planes-flight-attendants.html",
        "published": "Thu, 12 Feb 2026 17:51:47 GMT",
        "source": "Business News",
        "text": "Spirit Airlines, trying to emerge from its second bankruptcy in less than a year, has sold another 20 of its Airbus planes and is bringing flight attendants back from furlough.\n\nThe sale of the 20 aircraft, most of which are not in service, comes as Spirit is attempting to stabilize after years of financial struggles that have executives fighting to keep the carrier alive.\n\n\"At this time, natural attrition and voluntary actions are providing flexibility needed to right-size our staffing levels for both Pilots and Flight attendants,\" Spirit Chief Operating Officer John Bendoraitis said in a note to employees Wednesday night.\n\nThe sales brings Spirit's fleet to 94 aircraft, and is \"consistent with our plan to focus on our strongest routes and the most efficient fleet,\" Bendoraitis said. The aircraft will be phased out starting in April, he said.\n\nDeal talks with investment firm Castlelake and fellow budget carrier Frontier Airlines haven't yielded an agreement that would give Spirit a path forward, though the airline could forge a plan on its own."
      },
      {
        "title": "Realtors report a 'new housing crisis' as January home sales tank more than 8%",
        "link": "https://www.cnbc.com/2026/02/12/january-homes-sales.html",
        "published": "Thu, 12 Feb 2026 15:37:41 GMT",
        "source": "Business News",
        "text": "High home prices, faltering supply and weaker consumer confidence in the economy all continue to weigh on the U.S. housing market. The chief economist for the National Association of Realtors, Lawrence Yun, is calling it \"a new housing crisis.\"\n\nSales of previously owned homes in January dropped a much wider-than-expected 8.4% from December to a seasonally adjusted, annualized rate of 3.91 million, according to the NAR. Sales were 4.4% lower than January 2025. That is the slowest pace since December 2023 and the biggest monthly drop since February 2022.\n\nThis count is based on closings, so contracts that were likely signed in November and December, when the average rate on the 30-year fixed mortgage didn't move much before dropping slightly in January. That rate is now 6.1%, according to Mortgage News Daily.\n\nRegionally, sales fell across the nation month to month but were down the most in the South and West.\n\n\"Affordability conditions are improving, with NAR's Housing Affordability Index showing that housing is the most affordable it's been since March 2022,\" Yun said in a release. \"This is due to wage gains outpacing home price growth and mortgage rates being lower than a year ago. However, supply has not kept pace and remains quite low.\"\n\nBut he also noted on a call with reporters that potential buyers are \"still struggling,\" and \"renters are not participating in housing wealth.\" He characterized the current market as a crisis because, \"the movement is not happening. Americans are stuck.\""
      },
      {
        "title": "American Airlines flight attendants picket as CEO tries to calm frustrated employees",
        "link": "https://www.cnbc.com/2026/02/12/american-airlines-ceo-pressure-flight-attendants-picket.html",
        "published": "Thu, 12 Feb 2026 20:31:11 GMT",
        "source": "Business News",
        "text": "American Airlines flight attendants' union held a picket outside the company's headquarters on Thursday pushing for new leadership at the carrier, which has lagged rivals Delta Air Lines and United Airlines in profitability and punctuality.\n\nAhead of the picket on Wednesday night, American CEO Robert Isom sought to calm frustrated employees and listed improvements the carrier expects this year, including a jump in profits as well as improvements to schedules and new cabins.\n\n\"We look forward to working with all of you to make it happen,\" Isom said in a video message filmed at the airline's Fort Worth, Texas headquarters.\n\nThe picket came days after the Association of Professional Flight Attendants, representing American's 28,000 cabin crew members, issued a vote of no confidence in Isom, which the union said was its first such move. The chief executive was also criticized by the pilots' union, which sought a meeting with the airline's board, of which Isom is a member, to discuss the problems. Unions for pilots, flight attendants and mechanics have all recently said the company needs to do better to improve reliability and financial results.\n\nThe protest is an unusual move outside of contract negotiations.\n\nThe signals from the labor groups have increased pressure on Isom, who took the helm nearly four years ago, and American's leadership team, which is investing in cabin upgrades, bigger airport lounges and other on-board products.\n\nLast month, American forecast stronger revenue and profits for 2026 and said it expects to report adjusted earnings per share of as much as $2.70, up from an adjusted 36 cents last year.\n\nAmerican is in the middle of a revamp that it hopes will help revive profits with more modern airplane cabins that command higher fares, which is especially important as coach-class fares have dropped. It has also built bigger lounges and added free Wi-Fi for customers.\n\nFor the first 11 months of the year, American ranked eighth in punctuality with a 7"
      }
    ]
  },
  "Stock Market": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "Stock market today: S&P 500, Dow, Nasdaq rise as CPI inflation cools, but weekly losses loom",
        "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-dow-nasdaq-rise-as-cpi-inflation-cools-but-weekly-losses-loom-234823535.html?.tsrc=rss",
        "published": "Fri, 13 Feb 2026 20:09:05 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "US stocks climbed on Friday but remained on track for weekly losses as Wall Street digested a cooler-than-expected inflation reading for a steer on the path of interest rates.\n\nThe S&P 500 (^GSPC) led the way up with a gain of roughly 0.2%, while the Dow Jones Industrial Average (^DJI) and the tech-heavy Nasdaq Composite (^IXIC) picked up roughly 0.2% and 0.1%, respectively.\n\nInflation cooled more than expected in January, data released Friday by the Bureau of Labor Statistics showed. The Consumer Price Index showed that consumer prices increased 0.2% in January from a month earlier, and 2.4% on an annual basis.\n\nThe report is likely to shape expectations for an already complicated Federal Reserve policy. Traders revived some bets on a June cut, with a majority expecting a quarter-point reduction that month. Most bets remain on two cuts by the end of 2026, though a larger percentage of traders is now betting on more reductions.\n\nThe moves came after a day of heavy selling as fears about AI disruption spilled into sectors such as real estate, logistics, and transportation — \"old economy\" names previously seen as a safe alternative to AI-tied stocks. Techs got pummeled, with all seven of the \"Magnificent Seven\" megacaps finishing lower. The sell-off has set the Dow, S&P 500, and Nasdaq for sharp weekly losses.\n\nInvestors are also scrutinizing the latest earnings for the next \"shoot first, ask questions later\" AI scare. Applied Materials (AMAT) stock surged as much as 10% chip toolmaker's upbeat outlook mirrored robust AI demand. But Pinterest (PINS) shares tumbled as much as 20% as revenue fell short and analysts fretted about AI risks to its discovery platform.\n\nElsewhere on the earnings front, Rivian (RIVN) shares soared by more than 25% following its fourth quarter earnings beat late Thursday. The EV maker said its R2 midsize model is on track for delivery before the summer. Moderna (MRNA) shares surged 10% after it topped quarterly revenue estimates thanks to resi"
      },
      {
        "title": "Brightline Dumps $20 Million in Eos Energy Amid Staggering 117% Stock Surge",
        "link": "https://www.fool.com/coverage/filings/2026/02/13/brightline-dumps-usd20-million-in-eos-energy-amid-staggering-117-stock-surge/?.tsrc=rss",
        "published": "Fri, 13 Feb 2026 19:47:18 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "This energy storage firm delivers grid-scale battery solutions for utilities and renewables, leveraging proprietary zinc-based technology.\n\nOn February 13, 2026, Brightline Capital Management, LLC reported selling out its entire position in Eos Energy Enterprises (EOSE +2.22%), divesting 1,754,000 shares in a transaction estimated at $19.98 million.\n\nWhat happened\n\nAccording to a SEC filing dated February 13, 2026, Brightline Capital Management, LLC sold its entire holding in Eos Energy Enterprises (EOSE +2.22%), disposing of 1,754,000 shares. The quarter-end position value dropped by $19.98 million.\n\nWhat else to know\n\nTop holdings after the filing: NASDAQ: VSAT: $72.16 million (29.2% of AUM) NYSE: AMTM: $40.37 million (16.3% of AUM) NYSE: CSTM: $34.72 million (14.0% of AUM) NYSE: DAN: $27.23 million (11.0% of AUM) NYSE: FLR: $22.15 million (9.0% of AUM)\n\nAs of February 12, 2026, shares of EOSE were priced at $10.79, up 117.1% over the past year and outperforming the S&P 500 by 104.2 percentage points.\n\nCompany overview\n\nMetric Value Price (as of market close 2026-02-12) $10.79 Market Capitalization $3 billion Revenue (TTM) $63.46 million Net Income (TTM) ($1.12 billion)\n\nCompany snapshot\n\nEos Energy Enterprises designs and manufactures stationary battery storage solutions, primarily the Eos Znyth DC battery system, targeting grid-scale energy storage applications.\n\nThe company generates revenue by providing battery systems and related services to utility, commercial, industrial, and renewable energy sectors.\n\nIt serves utilities, commercial and industrial operators, and renewable energy developers seeking scalable, long-duration energy storage solutions.\n\nEos Energy Enterprises, Inc. is a leading provider of grid-scale battery storage systems, leveraging proprietary zinc-based technology to address the needs of large-scale energy storage. With a focus on innovative, long-duration storage solutions, Eos Energy aims to support the transition to renewable energy by e"
      },
      {
        "title": "The Big Scary Myth Stalking the Stock Market",
        "link": "https://finance.yahoo.com/m/24f9e919-7270-356c-a2bf-de6dd81e440d/the-big-scary-myth-stalking.html?.tsrc=rss",
        "published": "Fri, 13 Feb 2026 19:45:02 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Imagine a time machine, like Doc Brown’s DeLorean in “Back to the Future,” that could transport us to the best possible times in history to invest. I don’t know about you, but I would set the destination circuits to June 1, 1932."
      },
      {
        "title": "Sector Update: Energy Stocks Rise Friday Afternoon",
        "link": "https://finance.yahoo.com/news/sector-energy-stocks-rise-friday-192029877.html?.tsrc=rss",
        "published": "Fri, 13 Feb 2026 19:20:29 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Energy stocks rose Friday afternoon with the NYSE Energy Sector Index advancing 1% and the State Str\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      },
      {
        "title": "$20 Million Exit: Why Academy Sports' $1.4 Billion Third Quarter Likely Wasn't Enough",
        "link": "https://www.fool.com/coverage/filings/2026/02/13/usd20-million-exit-why-academy-sports-usd1-4-billion-third-quarter-likely-wasn-t-enough/?.tsrc=rss",
        "published": "Fri, 13 Feb 2026 19:17:54 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Academy Sports and Outdoors operates over 250 retail locations across 16 states, offering private label sporting goods and apparel.\n\nOn February 13, 2026, Impala Asset Management reported selling out its entire stake in Academy Sports and Outdoors (ASO +1.65%), with an estimated transaction value of $19.86 million.\n\nWhat happened\n\nAccording to an SEC filing dated February 13, 2026, Impala Asset Management LLC exited its entire position in Academy Sports and Outdoors, selling 397,115 shares. The fund reported no ASO shares held at quarter-end, with the net position value shifting by $19.86 million over the period.\n\nWhat else to know\n\nTop holdings after the filing: NASDAQ: CENX: $33.61 million (22.7% of AUM) NYSE: ERO: $26.95 million (18.2% of AUM) NYSE: BKE: $21.37 million (14.4% of AUM) NYSE: HUN: $8.67 million (5.9% of AUM) NYSE: WHR: $7.94 million (5.4% of AUM)\n\nAs of February 12, 2026, shares of Academy Sports and Outdoors were priced at $57.73, up 10.9% over the past year and underperforming the S&P 500 by 2.03 percentage points.\n\nCompany overview\n\nMetric Value Revenue (TTM) $6.01 billion Net income (TTM) $376.71 million Dividend yield 0.88% Price (as of market close February 12, 2026) $57.73\n\nCompany snapshot\n\nAcademy Sports and Outdoors operates as a sporting goods and outdoor recreational products retailer in the United States. The company operates retail locations in over a dozen contiguous states and offers private label brands such as Magellan Outdoors, BCG, O'rageous, Outdoor Gourmet, and Freely.\n\nWhat this transaction means for investors\n\nWhen a concentrated metals-focused portfolio reallocates nearly $20 million away from a specialty retailer, that tells you something about conviction and opportunity cost.\n\n\n\nAcademy reported third-quarter net sales of $1.38 billion, up 3%, with diluted EPS climbing 14% to $1.05. Gross margin expanded to 35.7% from 34.0%, and operating income improved to $100.4 million. That’s solid execution. Yet year-to-date net incom"
      }
    ]
  },
  "Crypto": {
    "summary": "Summary generation failed due to an API error.",
    "articles": [
      {
        "title": "Dutch House of Representatives advances controversial 36% tax law",
        "link": "https://cointelegraph.com/news/dutch-house-advances-36-tax-law?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 13 Feb 2026 20:05:40 +0000",
        "source": "Cointelegraph.com News",
        "text": "The Netherlands’ House of Representatives advanced a legislative proposal on Thursday to introduce a 36% capital gains tax on savings and most liquid investments, including cryptocurrencies.\n\nThe legislation reached the 75-vote threshold required to advance, with 93 lawmakers voting in favor of it, according to the House tally.\n\nUnder the proposal, savings accounts, cryptocurrencies, most equity investments and gains made from interest-bearing financial instruments are subject to the tax, whether or not the assets are sold.\n\nThe vote tally for the 36% capital gains tax bill. Source: Dutch House of Representatives\n\nCritics say the bill will drive capital out of the Netherlands and into jurisdictions with more favorable tax laws, as investors seek a flight to safety from confiscatory taxation.\n\n\n\nThe Dutch Senate must also pass the bill before it is signed into law, which will take effect in the 2028 tax year, if it is passed, but many investors in the crypto community are already sounding the alarm and predicting capital flight from the country.\n\n\n\nRelated: European Commission calls on 12 countries to implement crypto tax rules\n\nInvestors say the tax is out of touch and will backfire\n\n“France did this in 1997 and saw a massive exodus of entrepreneurs leaving the country,” Denis Payre, co-founder of logistics company Kiala said.\n\nCrypto market analyst Michaël van de Poppe said the proposal is “the dumbest thing I've seen in a long time.”\n\n“The number of people willing to flee the country is going to be bananas,” he added, echoing the calls of other industry analysts and executives.\n\nAn investor starting with 10,000 euros ($11,871) who contributes 1,000 euros per month over 40 years would end up with about 3,320,000 euros by the end of the 40 years, according to Investing Visuals.\n\nHowever, the new 36% tax reduces the total amount after 40 years to about 1,885,000 euros, a difference of 1,435,000 euros, Investing Visuals said.\n\nA comparison of an investment compounded "
      },
      {
        "title": "Digital gold or tech stock? Bitcoin’s identity crisis deepens",
        "link": "https://cointelegraph.com/news/digital-gold-or-tech-stock-bitcoin-s-identity-crisis-deepens?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 13 Feb 2026 20:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "Bitcoin (BTC) was once pitched as digital gold — a hedge against monetary instability and market turmoil. But recent price action tells a different story.\n\nAs institutional participation has grown, particularly through exchange-traded funds and other traditional vehicles, Bitcoin has increasingly traded in lockstep with risk assets. The latest downturn in software stocks, fueled by renewed uncertainty around AI’s impact on the sector, has been mirrored in crypto markets, raising fresh questions about Bitcoin’s evolving identity.\n\nThat changing dynamic sets the tone for this week’s Crypto Biz. New research from Grayscale examines Bitcoin’s growing correlation with growth equities, while one Ether (ETH) treasury company is doubling down despite multibillion-dollar paper losses. Elsewhere, BlackRock is expanding its tokenization push through a Uniswap integration, and Polymarket is taking its fight over state regulation to federal court.\n\nGrayscale: Bitcoin is trading like a growth asset, not digital gold\n\nNew research from Grayscale suggests that Bitcoin’s store-of-value narrative has recently taken a back seat, with the digital asset behaving more like a growth stock.\n\nIn the report, author Zach Pandl said that while Grayscale continues to view Bitcoin as a long-term store of value due to its fixed supply and independence from central banks, its short-term trading patterns resemble those of high-growth equities.\n\nThe analysis found a strong correlation between Bitcoin and software stocks over the past two years. That relationship has become more apparent as software companies face renewed selling pressure amid concerns that artificial intelligence could disrupt parts of the industry.\n\nAgainst that backdrop, Bitcoin’s recent pullback appears less surprising, as its price has closely tracked the software sector’s movements.\n\nBitcoin’s recent price performance tracks closely with software stocks. Source: Grayscale\n\nBitMine adds 40,613 ETH during market sell-off\n\nEther t"
      },
      {
        "title": "Bitcoin bulls blitz $69K as retail traders pressure short positioning",
        "link": "https://cointelegraph.com/news/bitcoin-bulls-blitz-dollar69k-as-retail-traders-pressure-short-positioning?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 13 Feb 2026 19:21:46 +0000",
        "source": "Cointelegraph.com News",
        "text": "Bitcoin (BTC) rallied to $69,482 on Friday, and the rally coincided with data showing steady accumulation from smaller-sized holders in February.\n\nAnalysts say the breakout may evolve into a broader bullish trend, although other data suggests that a longer period of price consolidation will underlie the emerging bull trend.\n\nKey takeaways:\n\nBTC broke above the $69,000 resistance and its descending channel, triggering $92 million in short liquidations within four hours.\n\nSmall wallets added $613 million in February, while the whale wallets stalled with $4.5 billion in outflows.\n\nShort-term holder profit-ratio indicator hit its lowest level since November 2022, underscoring weak sentiment over the past few weeks.\n\nWill the Bitcoin relief rally last?\n\nBitcoin has pushed above the upper boundary of its descending channel and retested $69,000. The move marks a potential bullish break of structure (BOS), if BTC holds above $68,000.\n\nIf BTC holds above this reclaimed level, the next internal liquidity zones sit near $71,500 and $74,000. The 50- and 100-period exponential moving averages (EMAs) are now compressing beneath the price on the one-hour chart, reinforcing the possibility of the short-term momentum continuing.\n\nThe latest price surge triggered about $96 million in futures liquidations over the past four hours, with nearly $92 million coming from short positions, signaling a short squeeze on bearish traders.\n\nBTC liquidations were primarily concentrated on Bybit (22.5%), Hyperliquid (22%) and Gate (15%), suggesting these platforms account for a significant share of active leveraged positioning in the market.\n\nRelated: Multi-day negative Bitcoin funding signals ‘overcrowded’ short trade: Reversal coming?\n\nBTC retail investor demand backs the breakout\n\nThe breakout is supported by the steady buying from the smaller-sized investors. Order flow data from Hyblock shows that the small wallets ($0–$10,000) have accumulated about $613 million in cumulative volume delta (CV"
      },
      {
        "title": "BlackRock enters DeFi as institutional crypto push accelerates: Finance Redefined",
        "link": "https://cointelegraph.com/news/blackrock-enters-defi-institutional-crypto-push-finance-redefined?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 13 Feb 2026 19:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "BlackRock made its first formal move into decentralized finance this week, listing its tokenized Treasury fund on Uniswap, with Bitcoin and Ether staging only modest rebounds amid heavy ETF outflows.\n\nBitcoin (BTC) and Ether (ETH) each rose about 2.5% during the past week but were unable to cross key psychological levels due to mixed exchange-traded fund (ETF) flows and crypto investor sentiment sinking to record lows.\n\nBitcoin ETFs started the week with two consecutive days of inflows, but they quickly reversed with $276 million in outflows on Wednesday and $410 million on Thursday.\n\nEther ETFs saw similar flows, with two modest days of inflows, followed by $129 million in outflows on Wednesday and $113 million on Thursday, according to Farside Investors data.\n\nIn a silver lining to the correction, Bitcoin’s sharp drawdown to $59,930 may have marked a critical “halfway point” in the current bear market, as markets are now sitting at a critical inflection point that will determine the relevance of the four-year cycle theory, according to Kaiko Research.\n\nDespite sliding crypto valuations, large institutions continue exploring cryptocurrency adoption, including the world’s largest asset manager, BlackRock, which announced its first foray into decentralized finance (DeFi) on Wednesday.\n\nBitcoin ETF inflows, in USD million. Source: Farside Investors\n\nBlackRock enters DeFi, taps Uniswap for institutional token trading\n\nAsset management giant BlackRock is making its first formal move into decentralized finance by bringing its tokenized US Treasury fund to Uniswap, marking a milestone moment for institutional adoption of DeFi.\n\nAccording to a Wednesday announcement, BlackRock’s USD Institutional Digital Liquidity Fund (BUIDL) will be listed on the Uniswap decentralized exchange, allowing institutional investors to buy and sell the tokenized security.\n\nAs part of the arrangement, BlackRock is also purchasing an undisclosed amount of Uniswap’s native governance token, UNI, "
      },
      {
        "title": "Anchorage, Kamino let institutions borrow against SOL without moving custody",
        "link": "https://cointelegraph.com/news/anchorage-kamino-institutions-borrow-against-sol-without-moving-custody?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 13 Feb 2026 17:37:15 +0000",
        "source": "Cointelegraph.com News",
        "text": "Anchorage Digital has partnered with Kamino and Solana Company to roll out a structure that allows institutions to borrow against staked Solana without moving assets out of regulated custody, potentially addressing a key friction between traditional finance and decentralized lending markets.\n\nIn a Friday announcement, Anchorage said the initiative expands its Atlas collateral management platform by integrating with Kamino, a Solana-based decentralized lending protocol.\n\nThe effort is being carried out in collaboration with Solana Company, a publicly traded Solana (SOL) treasury created in partnership with Pantera Capital and Summer Capital.\n\nUnder the structure, institutions can use natively staked SOL as collateral for onchain borrowing while the assets remain held at Anchorage Digital Bank, a federally chartered crypto bank. That means investors can continue earning staking rewards while accessing liquidity through Kamino’s lending markets.\n\nAnchorage acts as collateral manager, overseeing loan-to-value ratios, margin requirements and, if necessary, liquidations. Because the collateral remains in segregated custody, institutions do not need to move assets into smart contracts, a requirement that has historically limited participation by regulated entities.\n\nSolana Company is the second-largest SOL-based digital asset treasury, holding 2.3 million SOL. Source: CoinGecko\n\nRelated: Solana treasuries sitting on over $1.5B in paper SOL losses\n\nDeFi legislation hangs in the balance\n\nThe integration between Anchorage Digital, Kamino and Solana Company underscores growing institutional interest in decentralized finance. However, that momentum is unfolding against an uncertain regulatory backdrop in the United States, where lawmakers are still debating how to oversee digital assets and DeFi platforms.\n\nAt the center of the debate is the proposed CLARITY Act, which aims to establish clearer jurisdictional boundaries and regulatory standards for digital assets, including DeF"
      }
    ]
  }
}