{
  "Tech": {
    "summary": "## Executive Summary\nA recent data breach at Conduent has affected at least 25 million people, compromising personal data such as names, dates of birth, and Social Security numbers. Samsung is expected to announce new AI-based features for its Galaxy S26 series phones. Firefox 148 has introduced a new Sanitizer API to enhance XSS protection. Additionally, research has shown that password managers' claims of being \"zero knowledge\" may not always be true. \n\n## Market & Business Implications\n* Conduent's data breach has compromised personal data of at least 25 million people, including names, dates of birth, and Social Security numbers, as reported by TechCrunch.\n* Samsung's upcoming Galaxy S26 series phones are expected to feature AI-based camera capabilities, according to The Verge.\n* Firefox 148 has introduced a new Sanitizer API to provide stronger XSS protection, as stated in the article on Hacker News.\n* Research has found that password managers' \"zero knowledge\" claims may not be entirely accurate, particularly when account recovery is in place or vaults are shared, as reported by Ars Technica.\n\n## Beginner-Friendly Summary\nThere was a big data breach at a company called Conduent that affected a lot of people - at least 25 million. This means that personal information like names and Social Security numbers were taken. Samsung is coming out with new phones that will have special camera features. Also, a new browser update is trying to make the internet safer. And some password managers might not be as secure as they claim to be.",
    "articles": [
      {
        "title": "Conduent data breach grows, affecting at least 25M people",
        "link": "https://techcrunch.com/2026/02/24/conduent-data-breach-grows-affecting-at-least-25m-people/",
        "published": "Tue, 24 Feb 2026 14:09:11 +0000",
        "source": "TechCrunch",
        "text": "The spillover from a ransomware attack on one of the largest government contractors in the United States keeps getting bigger: more than 25 million people have now had personal data stolen in the hack.\n\nConduent provides printing, mailroom services, and document and payment processing services for state government benefit operations, such as food assistance, as well as workplace and unemployment benefits for large corporations. As such, the company handles a large amount of personal information belonging to a large swath of the United States. Conduent says its technology and operational support services reach more than 100 million people.\n\nBut since the January 2025 cyberattack attack, which a ransomware group claimed credit for, the corporate giant has said little about the data breach, such as how it was caused and how many people are affected.\n\nAn update to the state of Wisconsin’s data breach notification page now shows the Conduent breach affects at least 25 million people across the United States.\n\nTechCrunch’s ongoing tally from various data breach notification letters that we have seen also amounts to about 25 million people, with Oregon (10.5 million) and Texas (15.4 million) accounting for the majority of those affected. Other data breach notices seen by TechCrunch include another few hundred thousand individuals across Massachusetts, New Hampshire and Washington.\n\nThe breach is known to have compromised individuals’ names, dates of birth, addresses, Social Security numbers, health insurance information, and medical data.\n\nConduent has said little outside of its data breach notifications, and in some cases has made it more difficult for affected individuals to learn about the breach.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit 2026 for a full day focused on growth, execution, and real-world scaling. Learn from founders and investors who have shaped the indust"
      },
      {
        "title": "Samsung is on slop watch at Unpacked",
        "link": "https://www.theverge.com/tech/883225/samsung-galaxy-unpacked-s26-2026",
        "published": "2026-02-24T09:00:00-05:00",
        "source": "The Verge",
        "text": "Another Unpacked is nearly upon us. On February 25th, Samsung is expected to announce the Galaxy S26 series of flagship phones — potentially including the S26, S26 Plus, and S26 Ultra — with another round of AI-based features. That will come as a surprise to nobody. But as more AI creeps in on Samsung’s AI phones, there’s one important consideration: the slop factor.\n\nI’m talking, of course, about AI slop. Last week, Samsung put out a blog post promoting a new “seamless Galaxy camera experience” on its newest phones. Based on the examples in the article, that experience includes turning a picture of a puppy into cute little stickers, filling in the part of a cupcake you took a bite out of, brightening video in low light to make it more lively, and editing a picture of a cow in a field to make it look like it’s being abducted by aliens.\n\nHarmless, right? You can do most of that with Samsung’s AI editing tools already, and the blog post implies that you’ll be able to make these kinds of edits with natural language “simply by asking in your own words.” But here’s the line that has me worried we’re not just in for an easier path to cute puppy stickers: “Mobile cameras are moving beyond capture,” it says. Let’s — I’m so sorry to say this — unpack that just a bit.\n\nSmartphone cameras have long employed algorithms to squeeze every bit of image quality possible from their tiny sensors. They’ve been doing that for the better part of a decade. Most recently, the AI features have been creeping into the camera app itself — particularly in Google’s latest phones. The Pixel phone’s Add Me feature will help you fake an image in which everyone is posing together, even though it’s really two photos merged into one. And on the Pixel 10 Pro and Pro XL, you can use gen AI to fill in missing details at high digital zoom magnifications. These things are problematic as hell, but they’re ostensibly in service of creating an image that resembles one you saw, or one that could have happened "
      },
      {
        "title": "Goodbye InnerHTML, Hello SetHTML: Stronger XSS Protection in Firefox 148",
        "link": "https://hacks.mozilla.org/2026/02/goodbye-innerhtml-hello-sethtml-stronger-xss-protection-in-firefox-148/",
        "published": "Tue, 24 Feb 2026 13:04:16 +0000",
        "source": "Hacker News: Front Page",
        "text": "Cross-site scripting (XSS) remains one of the most prevalent vulnerabilities on the web. The new standardized Sanitizer API provides a straightforward way for web developers to sanitize untrusted HTML before inserting it into the DOM. Firefox 148 is the first browser to ship this standardized security enhancing API, advancing a safer web for everyone. We expect other browsers to follow soon.\n\nAn XSS vulnerability arises when a website inadvertently lets attackers inject arbitrary HTML or JavaScript through user-generated content. With this attack, an attacker could monitor and manipulate user interactions and continually steal user data for as long as the vulnerability remains exploitable. XSS has a long history of being notoriously difficult to prevent and has ranked among the top three web vulnerabilities (CWE-79) for nearly a decade.\n\nFirefox has been deeply involved in solutions for XSS from the beginning, starting with spearheading the Content-Security-Policy (CSP) standard in 2009. CSP allows websites to restrict which resources (scripts, styles, images, etc.) the browser can load and execute, providing a strong line of defense against XSS. Despite a steady stream of improvements and ongoing maintenance, CSP did not gain sufficient adoption to protect the long tail of the web as it requires significant architectural changes for existing web sites and continuous review by security experts.\n\nThe Sanitizer API is designed to help fill that gap by providing a standardized way to turn malicious HTML into harmless HTML — in other words, to sanitize it. The setHTML( ) method integrates sanitization directly into HTML insertion, providing safety by default. Here is an example of sanitizing a simple unsafe HTML:\n\ndocument.body.setHTML(`<h1>Hello my name is <img src=\"x\" onclick=\"alert('XSS')\">`);\n\nThis sanitization will allow the HTML <h1> element while removing the embedded <img> element and its onclick attribute, thereby eliminating the XSS attack resulting in the fol"
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Tide’s Evo Tiles Are a Fresh, Overengineered Take on the Tide Pod",
        "link": "https://www.wired.com/story/tide-evo-tiles/",
        "published": "Tue, 24 Feb 2026 14:00:00 +0000",
        "source": "WIRED",
        "text": "Laundry is a $100 billion business. It can also be a real time suck, what with all the washing, drying, and folding. Detergent company Tide has found great success with its Pods that let you pop detergent right into a washing machine without having to measure and pour liquid or powder. Now, the next evolution is an exhaustively engineered single-use detergent called Tide Evo Tiles—a dry, fibery, single-use tile that can dissolve in cold water. It looks a lot less tasty than the bright, colorful Tide Pods, so hopefully, fewer people will try to eat this one.\n\nTide Evo Tiles have been in product development for over a decade. After spending a year in test markets, Tide and its parent company, Procter & Gamble, announced last week that Evo Tiles are now rolling out more broadly across the US. Prices range from $5 to $20 per box, depending on the retailer, with the price roughly 50 cents per tile.\n\n“This is really a feat of engineering,” says Marcello Puddu, senior director of research and development at Tide. “There is a lot of very complicated engineering and formulation work that has gone to create that one single sleek tile that looks relatively simple.”\n\nThe primary hope for Tide Evo is simplicity. Single-use detergent pods are lauded for being more accessible to people who may struggle with the motor skills required to pour liquid soap or powders. Evo Tiles have a small ridge around the edges that makes them easier to pull out of the box. Deploying them is easy—just plop them (one tile for regular loads, two for heavy) into the washer as close to where the water comes out as possible, then toss the fabrics on top.\n\nAfter the tile breaks apart, the ingredients work together to create a very high pH level in the water that cleans the fabrics. (Because of the high pH, Tide Evo does not use lipase, an enzyme that breaks down stains and is a popular ingredient in other detergents.)\n\nEvo Tiles look like white, diamond-shaped Uncrustables. Instead of a Tide Pod’s colorfu"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nNew Relic has launched an AI agent platform to help enterprises monitor their data and catch issues before they disrupt products. Meanwhile, ProducerAI, an AI-powered music-making platform, is joining Google and will be powered by Google's new Lyria 3 music-making AI model. Additionally, Nimble has raised $47 million to give AI agents access to real-time web data. Some AI researchers have been resigning and voicing concerns about AI safety. \n\n## Market & Business Implications\n* New Relic has launched a no-code agentic platform that lets enterprises put together data observability AI agents, as stated by Brian Emerson, the company's new chief product officer (Article 1).\n* ProducerAI is joining Google and will be powered by Google's new Lyria 3 music-making AI model, according to Seth Forsgren, the cofounder and CEO of ProducerAI (Article 3).\n* Nimble has raised a $47 million Series B round to give AI agents access to real-time web data, as stated by Nimble CEO and co-founder Uri Knorovich (Article 4).\n* Research organization Gartner has called agent platforms like New Relic's \"necessary infrastructure\" and a critical component of getting enterprises to adopt AI (Article 1).\n* Some AI researchers at top AI companies have been resigning and publicly voicing their concerns about AI safety, as reported by Zoë Schiffer (Article 5).\n\n## Beginner-Friendly Summary\nNew Relic made a tool to help companies use AI to watch their data and fix problems. A company called ProducerAI that makes music with AI is now part of Google. Another company called Nimble got a lot of money to help AI access information from the internet. Some people who work on AI are worried about its safety and have quit their jobs.",
    "articles": [
      {
        "title": "New Relic launches new AI agent platform and OpenTelemetry tools",
        "link": "https://techcrunch.com/2026/02/24/new-relic-launches-new-ai-agent-platform-and-opentelemetry-tools/",
        "published": "Tue, 24 Feb 2026 14:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Companies are increasingly launching software to build and monitor AI agents in an effort to get enterprises to adopt AI. New Relic is no different. As the data observability company launches an AI agent platform of its own, it knows it isn’t the only game in town.\n\nNew Relic on Tuesday unveiled a no-code agentic platform that lets enterprises put together data observability AI agents that monitor a company’s data to catch bugs and issues before they disrupt products. Called New Relic Agentic Platform, it lets companies deploy pre-built agents and manage existing bots as well.\n\nIt also supports the model context protocol (MCP), which connects AI applications to external data sources, and integrates with other New Relic tools.\n\nNew Relic isn’t looking to be the only platform that companies use to manage and deploy all of their AI agents, Brian Emerson, the startup’s new chief product officer, told TechCrunch. Instead, the aim is to offer clients the same agent-building capabilities they are getting elsewhere for observability as well.\n\n“We’re not building this as general purpose,” Emerson said. “We’re building it for outcomes that we care about inside observability. It’s also a world that allows us to work with the rest of the ecosystem or tools that exist out there, but bring it back into the context of problems we’re trying to solve around our personas and the observability domain.”\n\nSoftware that lets users manage AI agents has proliferated in recent months as companies look to figure out how to quell enterprises’ fears about giving AI agents access to their data and software.\n\nSalesforce was arguably the first to release an agent platform in late 2024, calling it Agentforce. OpenAI launched its own version of the technology, OpenAI Frontier, earlier this year. Research organization Gartner has called such agent platforms “necessary infrastructure” and a critical component of getting enterprises to adopt AI.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch F"
      },
      {
        "title": "AI Will Never Be Conscious",
        "link": "https://www.wired.com/story/book-excerpt-a-world-appears-michael-pollan/",
        "published": "Tue, 24 Feb 2026 11:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "The Blake Lemoine incident is remembered today as a high‑water mark of AI hype. It thrust the whole idea of conscious AI into public awareness for a news cycle or two, but it also launched a conversation, among both computer scientists and consciousness researchers, that has only intensified in the years since. While the tech community continues to publicly belittle the whole idea (and poor Lemoine), in private it has begun to take the possibility much more seriously. A conscious AI might lack a clear commercial rationale (how do you monetize the thing?) and create sticky moral dilemmas (how should we treat a machine capable of suffering?). Yet some AI engineers have come to think that the holy grail of artificial general intelligence—a machine that is not only supersmart but also endowed with a human level of understanding, creativity, and common sense—might require something like consciousness to attain. In the tech community, what had been an informal taboo surrounding conscious AI—as a prospect that the public would find creepy—suddenly began to crumble.\n\nCourtesy of Penguin Press Buy This Book At: Amazon\n\nBookshop.org\n\nTarget If you buy something using links in our stories, we may earn a commission. This helps support our journalism. Learn more.\n\nThe turning point came in the summer of 2023, when a group of 19 leading computer scientists and philosophers posted an 88‑page report titled “Consciousness in Artificial Intelligence,” informally known as the Butlin report. Within days, it seemed, everyone in the AI and consciousness science community had read it. The draft report’s abstract offered this arresting sentence: “Our analysis suggests that no current AI systems are conscious, but also suggests that there are no obvious barriers to building conscious AI systems.”\n\nThe authors acknowledged that part of the inspiration behind convening the group and writing the report was “the case of Blake Lemoine.” “If AIs can give the impression of consciousness,” a coauth"
      },
      {
        "title": "This Chainsmokers-approved AI music producer is joining Google",
        "link": "https://www.theverge.com/tech/883307/google-producerai-deal-music",
        "published": "2026-02-24T09:00:00-05:00",
        "source": "AI | The Verge",
        "text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nProducerAI, an AI-powered music-making platform, is joining Google. As part of the deal, Google will fold ProducerAI under the Labs umbrella and power the tool with a preview version of its new Lyria 3 music-making AI model.\n\nProducerAI is a music-making platform that allows users to work with an AI agent to generate sounds, workshop lyrics, remix songs, and even create new instruments based on a prompt. The platform launched in July 2025 as a successor to the AI music-making tool Riffusion, and initially used the startup’s own AI model to help you generate songs and tweak existing ones. Seth Forsgren, the cofounder and CEO of ProducerAI, tells The Verge the team is “just scratching the surface of what these models are going to be able to do once we harness everything that Google brings to the table.”\n\n“You can talk to this producer like you would a Gemini model, ask questions, and learn about a new genre,” Forsgren says. “As soon as you want to, you can start actually creating, and you can craft things with these instruments and make a song and iterate on it.”\n\nAccording to Elias Roman, the director of product management at Google Labs, the key difference between ProducerAI and other AI music-making platforms is the conversation with the platform’s built-in agent. “It’s not a tool that you put in your prompt, roll the slot machine, and something will come out,” Roman says. “The reality is that’s not how good music is made … and ProducerAI was really made for the back-and-forths that play out over time.”\n\nIn addition to using Lyria 3 for music generation and Gemini for its chat interface, ProducerAI will leverage Google’s image-generation model, Nano Banana, to create album art, and Veo to generate AI-powered music videos. “All of t"
      },
      {
        "title": "Nimble raises $47M to give AI agents access to real-time web data",
        "link": "https://techcrunch.com/2026/02/24/nimble-way-raises-47m-to-give-ai-agents-better-cleaner-data/",
        "published": "Tue, 24 Feb 2026 13:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Believe it or not, web search is still thriving as an industry. As businesses invest in using AI agents to make the most of their data, there’s demand for tools that not only scrape the web to inform what those AI bots do, but also return those results in a way that’s easier to use with modern data tools.\n\nThat’s the promise behind web search startup Nimble, which recently raised a $47 million Series B round, led by Norwest. The New York company’s platform employs AI agents to search the web in real time, verify, and validate the results, and then structure the information into neat tables that can then be queried like a database.\n\nThat last part is crucial here. LLMs and AI agents are great for searching the web, connecting results from a variety of sources, and analyzing them, but they often return the results in plain text, which can be difficult to work with at an enterprise level. And that’s before you factor in hallucinations, the risk of the agent misunderstanding your instructions, or the use of unreliable sources.\n\nBy validating and structuring results into tables, Nimble lets companies use web data as if it were already part of their existing databases. The startup also integrates with enterprise data warehouses and data lakes — large centralized repositories where businesses store and analyze data — offered by the likes of Databricks and Snowflake. That means its AI agents can plug into a business’s trove of data, using it to build context, and shape how search results are structured and returned.\n\nIn effect, this lets enterprises have live, structured web data as part of their existing data environments, Nimble CEO and co-founder Uri Knorovich (pictured above, middle) told TechCrunch.\n\nSuch integrations also allow Nimble’s software to remember constraints — such as how you want the search to be performed, or which data sources to tap. This is particularly useful for applications such as competitor analysis, pricing research, know-your-customer (KYC) proc"
      },
      {
        "title": "Uncanny Valley: AI Researchers’ Resignations, Bots Hiring Humans, Evie Magazine’s Party",
        "link": "https://www.wired.com/story/uncanny-valley-podcast-ai-researcher-resignations-bots-hiring-humans-evie-magazines-party/",
        "published": "Mon, 23 Feb 2026 19:28:13 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "This week, Zoë Schiffer dives into why some researchers at top AI companies have been resigning and publicly voicing their concerns about AI safety. Brian Barrett tells us why Rent-A-Human—a website where AI agents hire humans to perform various tasks—has gathered attention and controversy. Leah Feiger shares her experience attending a party for the conservative magazine Evie, and how the culture around the publication could shape the upcoming election cycle.\n\nYou can follow Brian Barrett on Bluesky at @brbarrett, Zoë Schiffer on Bluesky at @zoeschiffer, and Leah Feiger on Bluesky at @leahfeiger. Write to us at uncannyvalley@wired.com.\n\nHow to Listen\n\nYou can always listen to this week's podcast through the audio player on this page, but if you want to subscribe for free to get every episode, here's how:\n\nIf you're on an iPhone or iPad, open the app called Podcasts, or just tap this link. You can also download an app like Overcast or Pocket Casts and search for “Uncanny Valley.” We’re on Spotify too.\n\nTranscript\n\nNote: This is an automated transcript, which may contain errors.\n\nBrian Barrett: Hey, it's Brian. Zoë, Leah, and I have really enjoyed being your new hosts these past few weeks, and we want to hear from you. If you like the show and have a minute, please leave us a review in the podcast or app of your choice. It really helps us reach more people. And for any questions and comments you can always reach us at uncannyvalley@wired.com. Thank you for listening. On to the show.\n\nHow did everybody spend their three-day weekend?\n\nLeah Feiger: Brian, I obviously saw Wuthering Heights.\n\nBrian Barrett: Obviously.\n\nZoë Schiffer: Wait, was it really bad? I saw that post that was like—\n\nLeah Feiger: Nope. Everyone's wrong.\n\nZoë Schiffer: … Charlotte Bronte died from tuberculosis.\n\nLeah Feiger: Emily, this was an Emily Bronte joint … it was her only book.\n\nBrian Barrett: First of all, Zoë.\n\nZoë Schiffer: I'm actually ashamed because this book was an important part of my e"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nBMO Capital has raised the price target for Ryerson to $31 from $29. Meta has struck a deal with AMD to deploy up to 6 gigawatts of graphics processing units for AI data centers. President Trump is expected to call on tech companies to pay more for electricity for new data centers. Jamie Dimon, CEO of JPMorgan Chase, has warned that the current market resembles the pre-financial crisis era. The Federal Reserve's Austan Goolsbee has called for a hold on interest rate cuts until inflation is closer to the 2% target.\n\n## Market & Business Implications\n* BMO Capital has raised the price target for Ryerson to $31 from $29 and maintains a Market Perform rating on the shares, citing improved market activity and expected higher earnings (Article 1).\n* Meta has signed a multiyear deal with AMD to deploy up to 6 gigawatts of graphics processing units for AI data centers, including a performance-based warrant for Meta to acquire 160 million AMD shares (Article 2).\n* President Trump is expected to announce \"rate payer protection pledges\" that require tech companies to pay increased electricity costs in communities where new AI data centers are being built (Article 3).\n* Jamie Dimon, CEO of JPMorgan Chase, has warned that the current market resembles the pre-financial crisis era, with people \"getting a little comfortable\" with high asset prices and high volumes (Article 4).\n* Austan Goolsbee, President of the Federal Reserve Bank of Chicago, has stated that interest rate cuts are not appropriate until there is more evidence that inflation is on its way down, citing a current inflation rate of 3% as \"not good enough\" (Article 5).\n\n## Beginner-Friendly Summary\nSome important things happened in the world of finance. A company called BMO Capital thinks another company called Ryerson will do well. A big tech company called Meta made a deal with a computer chip company called AMD. The President of the United States wants tech companies to pay more for the electricity they use. A bank CEO named Jamie Dimon thinks the market is getting a little too comfortable. A person in charge of the Federal Reserve named Austan Goolsbee wants to wait before making any big changes to interest rates because inflation is still too high.",
    "articles": [
      {
        "title": "Ryerson price target raised to $31 from $29 at BMO Capital",
        "link": "https://finance.yahoo.com/news/ryerson-price-target-raised-31-135602482.html",
        "published": "2026-02-24T13:56:02Z",
        "source": "Yahoo Finance",
        "text": "BMO Capital raised the firm’s price target on Ryerson (RYI) to $31 from $29 and keeps a Market Perform rating on the shares after its Q4 results. The quarter was negatively impacted by transitory margin compression, but looking ahead, market activity has improved and earnings are expected to trend higher from here, the analyst tells investors in a research note. The focus moving forward will be on delivering the expected synergies, with capital allocation in the near term likely remaining tilted to reducing leverage, the firm adds.\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee Insiders’ Hot Stocks on TipRanks >>\n\nRead More on RYI:\n\nDisclaimer & DisclosureReport an Issue"
      },
      {
        "title": "Meta strikes AI chip deal with AMD days after committing to deploy millions of Nvidia GPUs",
        "link": "https://www.cnbc.com/2026/02/24/meta-to-use-6gw-of-amd-gpus-days-after-expanded-nvidia-ai-chip-deal.html",
        "published": "Tue, 24 Feb 2026 13:23:40 GMT",
        "source": "US Top News and Analysis",
        "text": "Lisa Su, chair and chief executive officer of Advanced Micro Devices Inc., displays an AMD Instinct MI455X GPU during the 2026 CES event in Las Vegas, Jan. 5, 2026.\n\nA week after Meta committed to using millions of Nvidia's processors to power its AI expansion, the social media company has inked another mammoth chip deal, this time with Advanced Micro Devices .\n\nMeta said on Tuesday that the multiyear deal with AMD involves deploying up to 6 gigawatts of the company's graphics processing units for AI data centers and includes use of AI-optimized central processing units, or CPUs. Early shipments of MI450 GPUs in AMD's Helios rack-scale servers will begin later this year.\n\nTune in at 9:30 a.m. ET as Advanced Micro Devices CEO Lisa Su joins CNBC TV to discuss Meta's chip deal with AMD. Watch in real time on CNBC+ or the CNBC Pro stream.\n\nAMD CEO Lisa Su said in a statement that her company is delivering \"high-performance, energy-efficient infrastructure optimized for Meta's workloads, accelerating one of the industry's largest AI deployments and placing AMD at the center of the global AI buildout.\"\n\nThe deal also includes a performance-based warrant for Meta to acquire 160 million AMD shares, about 10% of the company. The first tranche vests when the first 1 GW of Instinct GPUs are shipped. Other tranches vest as Meta makes purchases to 6GW.\n\nVesting is also tied to stock price thresholds for AMD and technical and commercial milestones for Meta.\n\nAMD struck a similar deal with OpenAI in October, marking it as a viable second option for AI giants and hyperscalers.\n\nThat agreement also gave OpenAI warrants to acquire 160 million shares of AMD and was tied to deployment and stock price benchmarks.\n\nIn its earnings report last month, Meta committed to up to $135 billion in capital expenditures this year as it tries to keep pace with its megacap peers as well as OpenAI and Anthropic in the global AI race. Overall, Meta has plans for 30 data centers, including 26 in the U.S"
      },
      {
        "title": "Trump to call for tech companies to pay more for data center electricity: report",
        "link": "https://www.foxbusiness.com/politics/trump-call-tech-companies-pay-more-data-center-electricity-report",
        "published": "Tue, 24 Feb 2026 06:54:16 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "President Donald Trump will formally call on tech companies to pay more for electricity for new data centers, The Wall Street Journal reported Tuesday.\n\nTrump is expected to make the call during his State of the Union address on Tuesday night, announcing new \"rate payer protection pledges\" the administration has negotiated with top tech companies. The pledges require tech companies to pay increased electricity costs in communities where new AI data centers are being built, officials told the Journal.\n\nTrump's address to a joint session of Congress is expected to put the economy front and center, pairing working-family guests with a data-driven case on affordability in addition to various economic policy announcements.\n\nTrump is slated to begin his speech at 9 p.m. Eastern Standard Time Tuesday evening from the U.S. Capitol. The Journal reported that Trump made edits to the speech over the weekend.\n\nTRUMP HITS THE ROAD TO SELL ECONOMIC WINS, AS REPUBLICANS BRACE FOR HIGH-STAKES MIDTERM SHOWDOWN\n\n\"President Trump's State of the Union Address will celebrate 250 glorious years of our nation's independence and excellence, highlighting incredible stories of American heroes throughout the speech,\" White House press secretary Karoline Leavitt told Fox News Digital ahead of the speech.\n\nTouting Trump Accounts, tax cuts in the \"big, beautiful bill,\" lowering drug prices and working to ease the ability of American families to purchase a home are among Trump's top orders of business, Fox News Digital learned. The president also is expected to make undisclosed economic policy announcements during the speech.\n\nThe economy is a top concern for voters as they prepare to vote for a new Congress in November, which follows Democrats' 2025 winning campaign strategy around \"affordability.\"\n\nTRUMP APPROVAL CLIMBS AS REPUBLICANS RALLY BEHIND PRESIDENT'S AFFORDABILITY AGENDA: POLL\n\nA White House official told Fox News Digital that Trump invited guests tied to the various economic initiativ"
      },
      {
        "title": "Jamie Dimon warns markets resemble pre-financial crisis era: 'I see a couple of people doing some dumb things'",
        "link": "https://finance.yahoo.com/news/jamie-dimon-warns-markets-resemble-pre-financial-crisis-era-i-see-a-couple-of-people-doing-some-dumb-things-133719344.html",
        "published": "2026-02-24T13:37:19Z",
        "source": "Yahoo Finance",
        "text": "JPMorgan Chase (JPM) CEO Jamie Dimon said Monday that the financial world looks a lot like the heyday in the years ahead of the global financial crisis.\n\n“Unfortunately, we did see this in '05, '06, '07, almost the same thing,\" Dimon said at the firm's annual investor day in New York on Monday. \"The rising tide lifting all boats, everyone was making a lot of money, people leveraging to the hilt. The sky was the limit.”\n\n“My own view is people are getting a little comfortable that this is real — these high asset prices and high volumes and that we won't have any kind of problem whatsoever. So we're quite cautious about that,” Dimon added.\n\nDimon’s comments come amid a turbulent market period, as investors have dumped stocks across a range of industries over fears that artificial intelligence will disrupt their core businesses. In the financial industry, these challenges have been most acutely felt in private credit markets.\n\n“All of our main competitors are back,” said Dimon, who on Monday wore a cast on one hand after recently having surgery to treat arthritis. “It's good for the world, et cetera. I don't know how long it's going to be great for everybody. I see a couple of people doing some dumb things,” he added.\n\nRead more: How to protect your money during turmoil, stock market volatility\n\nJPMorgan Chase chairman and CEO Jamie Dimon speaks during the World Economic Forum (WEF) annual meeting in Davos on Jan. 21, 2026. (Fabrice COFFRINI / AFP via Getty Images) · FABRICE COFFRINI via Getty Images\n\nFor years, Dimon has consistently warned about high asset prices, though his worries don’t always come to fruition. Last fall, his credit market views caused a stir when he likened a string of bad loans at his and other banks to cockroaches.\n\n\"I shouldn't say this, but when you see one cockroach, there's probably more,\" Dimon said on the firm's earnings call in October. \"Everyone should be forewarned on this one.\"\n\nLast year, Wall Street banks had one of their best years "
      },
      {
        "title": "Fed's Goolsbee calls for a hold on cuts as current rate of inflation is 'not good enough'",
        "link": "https://www.cnbc.com/2026/02/24/feds-goolsbee-calls-for-a-hold-on-cuts-as-current-rate-of-inflation-is-not-good-enough.html",
        "published": "Tue, 24 Feb 2026 13:00:59 GMT",
        "source": "US Top News and Analysis",
        "text": "Austan Goolsbee, President and CEO of the Federal Reserve Bank of Chicago, speaks to the Economic Club of New York in New York City, U.S., April 10, 2025.\n\nChicago Federal Reserve President Austan Goolsbee said Tuesday that interest rate cuts aren't appropriate until there's more evidence that inflation is on its way down.\n\nWith recent indicators showing that inflation well off its highs but still above the Fed's 2% target, Goolsbee noted that policymakers \"have been burned by assuming transitory inflation\" in the past and shouldn't make the same mistake again.\n\n\"I feel that front-loading too many rate cuts is not prudent in that circumstance,\" he said in remarks before the National Association for Business Economics at its annual gathering in Washington, D.C. \"People express that prices are one of their most pressing concerns. Let's pay attention. Before we cut rates more to stimulate the economy, let's be sure inflation is heading back to 2%.\"\n\nThe most recent inflation data, for December, showed core inflation, which excludes volatile food and energy prices, running at 3%, as measured by the consumption expenditures price index, the Fed's primary forecasting gauge. That was up 0.2 percentage point from November and came somewhat due to tariffs, which are viewed as temporary, but also from underlying pressures in the service sector and areas not directly impacted by the duties.\n\nSpecifically, Goolsbee said stubbornly high housing inflation isn't tariff driven, emphasizing the need for the Fed to be \"vigilant.\"\n\nGoolsbee noted that a 3% inflation rate \"is not good enough — and it's not what we promised when the Federal Reserve committed to the 2% target. Stalling out at 3% is not a safe place to be for a myriad of reasons we know all too well.\" He has said previously that he thinks the Fed will be able to cut later in the year.\n\nThe remarks come with markets expecting the Federal Open Market Committee, of which Goolsbee is a voter this year, to stay on hold until a"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe US Department of Justice has withheld dozens of pages related to allegations of President Trump sexually abusing a minor, as part of the released Epstein files. Meanwhile, Russia's war on Ukraine has entered its fifth year, with the conflict becoming a grinding war of attrition. The Royal Artillery is facing criticism for denying public access to a looted Asante treasure, a golden ram's head. Additionally, AMD has clinched a mega chip supply deal with Meta, and Russian soldiers have reported seeing fellow troops executed on commanders' orders.\n\n## Market & Business Implications\n* AMD has secured a major chip supply deal with Meta, as reported by Reuters.\n* The Royal Artillery's decision to deny public access to the looted Asante treasure may have implications for cultural institutions and historical preservation, according to The Guardian.\n* The ongoing war between Russia and Ukraine has resulted in significant casualties and territorial changes, with Russia currently controlling over 19% of Ukrainian territory, as reported by NPR.\n\n## Beginner-Friendly Summary\nThere are some important news stories happening around the world. The US government is not sharing some information about President Trump. A war between Russia and Ukraine has been going on for a long time. A group in the UK is not letting people see a valuable treasure that was taken from another country. These are some of the big news stories right now.",
    "articles": [
      {
        "title": "DOJ hides Trump-related Epstein files. And, what to know for the State of the Union",
        "link": "https://www.npr.org/2026/02/24/g-s1-111316/up-first-newsletter-trump-sotu-mexico-cartel-epstein-files",
        "published": "Tue, 24 Feb 2026 07:19:03 -0500",
        "source": "NPR Topics: World",
        "text": "DOJ hides Trump-related Epstein files. And, what to know for the State of the Union\n\nGood morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.\n\nToday's top stories\n\nMillions of pages of Epstein files have been released to the public, but an NPR investigation reveals a gap: The Justice Department has removed or withheld dozens of pages related to allegations that President Trump sexually abused a minor decades ago. The Justice Department declined to answer NPR's questions on the record about these specific files, what's in them, and why they are not published.\n\ntoggle caption Department of Justice and Getty Images/Collage by Danielle A. Scruggs/NPR\n\n🎧 NPR's Stephen Fowler tells Up First that an NPR review of the files found an FBI email from last July listing various claims and tips it received about Trump. One report accused Trump of sexually abusing a minor around 1983, when Jeffrey Epstein also allegedly abused her. A field office investigated the report, and the records show the FBI interviewed the accuser four times. Only one of the accuser's interviews was made public, but it doesn't mention Trump. According to the DOJ's tracking system, the Justice Department did not make at least 50 pages of the files public. The White House and the Trump administration have consistently stated that nothing in the documents incriminates the president.\n\nSponsor Message\n\nChaos erupted after Mexico's military killed a man known as El Mencho, the country's most powerful drug lord. Now, the country's cities are slowly returning to normal. Businesses are set to reopen today, and schools in the state of Jalisco will reopen tomorrow. But big questions remain about what El Mencho's death means for Mexico's fight against organized crime.\n\n\n\n🎧 NPR's Eyder Peralta says the scene in Jalisco's capital, Guadalajara, is eerie and feels similar to the COVID lockdown. S"
      },
      {
        "title": "AMD clinches second mega chip supply deal, this time with Meta - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNNUhoejdkTDYxM04zNzhrcmFJb2pDejRDcF9oYkFOYUt4RnJsNFlka1Ryb2xkdkhlZ2lHV25QdjgwbXZJU0hONGNMcDJuYS1MRC1UaE1lVTRsODExWUhqclpiSXlXZDhxT0JneFFxd2l6cWQ0b1NDdkZ5OC12TWYzVF8yMFUwenloUkVSUTZyZFNRTTdHUVIzbFl5U0dJX1R0b3dndjBOX003UQ?oc=5",
        "published": "Tue, 24 Feb 2026 12:01:37 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Royal Artillery under fire after denying access to looted Asante treasure",
        "link": "https://www.theguardian.com/uk-news/2026/feb/24/royal-artillery-access-looted-asante-treasure-ghana",
        "published": "Tue, 24 Feb 2026 13:45:27 GMT",
        "source": "World news | The Guardian",
        "text": "The Royal Artillery is facing criticism after it emerged they are refusing public access to an “extraordinary object” looted by the British army in the 19th century from the Asante people in modern-day Ghana.\n\nThe glistening golden ram’s head would seemingly be worthy of any museum, but it remains hidden within the regiment’s mess at Larkhill in Wiltshire.\n\nThe artefact is among treasures pillaged by the British army from the sprawling old royal palace in the Asante state capital, Kumasi, in 1874, before soldiers set fire to the city and blew up the palace. The British returned in 1896 and looted the rebuilt palace. Their commander later recalled: “I had shown the power of England.”\n\nThe spoils of the Anglo-Asante wars were sold and dispersed among private and public collections, including to the Victoria and Albert Museum and the British Museum, which, in 2024, together made the historic decision to return 32 pieces of gold court regalia to the Manhyia Palace Museum in Ghana – although only on long-term loan.\n\nThe most impressive of the looted objects is arguably the beautifully cast ram’s head with spiralling horns, about 19cm in width.\n\nAmong newspaper reports of 1874, the Shipping and Mercantile Gazette reported: “The best trophy is a ram’s head … This is very valuable.”\n\nBarnaby Phillips, a former BBC correspondent who reported for over a decade from Mozambique, Angola, Nigeria and South Africa, was taken aback when his request to see it in researching his forthcoming book was turned down for security reasons.\n\nHe said: “It’s an army institution holding the spoils of war, but they say it’s not safe to show it to me. That’s somewhat ironic.”\n\nHe added: “The letter from the Royal Artillery’s regimental secretary was curt and categorical. The regiment was ‘unable to agree’ to my request to see its Asante gold ram’s head, held in the officers’ mess room at their barracks in Larkhill … ‘It has long been our policy, primarily on security grounds, not to allow public "
      },
      {
        "title": "Russian soldiers tell BBC they saw fellow troops executed on commanders' orders",
        "link": "https://www.bbc.com/news/articles/cz7gw3l395ro?at_medium=RSS&at_campaign=rss",
        "published": "Tue, 24 Feb 2026 06:02:13 GMT",
        "source": "BBC News",
        "text": "One of the men, whose job was to identify and count dead soldiers, provided detailed lists showing that he is the sole survivor from a group of 79 men he was mobilised with. Because he refused to go to the front line, he says he was tortured and urinated on. Others in his unit who refused would be electrocuted, starved and then forced into meat storms unarmed, he says."
      },
      {
        "title": "Russia thought it would take days to seize Ukraine. 4 years later, war is still raging",
        "link": "https://www.npr.org/2026/02/24/nx-s1-5721139/russia-ukraine-war",
        "published": "Tue, 24 Feb 2026 06:00:00 -0500",
        "source": "NPR Topics: World",
        "text": "Russia thought it would take days to seize Ukraine. 4 years later, war is still raging\n\ntoggle caption Vitalii Nosach/Global Images Ukraine via Getty Images\n\nKYIV, Ukraine, and MOSCOW — When the Kremlin launched its all-out invasion of Ukraine in 2022, the assumption in Moscow, and much of the West, was that Russian forces would take the country in a matter of days.\n\nInstead, what the Kremlin calls a \"special military operation\" has become the biggest land war in Europe since World War II and has lasted longer than the Soviet army's fight against Nazi Germany. Russia's war on Ukraine is a grinding war of attrition. Ukraine has managed to hold a much larger army to minimal gains while adjusting to a life under constant siege and grief. Both countries have suffered enormous casualties.\n\nSponsor Message\n\nEfforts to find a negotiated settlement to the conflict appear largely at an impasse. During his campaign in the 2024 presidential election, Donald Trump famously claimed he could end the war in a day once he returned to the White House. A year of U.S. diplomatic efforts have brought Russian and Ukrainian envoys to the table but no closer to a consensus. Sticking points include claims over territory, reparations and security guarantees.\n\nWith the war now entering its fifth year, here is a snapshot of its key developments and where it may be headed in the future.\n\nThe battlefield picture\n\nLoading...\n\nDynamic shifts on the battlefield — with large swaths of Ukrainian land changing hands in offensives and counteroffensives in the early years of the war — have since given way to a conflict of inches. At the height of Russia's gains in 2022, its forces had seized more than 26% of Ukrainian territory, according to the U.S.-based Institute for the Study of War. Today Russia controls just over 19% of Ukraine, a figure that includes the Crimean Peninsula and parts of eastern Ukraine seized in 2014. Russia continues to have an advantage in men and matériel — factors that have le"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nPresident Donald Trump has announced new tariffs, which some experts believe are not legally justified. Trump is also expected to call on tech companies to pay more for electricity for new data centers during his State of the Union address. Additionally, Novo Nordisk has announced plans to slash the list prices of its popular obesity and diabetes drugs in the US by up to 50%. The Labor Secretary's spouse, Shawn DeRemer, remains banned from the Labor Department's headquarters amid an inquiry. Trump's new tariff has come into effect, but at a lower rate than expected.\n\n## Market & Business Implications\n* President Donald Trump's new tariffs are not legally justified, according to several prominent economists and trade experts, as stated in Article 1.\n* Trump is expected to call on tech companies to pay more for electricity for new data centers, as reported in Article 2.\n* Novo Nordisk plans to slash the monthly list prices of its popular obesity and diabetes drugs in the US by up to 50%, starting in 2027, as announced in Article 4.\n* The new tariff has come into effect at a lower rate than expected, as reported in Article 3.\n* Shawn DeRemer, the Labor Secretary's spouse, remains banned from the Labor Department's headquarters amid an inquiry, as stated in Article 5.\n\n## Beginner-Friendly Summary\nThe President of the United States, Donald Trump, has made some big announcements. He has introduced new taxes on imported goods, which some people think are not fair. He also wants big tech companies to pay more for the electricity they use. A company called Novo Nordisk is going to lower the prices of some of its medicines. Additionally, there is an issue with the husband of a important government official, and he is not allowed to go to certain government buildings. Trump's new taxes have started, but they are not as high as people thought they would be.",
    "articles": [
      {
        "title": "Trump’s newest tariffs could face legal challenge, though time is short",
        "link": "https://www.washingtonpost.com/business/2026/02/24/tariff-challenge-trade-law/",
        "published": "Tue, 24 Feb 2026 11:00:20 +0000",
        "source": "Business",
        "text": "President Donald Trump’s new tariffs are not legally justified, according to several prominent economists and trade experts, who say there is no sign of the profound international financial problems that such measures were intended to remedy. Hours after the Supreme Court invalidated the emergency tariffs that he imposed last year, Trump on Friday invoked a 1974 law to announce a new 10 percent global import tax, later raising it to 15 percent. The president cited a provision known as Section 122 that authorizes temporary restrictions on imports to deal with “fundamental international payments problems.”\n\nIn an official proclamation, the president said the nation’s “balance of payments,” a comprehensive account of Americans’ financial transactions with foreigners, was suffering “a large and serious deficit.” And he listed a number of metrics reflecting a deteriorating U.S. financial posture.\n\nThe law does not define “balance-of-payments deficit,” and economists disagree about what should be included in the term. But several critics, including the International Monetary Fund’s former chief economist and a prominent conservative legal commentator, disputed the president’s claim. Trump wrongly conflated an alleged payments deficit with the merchandise trade deficit that he targeted last year with his first set of comprehensive tariffs under the International Emergency Economic Powers Act (IEEPA), they said.\n\n“The US does not have a ‘payments’ problem. It can finance its trade deficits,” Gita Gopinath, the former IMF official, now teaching at Harvard University, wrote on X.\n\nAdded Andrew McCarthy, a former federal prosecutor, writing in the conservative National Review: “These new tariffs are even more clearly illegal than Trump’s IEEPA tariffs.”\n\nOpposition to the new import taxes erupted even before they took effect at 12:01 a.m. on Tuesday. The outcry suggested that the president, still smarting from his 6-3 Supreme Court defeat, could face renewed legal jeopardy ove"
      },
      {
        "title": "Trump to call for tech companies to pay more for data center electricity: report",
        "link": "https://www.foxbusiness.com/politics/trump-call-tech-companies-pay-more-data-center-electricity-report",
        "published": "Tue, 24 Feb 2026 06:54:16 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "President Donald Trump will formally call on tech companies to pay more for electricity for new data centers, The Wall Street Journal reported Tuesday.\n\nTrump is expected to make the call during his State of the Union address on Tuesday night, announcing new \"rate payer protection pledges\" the administration has negotiated with top tech companies. The pledges require tech companies to pay increased electricity costs in communities where new AI data centers are being built, officials told the Journal.\n\nTrump's address to a joint session of Congress is expected to put the economy front and center, pairing working-family guests with a data-driven case on affordability in addition to various economic policy announcements.\n\nTrump is slated to begin his speech at 9 p.m. Eastern Standard Time Tuesday evening from the U.S. Capitol. The Journal reported that Trump made edits to the speech over the weekend.\n\nTRUMP HITS THE ROAD TO SELL ECONOMIC WINS, AS REPUBLICANS BRACE FOR HIGH-STAKES MIDTERM SHOWDOWN\n\n\"President Trump's State of the Union Address will celebrate 250 glorious years of our nation's independence and excellence, highlighting incredible stories of American heroes throughout the speech,\" White House press secretary Karoline Leavitt told Fox News Digital ahead of the speech.\n\nTouting Trump Accounts, tax cuts in the \"big, beautiful bill,\" lowering drug prices and working to ease the ability of American families to purchase a home are among Trump's top orders of business, Fox News Digital learned. The president also is expected to make undisclosed economic policy announcements during the speech.\n\nThe economy is a top concern for voters as they prepare to vote for a new Congress in November, which follows Democrats' 2025 winning campaign strategy around \"affordability.\"\n\nTRUMP APPROVAL CLIMBS AS REPUBLICANS RALLY BEHIND PRESIDENT'S AFFORDABILITY AGENDA: POLL\n\nA White House official told Fox News Digital that Trump invited guests tied to the various economic initiativ"
      },
      {
        "title": "Trump's new tariff comes into effect at lower than expected rate",
        "link": "https://www.bbc.com/news/articles/cd6zn3ly22yo?at_medium=RSS&at_campaign=rss",
        "published": "Tue, 24 Feb 2026 13:02:40 GMT",
        "source": "BBC News",
        "text": "The business pays the Chinese tariff rate and he says he has not been able to invest as productively as he would want to because he's had to keep money aside in case of changes in tariff policy."
      },
      {
        "title": "Novo Nordisk to slash GLP-1 list prices by up to 50% in U.S. to cut costs for insured patients",
        "link": "https://www.cnbc.com/2026/02/24/novo-nordisk-to-slash-wegovy-ozempic-us-list-prices-by-up-to-50percent.html",
        "published": "Tue, 24 Feb 2026 13:54:15 GMT",
        "source": "Business News",
        "text": "Novo Nordisk on Tuesday said it plans to slash the monthly list prices of its popular obesity and diabetes drugs in the U.S. by up to 50% starting in 2027, in a bid to make the treatments more accessible to patients with insurance coverage.\n\nThe obesity injection Wegovy, its new pill counterpart, the diabetes shot Ozempic and the oral diabetes drug Rybelsus will have a new lower list price of $675 per month starting on Jan. 1, 2027. The Wegovy medicines both currently have list prices of around $1,350 per month, while the diabetes drugs have list prices of around $1,027 per month.\n\nFor the first time, Novo said its price cuts are targeting insured patients whose out-of-pocket costs are linked to list prices, such as people with high-deductible health plans or co-insurance benefit designs. The Danish drugmaker has previously cut the direct-to-consumer prices of Wegovy and Ozempic, which primarily benefit cash-paying patients who often don't have insurance coverage for the drugs.\n\nThe move could help Novo stay more competitive with Eli Lilly , which now holds the majority share in the blockbuster GLP-1 market. Lilly's more effective drugs and earlier foray into the direct-to-consumer space have allowed it to take the lead in the space, but the company has yet to significantly lower the U.S. list prices of its medicines.\n\n\"Private and public payers, as well as patients, want access and have been calling for lower list prices,\" Jamey Millar, Novo Nordisk's head of U.S. operations, said in a statement. \"Our actions today answer that call and remove cost barriers so the value of Wegovy and Ozempic can be realized by more patients.\""
      },
      {
        "title": "Labor secretary’s spouse not charged but remains banned from agency",
        "link": "https://www.washingtonpost.com/business/2026/02/24/labor-secretary-husband-sexual-assault-allegations/",
        "published": "Tue, 24 Feb 2026 11:00:00 +0000",
        "source": "Business",
        "text": "A local police investigation of a report that Labor Secretary Lori Chavez-DeRemer’s husband sexually assaulted a female staffer has been closed after police found no evidence of a crime. But Shawn DeRemer remains banned from the Labor Department’s headquarters in Washington, D.C., amid an inquiry by the office of the department’s inspector general.\n\nThree female Labor Department staffers, all political appointees, have complained internally at the agency that DeRemer touched them inappropriately, according to two people familiar with the matter.\n\nDeRemer, an Oregon anesthesiologist, is still banned from the Labor Department because the women have maintained their accusations, said one of the people, who was not authorized to speak to the media and spoke on the condition of anonymity. The New York Times first reported DeRemer’s ban from the building.\n\nIt has not been previously reported that three women made the accusations and all are political appointees. Political appointees are named by the president, but The Washington Post could not confirm whether President Donald Trump had appointed all three women.\n\nDeRemer has been blocked from entering the Labor Department’s Washington headquarters since Jan. 27. The agency’s solicitor banned him after the inspector general’s office recommended doing so in accordance with agency protocol for protecting employees, according to one of the people familiar with the investigation.\n\nThe allegations against DeRemer came to light amid an ongoing investigation by the Labor Department’s inspector general of Chavez-DeRemer, according to a different person familiar with the matter who spoke on the condition of anonymity to share confidential conversations with reporters. The inspector general is investigating complaints that she misused public funds for personal travel and had an inappropriate relationship with a member of her security team since joining Trump’s cabinet last March. Ask The Post AIDive deeper\n\nDeRemer has denied all se"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nGold prices fell off a three-week high as the dollar rose to a one-month high. Home Depot topped earnings estimates for the first time in a year, despite a 4% quarterly sales decline. The company attributed the decline to a sluggish real estate market and selective spending by homeowners. US equity futures were cautiously higher ahead of Tuesday's opening bell, stabilizing after losses fueled by tariff uncertainties. \n\n## Market & Business Implications\n* Home Depot posted a 4% quarterly sales decline, but topped Wall Street's revenue and earnings expectations, according to Article 2.\n* The company expects full-year total sales growth to range between 2.5% and 4.5%, and adjusted earnings per share to be between roughly flat and up 4% from $14.69 in the prior fiscal year, as stated in Article 2.\n* Shares of RingCentral and Five9 surged after earnings alleviated concerns that artificial intelligence is eating away at their business models, as reported in Article 4.\n\n## Beginner-Friendly Summary\nGold prices went down. A company called Home Depot did better than expected, even though they sold less stuff than before. This happened because people are not buying or selling houses as much, and they are being careful with their money. The stock market was a little more stable after some uncertain times.",
    "articles": [
      {
        "title": "Gold Falls Off a Three-Week High as the Dollar and Equities Rise",
        "link": "https://finance.yahoo.com/news/gold-falls-off-three-week-140434876.html?.tsrc=rss",
        "published": "Tue, 24 Feb 2026 14:04:34 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "Gold prices eased early Tuesday, falling off a three-week high as the dollar rose to a one-month hig\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      },
      {
        "title": "Home Depot tops earnings estimates for the first time in a year as demand for projects remains muted",
        "link": "https://www.cnbc.com/2026/02/24/home-depot-hd-q4-2025-earnings-.html",
        "published": "Tue, 24 Feb 2026 14:01:55 GMT",
        "source": "Earnings",
        "text": "Home Depot on Tuesday posted a roughly 4% quarterly sales decline, as a sluggish real estate market and selective spending by homeowners continued to weigh on home improvement demand.\n\nThe company also stuck by the current fiscal year forecast that it shared in December at an investor day. It said it expects full-year total sales growth to range between about 2.5% and 4.5% and adjusted earnings per share to be between roughly flat and up 4% from $14.69 in the prior fiscal year. It expects full-year comparable sales growth, which takes out one-time factors like store openings and closures, to range from flat to up 2%.\n\nDespite the fourth-quarter sales decline, Home Depot topped Wall Street's revenue and earnings expectations for that period.\n\nIn an interview with CNBC, Chief Financial Officer Richard McPhail said U.S. consumers and the company have \"been in a frozen housing environment for three years\" – and there hasn't been a meaningful thaw.\n\n\"What we've seen as an added pressure during the last year has been this increase in consumer uncertainty, a gradual decline in consumer confidence,\" he said. \"And so those are signs we're watching.\"\n\nHe said customers have told the company that they are concerned about housing affordability and job losses, dynamics that colored Home Depot's outlook for the year.\n\nHere's what Home Depot reported for the fiscal fourth quarter of 2025 compared with Wall Street's estimates, according to a survey of analysts by LSEG:\n\nEarnings per share : $2.72 adjusted vs. $2.54 expected\n\n: $2.72 adjusted vs. $2.54 expected Revenue: $38.20 billion vs. $38.12 billion expected\n\nShares rose about 3% in premarket trading on Tuesday, as Home Depot beat earnings expectations after missing estimates three quarters in a row.\n\nHigher interest rates, lower housing turnover and economic uncertainty have challenged the company, as homeowners delay the pricier projects typically spurred by buying or selling a home.\n\nAs the Atlanta-based retailer waits for bu"
      },
      {
        "title": "Wall Street Consolidates After Losses Fueled by Tariff Uncertainties as US Equity Futures Post Narrow Gains Pre-Bell",
        "link": "https://finance.yahoo.com/news/wall-street-consolidates-losses-fueled-135926023.html?.tsrc=rss",
        "published": "Tue, 24 Feb 2026 13:59:26 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "US equity futures were cautiously higher ahead of Tuesday's opening bell, stabilizing following loss\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      },
      {
        "title": "Beaten-down software stocks RingCentral and Five9 rally as earnings quell some AI concerns",
        "link": "https://www.cnbc.com/2026/02/20/ringcentral-ring-five9-fivn-rally-ai-sell-off.html",
        "published": "Fri, 20 Feb 2026 23:39:30 GMT",
        "source": "Earnings",
        "text": "Shares of RingCentral and Five9 surged on Friday after earnings from both software firms alleviated recent fears that artificial intelligence is eating away at their business models.\n\nRingCentral popped 34%, while Five9 rallied about 12% after topping Wall Street's estimates and issuing upbeat guidance. Both companies, which provide customer service solutions like voice integration, said accelerating AI adoption has boosted demand.\n\nNew AI tools, capable of building apps and websites in a matter of minutes, have spooked investors in recent weeks, leading to a massive selloff across the software sector.\n\nThe worry is that these products, emerging from the likes of Anthropic and OpenAI, will displace the software-as-a-service industry's longstanding business models as firms lean on quicker and more efficient AI tools.\n\nSo far this year, the iShares Expanded Tech-Software Sector ETF tracking the sector has plunged about 23%, led to the downside by Atlassian , Unity Software and Rapid7 , which have shed more than half their value.\n\nSoftware giants Salesforce and Microsoft have dropped 30% and 18%, respectively."
      },
      {
        "title": "Exchange-Traded Funds Mixed, Equity Futures Higher Pre-Bell Tuesday Amid AI Disruption Fears",
        "link": "https://finance.yahoo.com/news/exchange-traded-funds-mixed-equity-135252418.html?.tsrc=rss",
        "published": "Tue, 24 Feb 2026 13:52:52 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The broad market exchange-traded fund SPDR S&P 500 ETF Trust (SPY) was down 0.02% and the actively t\n\nUpgrade to read this MT Newswires article and get so much more.\n\nA Silver or Gold subscription plan is required to access premium news articles."
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nA solo Bitcoin miner has earned a block reward of over $200,000 using rented hashrate. Meanwhile, Solana-based DeFi project Step Finance is shutting down after a $29 million hack. Ethereum co-founder Vitalik Buterin has sold 17,000 ETH in one month, and the Ethereum network is set to undergo an upgrade that prioritizes censorship resistance. The stablecoin supply has stagnated, presenting a headwind for Bitcoin prices.\n\n## Market & Business Implications\n* A solo Bitcoin miner has earned a block reward of 3.125 Bitcoin (BTC) worth about $200,000 at current prices, using on-demand hashrate and spending about $75 to rent computing power (Article 1).\n* Solana-based DeFi project Step Finance is shutting down after a $29 million hack, and the project is working on a buyback for STEP holders and a redemption process for Remora rToken holders (Article 2).\n* Vitalik Buterin has reduced his Ether balance by about 17,000 ETH in one month, with the ETH sales routed via decentralized exchange (DEX) aggregator CoW Protocol (Article 3).\n* The Ethereum network is set to undergo an upgrade that includes FOCIL (Fork-Choice-Enforced Inclusion Lists as EIP-7805), which prioritizes censorship resistance (Article 4).\n* The stablecoin supply has fallen by $5.6 billion year-to-date, from $159 billion on Jan. 1, to $153.4 billion on Tuesday, according to analytics platform CryptoQuant (Article 5).\n\n## Beginner-Friendly Summary\nSomeone who mines Bitcoin on their own has won a big prize of over $200,000. A project called Step Finance on the Solana network is closing down because it was hacked and lost a lot of money. The person who helped create Ethereum, Vitalik Buterin, has sold some of his Ethereum coins. The Ethereum network is getting an update that will help keep it free and open. The supply of special coins called stablecoins has not been growing, which might affect the price of Bitcoin.",
    "articles": [
      {
        "title": "Solo Bitcoin miner bags over $200K block reward using rented hashrate",
        "link": "https://cointelegraph.com/news/solo-bitcoin-miner-rare-btc-jackpot-rented-hashrate?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 24 Feb 2026 14:03:05 +0000",
        "source": "Cointelegraph.com News",
        "text": "A solo Bitcoin miner notched a rare win by validating an entire Bitcoin block, securing a huge payday using a hobby-level mining operation and on-demand hashrate.\n\nThe miner earned the 3.125 Bitcoin (BTC) block reward, worth about $200,000 at current prices, after successfully mining block 938092, according to blockchain data and a post from Bitcoin mining firm Braiins.\n\nBraiins said the miner relied on on-demand hashrate, spending about 119,000 satoshis, about $75 at the time, to rent 1 petahash per second of computing power and paying a small solo-mining fee in the process. The miner used CKPool, a service that lets individual miners work independently while using a pool server to broadcast work and submit solutions, the company said.\n\nWhile validating an entire block as a solo Bitcoin miner is rare, even a sub-$100 investment in on-demand hashrate can lead to a lucky payday. On-demand hashrate is a cloud-based approach that allows would-be miners to rent computing power to mine cryptocurrencies without owning the hardware.\n\nBitcoin block 938092, validated by a solo miner with rented hash power. Source: Mempool.space\n\nThe miner successfully validated Bitcoin block “938092” around 8:04 a.m. UTC on Tuesday, according to blockchain data from Mempool.space.\n\nRelated: Lone Bitcoin miner wins block using tiny, cheap rig — ‘1 in a million chance’\n\nSolo wins remain statistically rare\n\nWhile validating a block as a solo miner is a rare occurrence, 21 Bitcoin miners have managed the feat over the past year, cashing in a total of 66 BTC, worth $4.1 million at current prices. This marks a 17% increase in solo blocks found during the past year, according to solo miner data aggregator Bennet.\n\nSolo Bitcoin mining block stats. Source: Bennet.org\n\nData shows that a solo block is mined at an average interval of 17.2 days.\n\nRelated: How 5 solo Bitcoin miners cashed in over $350K each in 2025\n\nBitcoin mining industry recovers from US winter storms\n\nBitcoin mining difficulty climbed "
      },
      {
        "title": "Solana DeFi Project Step Finance to Wind Down Weeks After $29M Hack",
        "link": "https://decrypt.co/358970/solana-defi-project-step-finance-to-wind-down-weeks-after-29m-hack",
        "published": "Tue, 24 Feb 2026 14:01:51 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Solana-based DeFi projects Step Finance, SolanaFloor and Remora Markets are shutting down their services, Step Finance announced Tuesday.\n\nA January hack drained 261,854 SOL, worth some $29 million, triggering a 96% collapse in STEP token value.\n\nThe closure follows other high-profile DeFi shutdowns.\n\nSolana-based DeFi projects Step Finance, SolanaFloor and Remora Markets will be winding down operations, according to a Tuesday tweet by Step.\n\n“Following the hack at the end of January we explored every possible path forward, including financing and acquisition opportunities. Unfortunately, we were unable to secure a viable outcome and have made the difficult decision to end all operations effective immediately,” the project said.\n\nToday we are announcing that Step Finance, SolanaFloor, and Remora Markets will be winding down all operations. Following the hack at the end of January we explored every possible path forward, including financing and acquisition opportunities. Unfortunately, we were unable to… — Step☀️ (@StepFinance_) February 23, 2026\n\n“We are working on a buyback for STEP holders based on a snapshot prior to the incident, and a redemption process for Remora rToken holders. Remora tokens remain backed 1:1. We are deeply grateful to our community for the support over the years and are confident that this is the best outcome given the circumstances. We want to thank our millions of customers over the years for joining us on this journey.”\n\nWhat is Step Finance?\n\nFounded in 2021, Step Finance is a Solana-based decentralized finance portfolio manager. The project later expanded to launch SolanaFloor, a news outlet focused on the Solana ecosystem, and Remora Markets, a tokenized stock marketplace.\n\nAt the end of January, the project’s treasury wallets were breached, with 261,854 SOL, worth approximately $28.9 million at the time, withdrawn after stake authorization was transfe"
      },
      {
        "title": "Vitalik sells 17K ETH in one month after earmarking $45M for privacy",
        "link": "https://cointelegraph.com/news/vitalik-buterin-reduces-eth-balance-17k-after-45m-privacy-pledge?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 24 Feb 2026 13:31:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "Ethereum co-founder Vitalik Buterin has reduced his Ether balance by about 17,000 ETH in one month after announcing plans to earmark $45 million worth of tokens for privacy projects.\n\nButerin’s wallets tracked by Arkham held about 241,000 Ether (ETH) in early February, before a series of outflows reduced the combined balance to 224,000 ETH on Tuesday.\n\nThe reduction comes amid continued selling by Buterin, including about 2,961 Ether worth $6.6 million over a three-day period earlier in the month. Onchain analysts reported that this accelerated recently as he sold $7 million worth of tokens in the past three days.\n\nButerin’s ETH balance declines since February. Source: Arkham\n\nArkham Intelligence data shows the ETH sales were routed via decentralized exchange (DEX) aggregator CoW Protocol using numerous smaller swaps instead of one large transaction, a method typically employed to minimize market impact.\n\nRelated: Wall Street boosts Bitmine stakes as DeFi lenders buckle on liquidity: Finance Redefined\n\nButerin commits $45 million to privacy initiatives\n\nThe ETH sell-off came after Buterin revealed in January that he had set aside 16,384 Ether, about $45 million, from his personal holdings to fund privacy-preserving technologies, open hardware and secure, verifiable software systems. He said the capital would be deployed gradually over the coming years as part of a broader push for open-source and self-sovereign tools.\n\nButerin described the effort as aligned with the Ethereum Foundation entering a period of “mild austerity,” while maintaining its technical roadmap. He added he would personally take on initiatives that might otherwise be handled by the foundation, focusing on building a full open-source software and hardware stack to protect both digital and real-world environments.\n\n“Specifically, we are seeking the existence of an open-source, secure and verifiable full stack of software and hardware that can protect both our personal lives and our public environme"
      },
      {
        "title": "Morning Minute: Ethereum's Next Upgrade Features Censorship Resistance",
        "link": "https://decrypt.co/358964/morning-minute-ethereums-next-upgrade-features-censorship-resistance",
        "published": "Tue, 24 Feb 2026 13:38:00 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors fall another 4%; BTC at 63k\n\nZachXBT teases major expose of a top revenue crypto protocol for inside trading\n\nTerraforms Labs sues Jane Street for driving the Luna collapse\n\nWLFI claims a coordinated attack led to USD1 briefly depegging\n\nCrypto dot com receives conditional approval from OCC for bank charter\n\n🔹 Ethereum Is Hardcoding Censorship Resistance Into the Protocol\n\nThe latest Ethereum upgrade has been announced, with a very interesting core focus.\n\n📌 What Happened\n\nEthereum developers confirmed FOCIL (Fork-Choice-Enforced Inclusion Lists as EIP-7805) for the Hegota network upgrade, targeted for H2 2026.\n\nThe decision came at the Feb 19 All Core Devs call, backed by Vitalik Buterin.\n\nIt works like this: every block, 17 validators are randomly selected to submit inclusion lists of valid transactions they’ve seen and block producers must include those transactions or risk their block getting rejected by the network. Thus no single validator controls the list and no single validator can censor it.\n\nFOCIL ships alongside EIP-8141, which makes smart contract wallets, multisigs, quantum-resistant wallets, and privacy tools a core part of Ethereum.\n\n🗣️ What They’re Saying\n\nVitalik Buterin called FOCIL the foundation of a “cypherpunk principled non-ugly Ethereum,” describing it as a return to the original ethos of the network.\n\n“ETH devs, I love you. You mean well. But when you create an EIP to solve the problem of 'filtering out transactions with sanctioned addresses' and your solution is 'to allow validators to impose constraints on builders by force-including transactions in their blocks'... we have a problem, a big problem. And if you don't see it, y"
      },
      {
        "title": "Stablecoin stagnation, tariffs a headwind for Bitcoin prices, analysts say",
        "link": "https://cointelegraph.com/news/stablecoin-supply-falls-crypto-liquidity-headwind-gold-rotation-xaut?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Tue, 24 Feb 2026 12:45:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "Shrinking crypto market liquidity is a concerning sign for crypto asset valuations, as investors gravitate towards safe-haven assets like precious metals amid growing global trade uncertainty.\n\nThe stagnating stablecoin supply is presenting a “notable headwind” for Bitcoin (BTC) and the broader crypto ecosystem, according to Matrixport. “Stablecoins serve as the primary liquidity rail within digital assets and stagnation in supply often signals that capital is being off-ramped back into fiat rather than redeployed within crypto markets,” said the digital asset platform in a Tuesday X post.\n\nThe stablecoin supply has fallen by $5.6 billion year-to-date, from $159 billion on Jan. 1, to $153.4 billon on Tuesday, according to analytics platform CryptoQuant. Stablecoin reserves on the leading crypto exchange, Binance, also shrank by 19% since November 2025, Cointelegraph reported earlier on Tuesday.\n\nAll ERC-20 stablecoins, total supply, year-to-date chart. Source: CryptoQuant\n\nBitcoin no longer trading like “digital gold,” says CryptoQuant CEO\n\nBitcoin also appears to be decoupling from gold in the short term. BTC’s 90-day Pearson correlation with gold has turned negative, falling near -0.75, according to analytics platform CryptoQuant.\n\nThe Pearson correlation measures how closely the returns of Bitcoin and gold move together at a given period, with a -1 marking a perfect negative correlation.\n\n“Bitcoin is in a ‘not digital gold’ period,” said Ki Young Yu, the founder and CEO of CryptoQuant, in a Tuesday X post.\n\nTariff uncertainty, precious metal rotation are thinning crypto liquidity: analyst\n\nThe backdrop has been complicated by renewed tariff uncertainty. On Saturday, US President Donald Trump announced a global tariff plan that has fueled uncertainty, with a 10% rate taking effect while an increase to 15% has been discussed.\n\nRelated: Tether USDT supply set for biggest monthly decline since 2022 FTX collapse\n\nThe renewed geopolitical concerns are accelerating the "
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-24T14:12:35.640781+00:00"
  }
}