{
  "Tech": {
    "summary": "## Executive Summary\nGoogle has received conditional approval to operate Google Maps fully in South Korea, allowing for features like turn-by-turn navigation and detailed business listings. TCL has released a new flagship TV, the X11L, which boasts vibrant colors and incredible blooming control. Researchers have discovered a new attack, called AirSnitch, that can bypass Wi-Fi encryption in homes, offices, and enterprises. Aventon has released a new electric bike, the Soltera 3, which features a belt-drive system and hydraulic disc brakes. \n\n## Market & Business Implications\n* Google has received conditional approval to export high-precision geographic information out of South Korea, allowing for full Google Maps services in the country (Article 1).\n* TCL's new flagship TV, the X11L, uses an evolution of mini-LED technology and competes with flagships from other major TV manufacturers (Article 2).\n* Researchers have discovered a new attack, called AirSnitch, that can bypass Wi-Fi encryption in homes, offices, and enterprises, affecting a broad range of routers (Article 4).\n* Aventon's Soltera 3 electric bike features a belt-drive system and hydraulic disc brakes, offering a low-maintenance and smooth ride (Article 5).\n\n## Beginner-Friendly Summary\nGoogle can now provide a full version of Google Maps in South Korea. A company called TCL made a new, very good TV with nice colors. Some researchers found a way to get around the security on home and office internet connections. A company called Aventon made a new electric bike that is easy to take care of and fun to ride.",
    "articles": [
      {
        "title": "South Korea opens the door to let Google Maps operate fully",
        "link": "https://techcrunch.com/2026/02/27/south-korea-opens-the-door-to-let-google-maps-operate-fully/",
        "published": "Fri, 27 Feb 2026 13:12:40 +0000",
        "source": "TechCrunch",
        "text": "After years of appeals, Google has finally received conditional approval to export high-precision geographic information out of South Korea, a move that opens the door to let the company provide proper Google Maps services in the country, such as walking and real-time driving directions.\n\nThe move reverses a long-standing policy on data restrictions that had essentially made Google Maps and Apple Maps non-functional in the country. Google has so far provided maps services in South Korea using high-resolution, 1:5,000 scale map data, but without the ability to export that data to its servers, the company couldn’t offer features like turn-by-turn navigation or detailed listings for businesses.\n\nSouth Korea has resisted Google’s appeals since 2011, arguing that the company’s precise satellite maps could endanger national security by exposing sensitive military sites when combined with commercial imagery and online data. Given that South Korea remains technically at war with North Korea, the government is cautious about exposing such locations, and had until now demanded Google set up a data center in the country and obscure sensitive locations.\n\nThe green light comes with strict rules designed to protect sensitive military and infrastructure sites. The South Korean government will verify compliance before any data leaves the country; any images of South Korean territory used in Google Maps and Google Earth must comply with national security regulations; and historical imagery in Google Earth and Street View must obscure sensitive military sites. Google is also required to either remove or limit coordinate data for South Korean locations, and only essential data for navigation and routing can be exported.\n\nThe government also requires all data processing to be done on servers operated by Google’s local partners. Sensitive topographic and military data remain off-limits, and any updates to military or security sites must be carried out promptly on domestic servers at the"
      },
      {
        "title": "TCL&#8217;s $7,000+ flagship TV is ready to fight",
        "link": "https://www.theverge.com/tech/884981/tcl-x11l-sqd-mini-led-tv-review",
        "published": "2026-02-27T09:00:00-05:00",
        "source": "The Verge",
        "text": "is a senior reviewer covering TVs and audio. He has over 20 years experience in AV, and has previously been on staff at Digital Trends and Reviewed.\n\nSince I saw the TCL X11L SQD-Mini LED TV at a pre-CES event in December, I’ve been eager to get a close look at it in my living room. At first glance, the TV impressed me enough that I named it the best TV of CES 2026.\n\nFrom the moment I completed Google TV setup and started watching the TCL X11L I was amazed. I could immediately tell it’s the brightest TV I’ve had in my home, but it was the color vibrancy that I found most impressive. The colors we’re all most familiar with — skin tones, the sky, green grass and trees — all look as close to realistic as I’ve seen on a TV. And with the color vibrancy it looks staggeringly good.\n\nIt’s a flagship TV unlike any other that TCL has made, with vibrant colors and incredible blooming control. It competes with flagships from all the major TV manufacturers — including the Sony Bravia 9, LG G5, and Samsung S95F — and it gets brighter than any of them. But it’s also expensive, with the 75-inch model I tested going for $7,000, and the 85- and 98-inch versions for $8,000 and $10,000, respectively. And with a bunch of RGB LED TVs on the way this year, for likely comparable prices, you might want to wait before committing to the X11L.\n\nWhile the TV industry leans into RGB LED — and TCL is too, on other TVs — TCL’s flagship instead uses an evolution of mini-LED technology. The X11L uses blue LEDs for its backlight with super quantum dots (hence the SQD) and an upgraded color filter that together provide the widest gamut coverage we’ve ever seen from a mini-LED TV. Both technologies should have similar light output and color performance, although the individual red, green, and blue LED backlights of RGB LEDs could deliver more accurate colors — or they could have visible color crosstalk issues. We won’t know until RGB LED TVs are more readily available. What we do know is that mini-LED "
      },
      {
        "title": "Show HN: RetroTick – Run classic Windows EXEs in the browser",
        "link": "https://retrotick.com/",
        "published": "Fri, 27 Feb 2026 13:06:50 +0000",
        "source": "Hacker News: Front Page",
        "text": ""
      },
      {
        "title": "New AirSnitch attack bypasses Wi-Fi encryption in homes, offices, and enterprises",
        "link": "https://arstechnica.com/security/2026/02/new-airsnitch-attack-breaks-wi-fi-encryption-in-homes-offices-and-enterprises/",
        "published": "Thu, 26 Feb 2026 15:45:18 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "It’s hard to overstate the role that Wi-Fi plays in virtually every facet of life. The organization that shepherds the wireless protocol says that more than 48 billion Wi-Fi-enabled devices have shipped since it debuted in the late 1990s. One estimate pegs the number of individual users at 6 billion, roughly 70 percent of the world’s population.\n\nDespite the dependence and the immeasurable amount of sensitive data flowing through Wi-Fi transmissions, the history of the protocol has been littered with security landmines stemming both from the inherited confidentiality weaknesses of its networking predecessor, Ethernet (it was once possible for anyone on a network to read and modify the traffic sent to anyone else), and the ability for anyone nearby to receive the radio signals Wi-Fi relies on.\n\nGhost in the machine\n\nIn the early days, public Wi-Fi networks often resembled the Wild West, where ARP spoofing attacks that allowed renegade users to read other users’ traffic were common. The solution was to build cryptographic protections that prevented nearby parties—whether an authorized user on the network or someone near the AP (access point)—from reading or tampering with the traffic of any other user.\n\nNew research shows that behaviors that occur at the very lowest levels of the network stack make encryption—in any form, not just those that have been broken in the past—incapable of providing client isolation, an encryption-enabled protection promised by all router makers, that is intended to block direct communication between two or more connected clients.\n\nThe isolation can effectively be nullified through AirSnitch, the name the researchers gave to a series of attacks that capitalize on the newly discovered weaknesses. Various forms of AirSnitch work across a broad range of routers, including those from Netgear, D-Link, Ubiquiti, Cisco, and those running DD-WRT and OpenWrt."
      },
      {
        "title": "Aventon Soltera 3 Electric Bike Review: A Fun Hybrid Single-Speed",
        "link": "https://www.wired.com/review/aventon-soltera-3-electric-bike/",
        "published": "Fri, 27 Feb 2026 12:30:00 +0000",
        "source": "WIRED",
        "text": "Belt-drive bikes offer some huge upsides. First, they usually require less maintenance, with many belts often lasting twice as long as a typical chain. Second, there’s no grease to speak of, and therefore, no black smudges on your work pants. Third, in the case of the Soltera 3, the belt comes from the Gates brand, whose drivetrain belts are as good as it gets. Belt-drive bikes are silent and often smoother than their chain-driven counterparts.\n\nThat said, the inclusion of a low-maintenance element such as a belt drive paired with hydraulic disc brakes, which require bleeding roughly every year, struck me as an odd choice. If Aventon wanted to make the Soltera 3 as hands-off as possible, cable-actuated brakes would have been a more intuitive choice.\n\nThe other thing that immediately jumps out about the Soltera 3 is its relatively light weight. At 37 pounds, the Soltera 3 is heavy for an analog bike. But it’s certainly not heavy for an ebike, and it’s nearly as stiff, nimble, and navigable as a conventional bicycle. One issue I’ve always had with ebikes is their heft. Given that they’re often made to replace a car, they’re built with load bearing in mind. Also, ebike batteries are heavy.\n\nAdding to that sense of “this is just like my other bikes,” the Soltera 3 simply looks cool, which is often not the case when it comes to ebikes. The matte black my tester bike arrived in looks cool because matte black almost never doesn’t look cool. (Additionally, the Soltera 3 is available in dark matte blue and a sleek silver.) But beyond the finish, the bike’s geometry; its wide, almost perfectly flat handlebars; and its narrow (by ebike standards) 700 x 36 tires make it feel closer in DNA to a road bike than a traditional ebike.\n\nButton Press\n\nPhotograph: Michael Venutolo-Mantovani\n\nI’m 6′4′′, and the extra large Soltera 3 that I tested was at a maximum saddle height. It was suitable for me, but I couldn’t recommend anyone bigger than me riding the Soltera 3. That said, with fo"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nJack Dorsey's company Block is cutting over 4,000 employees, citing AI as a driving factor. Anthropic, an AI company, has refused the Pentagon's demands for unrestricted access to its AI systems, citing concerns over mass surveillance and lethal autonomous weapons. Meanwhile, new AI-powered technologies are emerging, such as Huxe, which provides personalized daily audio summaries, and Nano Banana 2, Google's updated AI image generator. These developments highlight the growing presence of AI in various industries. \n\n## Market & Business Implications\n* Block is cutting its workforce by nearly half, from over 10,000 to under 6,000 employees, due to AI-driven changes (Article 1).\n* Anthropic has refused to give the Pentagon unrestricted access to its AI systems, citing concerns over mass surveillance and lethal autonomous weapons (Article 3).\n* Huxe is a new AI-powered app that provides personalized daily audio summaries, drawing information from users' emails and calendar entries (Article 2).\n* Google has released Nano Banana 2, an updated version of its AI image generator, which combines text rendering and web searching with faster image generation (Article 5).\n* Anthropic's refusal to comply with the Pentagon's demands may lead to consequences, including being labeled a supply chain risk or being forced to prioritize production under the Defense Production Act (Article 4).\n\n## Beginner-Friendly Summary\nA big company called Block is laying off a lot of employees because of changes brought by artificial intelligence. Another company called Anthropic is saying no to the military's request to use its AI technology for certain things it doesn't agree with. There are also new tools coming out that use AI to help people, like an app that summarizes your day for you and a tool that can generate pictures. These are just a few examples of how AI is becoming a bigger part of our lives.",
    "articles": [
      {
        "title": "Jack Dorsey just halved the size of Block’s employee base — and he says your company is next",
        "link": "https://techcrunch.com/2026/02/26/jack-dorsey-block-layoffs-4000-halved-employees-your-company-is-next/",
        "published": "Thu, 26 Feb 2026 23:43:32 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Jack Dorsey has long been an open admirer of Elon Musk. Now, it seems, he may have been taking notes.\n\nOn Thursday, Dorsey announced that Block, the payments company he founded that operates Square, Cash App, and Tidal, is cutting more than 4,000 employees, nearly half its global workforce, taking it from over 10,000 workers down to just under 6,000. Investors responded enthusiastically, sending the stock up more than 24% in after-hours trading.\n\nIt isn’t the first time a major tech company has done something of the sort. In November 2022, Musk slashed roughly 50% of Twitter’s staff in a single stroke after taking the company private, a move that rattled many in Silicon Valley and rewrote the unofficial rules for how far a CEO could go in one shot.\n\nDorsey was in an unusual position to watch it unfold. He’d rolled his roughly 2.4% ownership stake in Twitter into Musk’s takeover rather than taking a cash payout, making him one of the largest outside investors in what became X.\n\nThe two men have had one of tech’s stranger relationships, with warm words giving way to public shots, then back again. Dorsey championed Musk’s Twitter acquisition, then said Musk “should have walked away.” He helped launch Bluesky, the decentralized Twitter alternative, then quit its board and called X “freedom technology.” Both are also vocal Bitcoin advocates — Block and Tesla each carry the cryptocurrency on their balance sheets.\n\nDorsey framed Thursday’s cuts as a proactive, even empathetic, choice, and not a financial emergency. (The 4,000 people losing their jobs may see it differently.) “Repeated rounds of cuts are destructive to morale, to focus, and to the trust that customers and shareholders place in our ability to lead,” he wrote on X. He predicted that within a year, most companies will arrive at the same place. “I’d rather get there honestly and on our own terms than be forced into it reactively,” he said.\n\nThe cuts are being driven, at least officially, by AI. Block CFO Amrita"
      },
      {
        "title": "Huxe Will Give You a Personalized, Daily Audio Summary Powered by AI",
        "link": "https://www.wired.com/story/huxe-personalized-daily-audio-podcasts-powered-by-ai/",
        "published": "Fri, 27 Feb 2026 12:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "The new wave of AI-powered technologies have almost entirely taken over the apps and digital services we use every day, from photo editors to fitness trackers. There's even a notable AI app available for podcasts too. It’s called Huxe.\n\nAt the core of Huxe is a daily brief, a sort of personal productivity podcast tailored to your tastes and requirements, generated from the sources you pick. Connect up your calendar and email account, and every morning you get a quick audio summary to get you set for the day. The idea is that a 15-minute audio podcast can replace the much longer amount of time you'd otherwise spend trying to figure out what's happening with your inbox and your schedule.\n\nThe audio emphasis of Huxe is no surprise, as the team behind the app previously worked on Google NotebookLM, a research tool that has its own podcast-style Audio Overviews feature. Huxe is similar, but it draws information from your emails and calendar entries.\n\nThere's more to Huxe as well, including audio deep dives on any topic of your choice, as well as news summaries. The app is completely free to use right now, and you can sign up through the apps for Android or iOS.\n\nGetting Started\n\n***01-interests.jpg\n\nRegistering interests with Huxe.\n\n(David Nield)\n\nTo start taking advantage of Huxe’s personalized audio production powers, you need to tell it a little bit about yourself. As you work through the setup process, which includes supplying an email address and your name, you'll be prompted to connect your email and calendar accounts. (Google and Outlook accounts are both supported.)\n\nYou'll also be asked to choose a few topics that you're interested in from a list, generated by what's in your inbox and on your schedule—click Edit to make changes, and Add to add interests that Huxe hasn't picked up on yet. You can specify pretty much any topic you like, and Huxe will understand what you mean.\n\nWhen you get into the app proper, you are introduced to what are called livecasts, which"
      },
      {
        "title": "Anthropic refuses Pentagon’s new terms, standing firm on lethal autonomous weapons and mass surveillance",
        "link": "https://www.theverge.com/news/885773/anthropic-department-of-defense-dod-pentagon-refusal-terms-hegseth-dario-amodei",
        "published": "2026-02-26T18:22:44-05:00",
        "source": "AI | The Verge",
        "text": "is The Verge’s senior AI reporter. An AI beat reporter for more than five years, her work has also appeared in CNBC, MIT Technology Review, Wired UK, and other outlets.\n\nLess than 24 hours before the deadline in an ultimatum issued by the Pentagon, Anthropic has refused the Department of Defense’s demands for unrestricted access to its AI.\n\nIt’s the culmination of a dramatic exchange of public statements, social media posts, and behind-the-scenes negotiations, coming down to Defense Secretary Pete Hegseth’s desire to renegotiate all AI labs’ current contracts with the military. But Anthropic, so far, has refused to back down from its two current red lines: no mass surveillance of Americans, and no lethal autonomous weapons (or weapons with license to kill targets with no human oversight whatsoever). OpenAI and xAI had reportedly already agreed to the new terms, while Anthropic’s refusal had led to CEO Dario Amodei being summoned to the White House this week for a meeting with Hegseth himself, in which the Secretary reportedly issued an ultimatum to the CEO to back down by the end of business day on Friday or else.\n\nIn a statement late Thursday, Amodei wrote, “I believe deeply in the existential importance of using AI to defend the United States and other democracies, and to defeat our autocratic adversaries. Anthropic has therefore worked proactively to deploy our models to the Department of War and the intelligence community.”\n\nHe added that the company has “never raised objections to particular military operations nor attempted to limit use of our technology in an ad hoc manner” but that in a “narrow set of cases, we believe AI can undermine, rather than defend, democratic values” — going on to specifically mention mass domestic surveillance and fully autonomous weapons. (Amodei mentioned that “partial autonomous weapons … are vital to the defense of democracy” and that fully autonomous weapons may eventually “prove critical for our national defense,” but that “to"
      },
      {
        "title": "Anthropic CEO stands firm as Pentagon deadline looms",
        "link": "https://techcrunch.com/2026/02/26/anthropic-ceo-stands-firm-as-pentagon-deadline-looms/",
        "published": "Thu, 26 Feb 2026 23:19:06 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Anthropic CEO Dario Amodei said Thursday that he “cannot in good conscience accede to [the Pentagon’s] request” to give the military unrestricted access to its AI systems.\n\n“Anthropic understands that the Department of War, not private companies, makes military decisions,” Amodei wrote in a statement. “However, in a narrow set of cases, we believe AI can undermine, rather than defend, democratic values. Some uses are also simply outside the bounds of what today’s technology can safely and reliably do.”\n\nThe two cases are: mass surveillance of Americans and fully autonomous weapons with no human in the loop. The Pentagon believes it should be able to use Anthropic’s model for all lawful purposes, and that its uses shouldn’t be dictated by a private company.\n\nAmodei’s statement comes less than 24 hours ahead of the Friday 5:01 p.m. deadline Defense Secretary Pete Hegseth has given Anthropic to either acquiesce to his demands, or face the consequences. The Department of Defense has attempted to force Amodei’s hand by either labeling Anthropic a supply chain risk — a designation reserved for foreign adversaries — or invoke the Defense Production Act and effectively force the firm to do its bidding. The DPA gives the president the authority to force companies to prioritize or expand production for national defense.\n\nAmodei pointed out the contradiction in those two threats. “One labels us a security risk; the other labels Claude as essential to national security.”\n\nHe added that it’s the Department’s right to choose contractors most aligned with its vision, “but given the substantial value that Anthropic’s technology provides to our armed forces, we hope they reconsider.”\n\nAnthropic is currently the only frontier AI lab that has classified-ready systems for the military, though the DOD is reportedly getting xAI ready for the job.\n\nTechcrunch event Save up to $300 or 30% to TechCrunch Founder Summit 1,000+ founders and investors come together at TechCrunch Founder Summit "
      },
      {
        "title": "Hands-On With Nano Banana 2, the Latest Version of Google’s AI Image Generator",
        "link": "https://www.wired.com/story/google-nano-banana-2-ai-image-generator-hands-on/",
        "published": "Fri, 27 Feb 2026 00:01:10 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Google just debuted Nano Banana 2, an updated version of its AI image generator. It combines the abilities of Google’s previous release, Nano Banana Pro—like text rendering and web searching—with speedier image generation. This tool will be the new default in Google’s Gemini chatbot.\n\nThe first image model from Google under the Nano Banana moniker dropped last August, and the Pro version arrived three months later. The AI tool was widely adopted online to alter photos of real people, from generating custom action figures to nostalgic images of people hugging younger versions of themselves.\n\nNano Banana 2 is not only faster at crafting images, it’s also a more powerful photo editor. Despite some rough edges and unconvincing generations in my initial hands-on experience through Gemini, Google’s latest release marks the continued improvement of photorealistic AI tools that can manipulate existing images and serves as a stark reminder to always scrutinize unverified images you see online.\n\nGetting Started\n\nIf you want to try the new image model, the easiest way to access Nano Banana 2 is through the Gemini app or website. You can either click the banana emoji to generate images or just put the request in your prompts to the chatbot. This new image model is also available through Google’s Search tools, AI Studio, Cloud, and other services.\n\nGoogle says the Nano Banana 2 image generator pulls real-time information from the web, which can be useful for generating infographics. To test this, I asked Gemini to generate a custom weather report for my upcoming weekend getaway. Here’s my prompt:\n\nI'm going skiing in Dodge Ridge this weekend with some friends. Could you create an infographic that covers the weather conditions?\n\nNano Banana Pro made it easier to generate images with text—pulled from data on the web—and Nano Banana 2 makes that image generation speedier than ever. AI-GENERATED BY REECE ROGERS\n\nAt first glance, the result looks decent. No wobbly text or disfigured "
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nWalmart Inc. has received positive outlooks from several analysts, with price targets increased by firms such as Bernstein, Truist Securities, and DA Davidson. Meanwhile, wholesale prices rose 0.8% in January, exceeding expectations. Netflix has withdrawn from a bidding war for Warner Bros. Discovery, citing a lack of financial attractiveness at the required price. OpenAI has closed a $110 billion funding round with backing from major companies like Amazon, Nvidia, and SoftBank. \n\n## Market & Business Implications\n* Bernstein lifted the price target on Walmart Inc. to $134 and maintained an Outperform rating, citing the company's modest beat in the fourth quarter (Article 1).\n* The core producer price index increased 0.8% in January, exceeding the expected 0.3% gain, according to the Bureau of Labor Statistics (Article 2).\n* Netflix co-CEOs Ted Sarandos and Greg Peters stated that the company is declining to match Paramount Skydance's bid for Warner Bros. Discovery due to the price no longer being financially attractive (Article 3).\n* OpenAI has closed a $110 billion funding round with investments from Amazon, Nvidia, and SoftBank, and has announced a multi-year strategic partnership with Amazon (Article 5).\n\n## Beginner-Friendly Summary\nSome big companies are doing well. Walmart is one of them, and some experts think it will keep doing well. Prices for things like food and other goods went up more than expected in January. Netflix was trying to buy another company, but it decided not to because the price was too high. A company called OpenAI got a lot of money from other big companies like Amazon, and they are going to work together.",
    "articles": [
      {
        "title": "Street Optimism Builds Around Walmart Inc. (WMT)",
        "link": "https://finance.yahoo.com/news/street-optimism-builds-around-walmart-015637184.html",
        "published": "2026-02-26T01:56:37Z",
        "source": "Yahoo Finance",
        "text": "Walmart Inc. (NASDAQ:WMT) is among the best stocks in each sector in 2026. On February 20, TheFly reported that Bernstein lifted the price target on Walmart Inc. (NASDAQ:WMT) to $134, up from $129, and maintained an Outperform rating. The firm highlighted the company’s modest beat in the fourth quarter, while advising to buy the company’s shares on weakness.\n\nSeveral other analysts have revised their outlook for the company recently. Truist Securities increased the price target on Walmart Inc. (NASDAQ:WMT) from $127 to $139 and reiterated a Buy rating on February 20. The firm noted the company’s fourth-quarter performance, with U.S. comparable sales 0.1% above its forecasts. Thanks to the accelerating e-commerce profitability and expanding alternative revenue streams, every segment showcased strong growth and margin expansion. According to the firm, the company’s business model is among the real asset plays in the market and one that is highly profitable.\n\nStreet Optimism Builds Around Walmart Inc. (WMT)\n\nOn the same day, DA Davidson analyst Michael Baker said that the company’s flywheel strategy is generating market share gains, and thus the reason behind its recent performance. The firm raised the price target on Walmart Inc. (NASDAQ:WMT) to $150 from $135 and reaffirmed a Buy rating.\n\nWalmart Inc. (NASDAQ:WMT) is an Arkansas-based operator of retail and wholesale stores and clubs, eCommerce websites, and mobile apps. Incorporated in 1945, the company operates through three segments: Walmart U.S., Walmart International, and Sam’s Club.\n\nWhile we acknowledge the potential of WMT as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable St"
      },
      {
        "title": "Core wholesale prices rose 0.8% in January, much more than expected",
        "link": "https://www.cnbc.com/2026/02/27/ppi-january-2026-.html",
        "published": "Fri, 27 Feb 2026 13:55:42 GMT",
        "source": "US Top News and Analysis",
        "text": "Customers shops for fruit in a supermarket in New York on Jan. 22, 2026.\n\nWholesale prices rose at a faster-than-expected pace in January, countering hopes that inflation was easing, the Bureau of Labor Statistics reported Friday.\n\nThe core producer price index, which excludes volatile food and energy prices, increased a seasonally adjusted 0.8%, more than the 0.6% gain in December and well ahead of the Dow Jones consensus estimate for 0.3%.\n\nOn an all-items basis, headline PPI rose 0.5%, also above the forecast for 0.3% and 0.1 percentage point more than the prior month.\n\nFor the full year, core wholesale prices accelerated 3.6%, while the headline index posted a 2.9% gain. Both figures are well ahead of the Federal Reserve's 2% inflation goal and suggest that rising prices are still a factor for the U.S. economy.\n\nServices prices primarily drove the increase, with a 0.8% month increase that was the highest since July 2025. By contrast, goods prices actually fell 0.3%, though core goods prices rose 0.7%.\n\nMore than 20% of the increase in services came from margins for professional and commercial equipment wholesaling. On the goods side, energy and food prices both fell while metals prices increased 4.8%.\n\nTrade services prices surged 2.5%, helping boost pressures on wholesale inflation.\n\nThe report comes as President Donald Trump has repeatedly insisted that inflation has been tamed. Pipeline pressures as indicated by the PPI figures could keep the Fed cautious as it weighs its next moves on interest rates. Markets largely expect the Fed to stay on the sidelines until the summer, though Trump and other White House officials have pushed for lower rates.\n\nThis is breaking news. Please refresh for updates."
      },
      {
        "title": "Netflix follows Warren Buffett's playbook: Don't overpay, walk away",
        "link": "https://www.foxbusiness.com/markets/netflix-follows-warren-buffetts-playbook-dont-overpay-walk-away",
        "published": "Fri, 27 Feb 2026 08:02:43 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Warner Bros. Discovery CEO David Zaslav may have been counting on watching one last round in the Netflix vs. Paramount Skydance boxing match to acquire the media company he runs. What he might not have anticipated was that Netflix wouldn't even bother re-entering the ring.\n\nThursday after the market close, WBD announced that Paramount Skydance’s last and best offer of $31 a share for its film studio, streaming platform and cable networks was superior to Netflix’s previously accepted bid of $27.75 a share for the studio and streaming assets.\n\nWBD's declaration started a countdown clock: Netflix was granted four business days to match or beat Paramount’s new bid, but just an hour and 10 minutes later, Netflix left the arena.\n\nNETFLIX BACKS OUT OF WARNER BROS BIDDING WAR AFTER PARAMOUNT MADE 'SUPERIOR' OFFER\n\nIn a joint statement, the streamer's co-CEOs, Ted Sarandos and Greg Peters, said, \"The transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\"\n\nConsidering Sarandos’ tone in the final days of the process, the market should have been ready for the quick exit. In an interview Feb. 20 on FOX Business’ \"Claman Countdown,\" Sarandos, when pressed as to whether he'd match a potentially higher bid by Paramount Skydance, seemingly took a page out of former Berkshire Hathaway CEO Warren Buffett's \"never overpay for an asset no matter how much you want it\" playbook.\n\n\"We've been very disciplined buyers in our careers. Our shareholders know us and they expect us to continue to do what we do, which is remain a disciplined buyer,\" Sarandos told FBN.\n\nNetflix shareholders have never fully embraced the merger since the official bidding process began Nov. 20. Since then, Netflix shares have shriveled more than 19%.\n\nTicker"
      },
      {
        "title": "Jane Street Speculation Renews Scrutiny of Bitcoin ETF Market Mechanics",
        "link": "https://finance.yahoo.com/news/jane-street-speculation-renews-scrutiny-015724564.html",
        "published": "2026-02-26T01:57:24Z",
        "source": "Yahoo Finance",
        "text": "Bitcoin’s Wednesday rally has reignited debate over the role of Wall Street market makers in spot Bitcoin exchange-traded funds, after online speculation linked the price move to a lawsuit involving quantitative trading firm and liquidity provider Jane Street.\n\nPosts circulating on X claimed that Bitcoin’s roughly 10% climb over two days coincided with the disappearance of a purported intraday selling pattern, suggesting that legal action against Jane Street had altered market behaviour.\n\nAnalysts and ETF specialists, however, said the focus on a single firm obscures a more complex set of market mechanics underlying how spot Bitcoin ETFs operate.\n\nBitcoin ETFs track the asset's spot price, but the creation and redemption process allows institutional middlemen to meet demand without having to buy or sell Bitcoin on public exchanges.\n\nJeff Park, chief investment officer at ProCap and an adviser to ETF issuer Bitwise, said Wednesday the debate reflects a misunderstanding of ETF market structure rather than evidence of manipulation.\n\nIn a screenshot post on X, Park outlined how large trading firms responsible for creating and redeeming ETF shares, known as authorized participants, operate under regulatory exemptions that allow them to meet ETF demand without mechanically forcing immediate spot Bitcoin purchases.\n\nPark said those exemptions, which apply to all authorized participants, are designed to support orderly ETF market-making, but can create a “grey window” in which ETF share creation, hedging activity, and spot market transactions are not tightly linked in time.\n\nAs a result, ETF inflows do not always translate into immediate buying pressure in the spot Bitcoin market, weakening the assumption that ETF demand directly maps to spot price movements.\n\nCrypto Funds Shed $4B Across Five-Week Negative Streak\n\nRyan McMillin, chief investment officer at crypto fund manager Merkle Tree Capital, told Decrypt the structure also creates incentives that favour derivatives ov"
      },
      {
        "title": "OpenAI closes $110 billion funding round with backing from Amazon, Nvidia, Softbank",
        "link": "https://www.cnbc.com/2026/02/27/open-ai-funding-round-amazon.html",
        "published": "Fri, 27 Feb 2026 14:00:08 GMT",
        "source": "US Top News and Analysis",
        "text": "OpenAI has closed a $110 billion funding round, a financing that's more than double the size of its last raise a year ago, which was a record for a private tech company.\n\nAmazon invested $50 billion, Nvidia invested $30 billion and SoftBank invested $30 billion in the round, OpenAI said in a release on Friday. The investment boosts OpenAI to a $730 billion pre-money valuation, which marks a big jump from its $500 billion valuation in a secondary financing in October. Other investors are expected to join as the round progresses, OpenAI said.\n\n\"We're super excited about this deal,\" OpenAI CEO Sam Altman told CNBC's \"Squawk Box\" on Friday. \"AI is going to happen everywhere. It's transforming the whole economy, and the world needs a lot of collective computing power to meet the demand.\"\n\nIn addition to its participation in the funding round, Amazon announced a multi-year strategic partnership with OpenAI. The companies will develop customized models that will help power Amazon's customer-facing applications as part of the agreement, according to a release.\n\nOpenAI said it is expanding its existing $38 billion agreement with Amazon Web Services by $100 billion over the next eight years. AWS will also serve as the exclusive third-party cloud distribution provider for OpenAI's enterprise platform Frontier, which it unveiled earlier this month.\n\nThe companies said Amazon's $50 billion investment in OpenAI will start with an initial commitment of $15 billion, followed by another $35 billion \"in the coming months when certain conditions are met.\"\n\n\"It's so early right now in the AI space, and OpenAI is off to an amazing start,\" Amazon CEO Andy Jassy told CNBC's \"Squawk Box\" on Friday. \"They're going to be one of the very big winners, we believe, long term. I think we can help them quite a bit as part of this partnership.\"\n\nIn the three-plus years since launching ChatPGT, OpenAI has reshaped the technology industry and defined the era of generative artificial intelligence. But"
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nThe US and Iran have concluded their latest round of nuclear talks, with President Trump considering his military options. China has urged its citizens in Iran to evacuate. Meanwhile, the US is facing criticism over its health funding pacts with African countries, which have been labeled \"lop-sided\" and \"immoral\". A team of midlife cheerleaders in Ukraine is using their sport as a way to cope with the stress of war. The US is also negotiating bilateral health agreements with at least 17 African countries.\n\n## Market & Business Implications\n* The US and Iran have concluded their latest round of nuclear talks, with President Trump weighing his military options, as reported by NPR.\n* China has urged its citizens in Iran to evacuate, according to Reuters.\n* At least 17 African countries have signed health agreements with the US, securing $11.3bn in health aid, but raising concerns over concessions made in return, as stated in The Guardian.\n* The US requests patient record data as part of its health agreements with African countries, which has raised concerns over data privacy, as mentioned in The Guardian.\n* The Trump administration is negotiating bilateral health agreements with African countries as part of its health funding efforts, as reported in The Guardian.\n\n## Beginner-Friendly Summary\nThe US and Iran just finished talking about nuclear issues, and the US president is thinking about what to do next. China told its people in Iran to leave the country. The US is also giving money to some African countries to help with health issues, but some people think this is not a fair deal. There's a group of women in Ukraine who are doing cheerleading to feel better during a time of war. The US is making deals with African countries to help with health problems.",
    "articles": [
      {
        "title": "As U.S. and Iran wrap latest round of nuclear talks, Trump weighs his options",
        "link": "https://www.npr.org/2026/02/27/nx-s1-5727680/as-u-s-and-iran-wrap-latest-round-of-nuclear-talks-trump-weighs-his-options",
        "published": "Fri, 27 Feb 2026 06:39:31 -0500",
        "source": "NPR Topics: World",
        "text": "As U.S. and Iran wrap latest round of nuclear talks, Trump weighs his options President Trump weighs his military options in Iran as his administration continues negotiating over Tehran's nuclear program.\n\nWorld As U.S. and Iran wrap latest round of nuclear talks, Trump weighs his options As U.S. and Iran wrap latest round of nuclear talks, Trump weighs his options Listen · 3:40 3:40 President Trump weighs his military options in Iran as his administration continues negotiating over Tehran's nuclear program. Sponsor Message Sponsor Message"
      },
      {
        "title": "China urges citizens in Iran to evacuate, Xinhua reports - Reuters",
        "link": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPc2RCXzBhUGN6bVJ3X05BV09IbDl6UXNCdUlFcUJGNkk2bXp3MlZiWWdTU19MT19sRzFkSFVMSWpyVFhPVmUtMjhCckhpeE1qRkNPeEdlM2lPc3Vzb19jcDhvN0FXYllMWHJQQ1lPWFBjZW03aFFTU2JCd2VlLVlHVXdCbEFRRWZVa2RuZHFfRmNJcmhiY3VkOS1VOUVueVE3LVZ3cWxJbw?oc=5",
        "published": "Fri, 27 Feb 2026 10:49:44 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "Rising anger over ‘lop-sided’ and ‘immoral’ US health funding pacts with African countries",
        "link": "https://www.theguardian.com/global-development/2026/feb/27/rising-anger-over-lop-sided-immoral-us-health-funding-pacts-africa-countries",
        "published": "Fri, 27 Feb 2026 07:00:34 GMT",
        "source": "World news | The Guardian",
        "text": "A series of bilateral health agreements being negotiated between African countries and the administration of President Donald Trump have been labelled “clearly lop-sided” and “immoral” amid growing outrage at US demands, including countries being forced to share biological resources and data.\n\nIt emerged this week that Zimbabwe had halted negotiations with the US for $350m (£258m) of health funding, saying the proposals risked undermining its sovereignty and independence.\n\nA letter sent by Albert Chimbindi, Zimbabwe’s secretary for foreign affairs and international trade, in December that was made public said the president, Emmerson Mnangagwa, “directed that Zimbabwe must discontinue any negotiation, with the USA, on the clearly lop-sided MoU [memorandum of understanding] that blatantly compromises and undermines the sovereignty and independence of Zimbabwe as a country”.\n\nMeanwhile, a deal with Zambia – which has been linked to a separate agreement with the US on “collaboration in the mining sector” – has yet to be finalised, with Asia Russell, director of the HIV advocacy organisation Health Gap, accusing the US of “conditioning life-saving health services on plundering the mineral wealth of the country. It’s shameless exploitation, which is immoral.”\n\nAt least 17 African countries have signed deals with the US, collectively securing $11.3bn in health aid but raising concerns over concessions made in return.\n\nCritics say there has been a lack of consultation with the community groups that provide a lot of the healthcare in African countries, and have raised concerns over data privacy – the US requests patient record data as part of the deals – and the prioritisation of faith-based healthcare providers.\n\nIn Nigeria, US statements suggest the funding is contingent on authorities tackling what the Trump administration refers to as the persecution of Christians in the country.\n\nThe Trump administration is negotiating the bilateral agreements with countries as part of "
      },
      {
        "title": "From plumber to Parliament, who is the Green Party's new MP?",
        "link": "https://www.bbc.com/news/articles/cwygp3dqenwo?at_medium=RSS&at_campaign=rss",
        "published": "Fri, 27 Feb 2026 12:29:17 GMT",
        "source": "BBC News",
        "text": "During the campaign, media attention focused on a post by her on Mumsnet in 2021 in which she said Levenshulme has been \"hugely blighted\" by \"(supposedly) money laundering takeaways\" and that independent businesses \"can't get a look in\"."
      },
      {
        "title": "A team of midlife cheerleaders in Ukraine refuses to let war defeat them",
        "link": "https://www.npr.org/2026/02/27/nx-s1-5712284/russia-ukraine-war-midlife-women-cheerleading",
        "published": "Fri, 27 Feb 2026 05:00:00 -0500",
        "source": "NPR Topics: World",
        "text": "A team of midlife cheerleaders in Ukraine refuses to let war defeat them\n\ntoggle caption Anton Shtuka for NPR\n\nKHARKIV, Ukraine — In a mirrored basement studio in this front-line city, seven women are practicing jumping splits.\n\nThey're in their 50s and 60s — some have grandchildren. They wear matching Ukraine T-shirts and shake silvery pompoms to the beat of \"She's A Lady\" by Tom Jones.\n\nThis is Sunrise, a competitive cheerleading squad. They have embraced this feel-good American sport as a way to cope with extreme stress and anxiety during four years of Russia's all-out war on Ukraine.\n\n\"We train no matter what,\" says Iryna Nesterenko, the squad's captain. \"When it's dark, and we're walking through the street while everything is burning. When there's no light. I tell my girls: 'We are the light.'\"\n\nNesterenko, the squad's captain, explains why they chose Sunrise as their name.\n\nSponsor Message\n\n\"We used to be fearful of the sunrise,\" she says. \"The war began at dawn. We were often bombed at dawn. But I did not want us to be afraid. I wanted us to find a way to rejoice.\"\n\ntoggle caption Anton Shtuka for NPR\n\nSince Ukraine became a modern independent state in 1991, after the fall of the Soviet Union, it has embraced American culture. Cheerleading began its rise 20 years ago and has surged in popularity since the full-scale war, says Andriy Bolyak, president of the Cheerleading and Cheer Sport Federation of Ukraine.\n\nHe says many squads fled the country after the 2022 Russian invasion.\n\n\"As of today, though, we are back to prewar numbers. That's because we have a lot of new teams,\" he says.\n\nBolyak attributes the rise in cheerleading's popularity to Ukrainians seeking emotional respite from wartime stress and terror. Only 4% of Ukrainians describe their mental health as good, according to a January survey by Helsi, the largest medical information system in Ukraine.\n\nBolyak says that though children make up most of the teams, several new ones are composed of women ove"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nA recent poll found that many Americans struggle to afford large expenses, such as new cars and homes, despite a booming stock market. Meanwhile, Netflix has withdrawn its bid to acquire Warner Bros. Discovery's studio and streaming assets after Paramount made a superior offer. The deal between Paramount and Warner Bros. Discovery is valued at $111 billion. Netflix's decision to walk away from the deal was due to the price required to match Paramount's offer being no longer financially attractive.\n\n## Market & Business Implications\n* According to Article 1, 71% of adults say gasoline is affordable for them, but 74% say a new car is not, including majorities across income groups.\n* As stated in Article 2, Netflix co-CEOs Ted Sarandos and Greg Peters said, \"The transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we've always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\"\n* Article 4 reports that Netflix stock spiked 10% in extended trading Thursday, while Paramount stock gained 5%, and shares of Warner Bros. Discovery fell 2% after the deal was announced.\n* Article 5 states that the Trump administration has handed a $370 million tax break to Cheniere, a fossil fuel giant, for burning gas as an ‘alternative fuel’.\n* According to Article 3, critics of a deal with Netflix voiced concern that the storied movie studio would be lost to the Silicon Valley streaming titan, while a merger with Paramount also left critics unnerved over the company's perceived political connections to the Trump administration.\n\n## Beginner-Friendly Summary\nMany Americans are having trouble buying big things like new cars and houses. Netflix was trying to buy a big movie studio, but another company called Paramount made a better offer, so Netflix decided not to buy it. The deal between Paramount and the movie studio is worth a lot of money, $111 billion. Netflix didn't think it was a good idea to spend that much money, so they walked away from the deal.",
    "articles": [
      {
        "title": "A new car, home feel out of reach for middle-class Americans, poll finds",
        "link": "https://www.washingtonpost.com/business/2026/02/27/affordability-homeownership-poll/",
        "published": "Fri, 27 Feb 2026 11:00:12 +0000",
        "source": "Business",
        "text": "Health care, new cars and new homes feel unaffordable to most Americans, a Washington Post-ABC News-Ipsos poll shows. Most Americans say that they can afford basic necessities like their current housing costs, groceries, utilities and gasoline. But large numbers across income levels also say larger expenses and the cost of things associated with an enjoyable life — including taking a weeklong vacation — are out of reach. Overall, 53 percent of adults say they have just enough money to maintain their standard of living, nearly identical to a year ago, while roughly half, or more, say that discretionary spending on going out to dinner, vacations and new cars is unaffordable.\n\nThe findings, based on a survey of more than 2,500 Americans between Feb. 12 and 17, show why so many Americans — and politicians — cite affordability as a top concern, in spite of a booming stock market and solid consumer spending.\n\nInflation, which has fallen significantly below scorching post-pandemic levels, continues to weigh on households, putting some expenses that many Americans associate with a good standard of living firmly out of reach, even for higher earners. Although gas prices fell in 2025, housing, health care, food and new car prices were stubbornly high.\n\nThe Post-ABC-Ipsos poll finds 71 percent of adults say gasoline is affordable for them, but 74 percent say a new car is not, including majorities across income groups.\n\nNew car and truck prices have soared to record highs in recent months, with the average sticker price for a new car or truck now sitting above $50,000. And annual family premiums for employer-sponsored health care rose 6 percent last year, according to a KFF survey, around double the rate of inflation.\n\nMeanwhile, affordability has emerged as a major theme in the midterms elections. This week, President Trump used his State of the Union speech to tout proposals meant to address voters’ affordability concerns, including a federal website offering coupons on some "
      },
      {
        "title": "Netflix follows Warren Buffett's playbook: Don't overpay, walk away",
        "link": "https://www.foxbusiness.com/markets/netflix-follows-warren-buffetts-playbook-dont-overpay-walk-away",
        "published": "Fri, 27 Feb 2026 08:02:43 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Warner Bros. Discovery CEO David Zaslav may have been counting on watching one last round in the Netflix vs. Paramount Skydance boxing match to acquire the media company he runs. What he might not have anticipated was that Netflix wouldn't even bother re-entering the ring.\n\nThursday after the market close, WBD announced that Paramount Skydance’s last and best offer of $31 a share for its film studio, streaming platform and cable networks was superior to Netflix’s previously accepted bid of $27.75 a share for the studio and streaming assets.\n\nWBD's declaration started a countdown clock: Netflix was granted four business days to match or beat Paramount’s new bid, but just an hour and 10 minutes later, Netflix left the arena.\n\nNETFLIX BACKS OUT OF WARNER BROS BIDDING WAR AFTER PARAMOUNT MADE 'SUPERIOR' OFFER\n\nIn a joint statement, the streamer's co-CEOs, Ted Sarandos and Greg Peters, said, \"The transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\"\n\nConsidering Sarandos’ tone in the final days of the process, the market should have been ready for the quick exit. In an interview Feb. 20 on FOX Business’ \"Claman Countdown,\" Sarandos, when pressed as to whether he'd match a potentially higher bid by Paramount Skydance, seemingly took a page out of former Berkshire Hathaway CEO Warren Buffett's \"never overpay for an asset no matter how much you want it\" playbook.\n\n\"We've been very disciplined buyers in our careers. Our shareholders know us and they expect us to continue to do what we do, which is remain a disciplined buyer,\" Sarandos told FBN.\n\nNetflix shareholders have never fully embraced the merger since the official bidding process began Nov. 20. Since then, Netflix shares have shriveled more than 19%.\n\nTicker"
      },
      {
        "title": "Paramount set for $111bn Warner Bros takeover after Netflix drops bid",
        "link": "https://www.bbc.com/news/articles/c5y6p5ypgmzo?at_medium=RSS&at_campaign=rss",
        "published": "Fri, 27 Feb 2026 04:32:38 GMT",
        "source": "BBC News",
        "text": "Critics of a deal with Netflix voiced concern that the storied movie studio would be lost to the Silicon Valley streaming titan, paving the way for the depletion of cinema. But a merger with Paramount, which has touted itself among the last standing movie studios in Hollywood, also left critics unnerved over the company's perceived political connections to the Trump administration - a concern that has also riled the media landscape over the future of CNN."
      },
      {
        "title": "Netflix ditches deal for Warner Bros. Discovery after Paramount’s offer is deemed superior",
        "link": "https://www.cnbc.com/2026/02/26/warner-bros-discovery-paramount-skydance-deal-superior-netflix.html",
        "published": "Fri, 27 Feb 2026 12:48:46 GMT",
        "source": "Business News",
        "text": "Netflix is walking away from a deal to buy Warner Bros. Discovery's studio and streaming assets after the WBD board on Thursday deemed a revised bid by Paramount Skydance to be a superior offer.\n\nEarlier this week, Paramount raised its bid to buy the entirety of WBD to $31 per share, up from $30 per share, all cash. It was the latest amendment to Paramount's multiple offers in recent months — and since moving forward with a hostile bid to buy the company — and it's now unseated a deal between WBD and Netflix to sell the legacy media company's studio and streaming businesses for $27.75 per share.\n\nLast week, Netflix granted WBD a seven-day waiver to reengage with Paramount, resulting in the higher bid. Paramount's offer is for the entirety of WBD, including its pay-TV networks, such as CNN, TBS and TNT.\n\nNetflix had four business days to make changes to its own proposal in light of Paramount's superior bid, the WBD board said in a statement Thursday.\n\nInstead, the decision by the streaming giant to walk away puts a pin in a drawn-out saga that saw amended offers from both bidders.\n\n\"Netflix is a great company and throughout this process Ted, Greg, Spence and everyone there have been extraordinary partners to us. We wish them well in the future,\" WBD CEO David Zaslav said in a statement, referring to Netflix co-CEOs Ted Sarandos and Greg Peters and CFO Spencer Neumann. \"Once our Board votes to adopt the Paramount merger agreement, it will create tremendous value for our shareholders. We are excited about the potential of a combined Paramount Skydance and Warner Bros. Discovery and can't wait to get started working together telling the stories that move the world.\"\n\nNetflix stock spiked 10% in extended trading Thursday, while Paramount stock gained 5%. Shares of Warner Bros. Discovery fell 2%.\n\n\"The transaction we negotiated would have created shareholder value with a clear path to regulatory approval,\" Sarandos and Peters said in a statement. \"However, we've always be"
      },
      {
        "title": "Fossil fuel giant wins $370 million tax break for burning gas as an ‘alternative fuel’",
        "link": "https://www.washingtonpost.com/business/2026/02/27/cheniere-trump-irs-alternative-fuel/",
        "published": "Fri, 27 Feb 2026 10:00:00 +0000",
        "source": "Business",
        "text": "The Trump administration has handed a $370 million windfall to one of the world’s largest exporters of natural gas by allowing the company to claim an “alternative fuels” tax incentive for operating some of the planet’s most heavily polluting ships. Financial disclosures made Thursday by liquefied natural gas (LNG) exporter Cheniere reveal that the IRS green-lit the payment earlier this year, ruling that the company’s tankers powered by liquefied natural gas that ship the fossil fuel worldwide qualified for the incentive.\n\nThe IRS decision was met with sharp criticism from environmentalists and bewilderment from tax experts, who said the alternative-fuels incentive was never meant to be used on the massive vessels. Most U.S. tankers carrying LNG use the “boiloff” from fuel they are shipping to power their engines, as Cheniere’s vessels do.\n\n“This is very questionable,” Zorka Milin, the policy director at the nonprofit Financial Accountability and Corporate Transparency Coalition, said of the IRS ruling. “I am not sure how they could reach this conclusion.”\n\nThe methane emissions from tankers burning LNG, according to scientists, are a significant driver of climate change.\n\nCheniere declined to respond to detailed questions from The Washington Post. The IRS and the Treasury Department did not immediately respond to questions.\n\nThe fossil fuel giant received the credit for the period spanning 2018 to 2024, according to Cheniere’s disclosures, suggesting other LNG firms could also receive the same credits retroactively. The incentive expired at the end of 2024. Ask The Post AIDive deeper\n\nCheniere invoked a George W. Bush-era tax break that was created to promote more energy efficient and environmentally friendly vehicles and boats during a time of concern about U.S. energy independence, before the fracking boom transformed the country into a major exporter of LNG.\n\nThe 50 cents per gallon alternative-fuel tax credit was used to boost biodiesel and ethanol as a fuel fo"
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nJazz Pharmaceuticals plc (JAZZ) stock jumped nearly 30% due to strong Q3 results and progress in cancer drug trials. CoreWeave's shares fell 8% after the company delivered light revenue guidance for the current quarter. Electronic Arts (EA) surged in 2025 ahead of a $55 billion buyout deal. FanDuel parent Flutter reported disappointing fourth-quarter earnings, missing Wall Street expectations. General Motors Company (GM) rose on record truck sales and shareholder returns.\n\n## Market & Business Implications\n* Jazz Pharmaceuticals plc (JAZZ) stock closed at approximately $188.97 per share on February 26, 2026, with a market capitalization, as mentioned in Article 1.\n* CoreWeave's revenue grew 110% year over year in the fourth quarter, and the company called for $1.9 billion to $2 billion in first-quarter revenue, as stated in Article 2.\n* Electronic Arts Inc. (NASDAQ:EA) stock closed at approximately $201.07 per share on February 26, 2026, with a market capitalization of about $50.319 billion, according to Article 3.\n* FanDuel parent Flutter reported adjusted earnings before interest, taxes, depreciation and amortization of $832 million, below the $893 million that Wall Street was expecting, as mentioned in Article 4.\n* General Motors Company (NYSE:GM) stock closed at approximately $80.79 per share on February 26, 2026, with a market capitalization of about $75.366 billion, as stated in Article 5.\n\n## Beginner-Friendly Summary\nSome big companies had good and bad news. Jazz Pharmaceuticals had a big increase in stock price because of good results. CoreWeave's stock price went down because they didn't make as much money as expected. Electronic Arts had a good year and is being bought out. FanDuel's parent company didn't do as well as expected. General Motors had record sales and made their shareholders happy.",
    "articles": [
      {
        "title": "Jazz Pharmaceuticals plc (JAZZ) Jumps Nearly 30% on Strong Q3 and Cancer Drug Trial Progress",
        "link": "https://finance.yahoo.com/news/jazz-pharmaceuticals-plc-jazz-jumps-135104923.html?.tsrc=rss",
        "published": "Fri, 27 Feb 2026 13:51:04 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The Harbor Capital Advisors released its “Mid Cap Value Fund’s” Q4 2025 investor letter. A copy of the letter can be downloaded here. Harbor Mid Cap Value Fund, subadvised by LSV Asset Management, delivered solid outperformance in the fourth quarter of 2025, with the Institutional Class returning 4.07% versus 1.42% for the Russell Midcap Value Index, benefiting from strength in value stocks as the Russell Midcap Growth Index declined 3.7% during the period. U.S. equities broadly advanced, with the S&P 500 Index rising 2.7% in the quarter and 17.9% for the full year, while mid-caps lagged, with the Russell Midcap Index up just 0.2% in Q4. For 2025, the Fund gained 15.95% (Institutional Class), outperforming the benchmark’s 11.05% return. Attribution data show a total quarterly excess return of 2.82%, largely from selection effects, underscoring the manager’s quantitative value discipline focused on fundamental undervaluation, improving momentum, and risk control. Looking ahead, management noted that while AI-driven large-cap leadership has elevated valuations in certain segments, mid- and small-cap value stocks continue to trade at more attractive multiples, positioning the Fund to capitalize on opportunities within economically sensitive and cash-generative businesses. In addition, please check the Fund’s top five holdings to know its best picks in 2025.\n\nIn its fourth-quarter 2025 investor letter, Harbor Capital Advisors' Mid Cap Value Fund highlighted stocks like Jazz Pharmaceuticals plc (NASDAQ:JAZZ). Jazz Pharmaceuticals plc (NASDAQ:JAZZ) is a biopharmaceutical company specializing in treatments for sleep disorders, epilepsy, and oncology with a focus on high-value specialty medicines. The one-month return of Jazz Pharmaceuticals plc (NASDAQ:JAZZ) was 14.88% while its shares traded between $95.49 and $198.00 over the last 52 weeks. On February 26, 2026, Jazz Pharmaceuticals plc (NASDAQ:JAZZ) stock closed at approximately $188.97 per share, with a market capitali"
      },
      {
        "title": "CoreWeave shares slip 8% as quarterly revenue guidance disappoints",
        "link": "https://www.cnbc.com/2026/02/26/coreweave-crwv-q4-earnings-report-2025.html",
        "published": "Fri, 27 Feb 2026 00:38:44 GMT",
        "source": "Earnings",
        "text": "Michael Intrator, Chief Executive Officer of CoreWeave Inc., speaks during an interview with CNBC on the floor at the New York Stock Exchange (NYSE) in New York City, U.S., Sept. 22, 2025.\n\nCoreWeave shares fell 8% in extended trading on Thursday after the artificial intelligence-focused cloud infrastructure provider delivered light revenue guidance for the current quarter.\n\nHere's how the company did in comparison with LSEG consensus:\n\nLoss per share: 89 cents. That might not compare with the LSEG consensus of a loss of 49 cents\n\n89 cents. That might not compare with the LSEG consensus of a loss of 49 cents Revenue: $1.57 billion vs. $1.55 billion expected\n\nCoreWeave's revenue grew 110% year over year in the fourth quarter, according to a statement.\n\nThe company called for $1.9 billion to $2 billion in first-quarter revenue, below the $2.29 billion LSEG consensus.\n\nFor all of 2026, CoreWeave sees $12 billion to $13 billion in revenue. Analysts polled by LSEG had anticipated $12.09 billion.\n\nNvidia graphics chips, which lie at the core of CoreWeave's offering, remain in short supply, CoreWeave CEO Mike Intrator said on a conference call with analysts. Average prices for Nvidia's H100 processors in the fourth quarter were within 10% of where they started the year, and older A100 prices increased in 20205, Intrator said.\n\nCoreWeave had 850 megawatts in active power capacity at the end of the year, while contracted power stood at 3.1 gigawatts. Analysts polled by LSEG had been projecting about 827 megawatts in active power.\n\nThe company is targeting $30 billion to $35 billion in capital expenditures for 2026, up from $10.31 billion in 2025. It intends to end 2026 with over 1.7 gigawatts of active power, which is higher than Visible Alpha's consensus of 1.59 gigawatts, and add over five gigawatts beyond its contracted footprint by 2030.\n\n\"Not only are we seeing the proliferation of demand across the economy going from where was initially really housed within the hypersc"
      },
      {
        "title": "Electronic Arts (EA) Surges in 2025 Ahead of $55 Billion Buyout Deal",
        "link": "https://finance.yahoo.com/news/electronic-arts-ea-surges-2025-134422700.html?.tsrc=rss",
        "published": "Fri, 27 Feb 2026 13:44:22 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The Harbor Capital Advisors released its “Mid Cap Value Fund’s” Q4 2025 investor letter. A copy of the letter can be downloaded here. Harbor Mid Cap Value Fund, subadvised by LSV Asset Management, delivered solid outperformance in the fourth quarter of 2025, with the Institutional Class returning 4.07% versus 1.42% for the Russell Midcap Value Index, benefiting from strength in value stocks as the Russell Midcap Growth Index declined 3.7% during the period. U.S. equities broadly advanced, with the S&P 500 Index rising 2.7% in the quarter and 17.9% for the full year, while mid-caps lagged, with the Russell Midcap Index up just 0.2% in Q4. For 2025, the Fund gained 15.95% (Institutional Class), outperforming the benchmark’s 11.05% return. Attribution data show a total quarterly excess return of 2.82%, largely from selection effects, underscoring the manager’s quantitative value discipline focused on fundamental undervaluation, improving momentum, and risk control. Looking ahead, management noted that while AI-driven large-cap leadership has elevated valuations in certain segments, mid- and small-cap value stocks continue to trade at more attractive multiples, positioning the Fund to capitalize on opportunities within economically sensitive and cash-generative businesses. In addition, please check the Fund’s top five holdings to know its best picks in 2025.\n\nIn its fourth-quarter 2025 investor letter, Harbor Capital Advisors' Mid Cap Value Fund highlighted stocks like Electronic Arts Inc. (NASDAQ:EA). Electronic Arts Inc. (NASDAQ:EA) is a global interactive entertainment company that develops and publishes video games across console, PC, and mobile platforms. The one-month return of Electronic Arts Inc. (NASDAQ:EA) was -1.40% while its shares traded between $128.02 and $204.89 over the last 52 weeks. On February 26, 2026, Electronic Arts Inc. (NASDAQ:EA) stock closed at approximately $201.07 per share, with a market capitalization of about $50.319 billion.\n\nHarbor Capi"
      },
      {
        "title": "FanDuel parent Flutter reports disappointing fourth-quarter earnings",
        "link": "https://www.cnbc.com/2026/02/26/fanduel-parent-flutter-flut-q4-2025-earnings.html",
        "published": "Thu, 26 Feb 2026 22:44:18 GMT",
        "source": "Earnings",
        "text": "FanDuel parent Flutter Entertainment announced fourth-quarter earnings Thursday that missed Wall Street expectations on nearly every metric.\n\nFanDuel's performance in the final quarter of 2025 was affected by bettors losing more often than usual. When that happens, gamblers get discouraged, bet less and stop using the app as frequently, Flutter CEO Peter Jackson told CNBC in an interview.\n\n\"It's fair to say, not everything went our way in the fourth quarter,\" Jackson said.\n\nShares of Flutter fell almost 7% in extended trading Thursday.\n\nHere's what the company reported for the fourth quarter, compared with Wall Street consensus:\n\nRevenue: $4.74 billion vs. $4.97 billion, according to LSEG\n\n$4.74 billion vs. $4.97 billion, according to LSEG Adjusted EPS: $1.74 vs. $1.95, according to LSEG\n\nFor the fourth quarter, Flutter reported adjusted earnings before interest, taxes, depreciation and amortization of $832 million, below the $893 million that Wall Street was expecting, according to StreetAccount.\n\nIts fourth-quarter revenue marked a year-over-year increase of 25%. And yet, Flutter's 2026 revenue guidance of $17.75 billion to $19.05 billion was lower than analysts' projection of $19.34 billion for the year.\n\nOn the company's earnings call, Jackson told investors that prediction markets would likely spur more legalization of sports betting by the states. He also said the company has found no evidence that prediction markets are cannibalizing the sportsbook business."
      },
      {
        "title": "General Motors Company (GM) Rises on Record Truck Sales and Shareholder Returns",
        "link": "https://finance.yahoo.com/news/general-motors-company-gm-rises-134248205.html?.tsrc=rss",
        "published": "Fri, 27 Feb 2026 13:42:48 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "The Harbor Capital Advisors released its “Mid Cap Value Fund’s” Q4 2025 investor letter. A copy of the letter can be downloaded here. Harbor Mid Cap Value Fund, subadvised by LSV Asset Management, delivered solid outperformance in the fourth quarter of 2025, with the Institutional Class returning 4.07% versus 1.42% for the Russell Midcap Value Index, benefiting from strength in value stocks as the Russell Midcap Growth Index declined 3.7% during the period. U.S. equities broadly advanced, with the S&P 500 Index rising 2.7% in the quarter and 17.9% for the full year, while mid-caps lagged, with the Russell Midcap Index up just 0.2% in Q4. For 2025, the Fund gained 15.95% (Institutional Class), outperforming the benchmark’s 11.05% return. Attribution data show a total quarterly excess return of 2.82%, largely from selection effects, underscoring the manager’s quantitative value discipline focused on fundamental undervaluation, improving momentum, and risk control. Looking ahead, management noted that while AI-driven large-cap leadership has elevated valuations in certain segments, mid- and small-cap value stocks continue to trade at more attractive multiples, positioning the Fund to capitalize on opportunities within economically sensitive and cash-generative businesses. In addition, please check the Fund’s top five holdings to know its best picks in 2025.\n\nIn its fourth-quarter 2025 investor letter, Harbor Capital Mid Cap Value Fund highlighted stocks like General Motors Company (NYSE:GM). General Motors Company (NYSE:GM) is a leading global automaker focused on vehicle manufacturing, electric vehicle innovation, and mobility solutions across international markets. The one-month return of General Motors Company (NYSE:GM) was -4.44% while its shares traded between $41.60 and $87.62 over the last 52 weeks. On February 26, 2026, General Motors Company (NYSE:GM) stock closed at approximately $80.79 per share, with a market capitalization of about $75.366 billion.\n\nHarbor"
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nThe UK's Gambling Commission is exploring the use of cryptocurrency for payments at licensed online casinos. The US Attorney for the District of Columbia announced that the Scam Center Strike Force has frozen, seized, and forfeited over $580 million in cryptocurrency from scam networks. Jack Dorsey's Block is cutting 40% of its staff due to the impact of AI on its business. A US federal judge ruled that Binance cannot force a group of US customers to arbitrate claims over losses on crypto tokens. \n\n## Market & Business Implications\n* The UK's Gambling Commission is examining the potential for cryptocurrency to be used as a consumer payment option for licensed and regulated gambling in Great Britain, as stated by Tim Miller, the commission's executive director for research and policy (Article 1).\n* The Scam Center Strike Force has frozen, seized, and forfeited over $580 million in cryptocurrency from scam networks operating in countries including Burma, Cambodia, and Laos (Article 2).\n* Jack Dorsey's Block is cutting 40% of its staff, reducing its headcount from 10,200 to just under 6,000, due to the impact of AI on its business (Article 4).\n* A US federal judge ruled that Binance cannot force a group of US customers to arbitrate claims over losses on crypto tokens they bought on its global platform before February 20, 2019 (Article 5).\n* Pantera Capital and Franklin Templeton's digital assets units have joined the first cohort of Arena, a new testing environment from open-source AI lab Sentient (Article 3).\n\n## Beginner-Friendly Summary\nThe UK is thinking about letting people use cryptocurrency to pay for online gambling. In the US, a group of law enforcement agencies has taken away a lot of cryptocurrency from scammers. A company called Block is laying off many of its employees because of changes in technology. A judge has ruled that a cryptocurrency company called Binance can't make some of its customers use a special process to resolve disputes. These are some of the big things happening in the world of cryptocurrency right now.",
    "articles": [
      {
        "title": "UK gambling regulator weighs allowing crypto payments for online betting",
        "link": "https://cointelegraph.com/news/uk-gambling-watchdog-allow-crypto-payments-fca-framework?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 27 Feb 2026 13:17:46 +0000",
        "source": "Cointelegraph.com News",
        "text": "The United Kingdom’s Gambling Commission is exploring how cryptocurrency could be used for payments at licensed online casinos, as the country prepares to bring more crypto activity under a new regulatory regime led by the Financial Conduct Authority (FCA).\n\nTim Miller, the commission’s executive director for research and policy, said Thursday that the regulator wants to examine “the potential path forward” for allowing “cryptoasset to be used as a consumer payment option for licensed and regulated gambling in Great Britain.” Miller made the remarks at the Betting and Gaming Council’s annual general meeting in London, according to his published speech.\n\nCompanies carrying out regulated crypto activities will require authorization by the FCA under the Financial Services and Markets Act 2000 (FSMA) when the new regime commences, Miller said.\n\n“And that, as well as the growing appetite we see from punters, means we do now want to start looking at what the potential path forward would be to create a way for cryptoasset to be used as a consumer payment option for licensed and regulated gambling in Great Britain.”\n\nTim Miller’s speech at the Betting and Gaming Council’s annual general meeting in London. Source: Gambling Commission UK\n\nCommission asks industry group to map options\n\nMiller said he had requested that the Industry Forum, an advisory group representing gambling sector workers, explore the best path toward accepting cryptocurrency payments, without setting a deadline.\n\nMiller said that accepting crypto payments may help protect British gamblers from illegal websites.\n\n“Our illegal markets research also gives us evidence that crypto is one of the two biggest searches that lead British gamblers to illegal sites,” said Miller, adding that this may be an important consumer protection measure.\n\nStill, Miller highlighted that allowing crypto payments does not mean casinos will be regulated by UK lawmakers, as they would struggle to pass customer suitability checks.\n\n"
      },
      {
        "title": "DC Scam Center Strike Force Crypto Seizures, Freezes Hit $580M",
        "link": "https://decrypt.co/359398/dc-scam-center-strike-force-crypto-seizures-freezes-hit-580m",
        "published": "Fri, 27 Feb 2026 13:53:35 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nFreezes and seizures of cryptocurrency by the Scam Center Strike Force from Southeast Asian crime networks have topped $580 million, according to the U.S. Attorney for the District of Columbia.\n\nIn an announcement Thursday, Jeanine Pirro stated that the force had made “significant progress” in freezing, seizing and forfeiting crypto from scam networks operating in countries including Burma, Cambodia, and Laos.\n\nIn only three months, our Scam Center Strike Force has made significant progress, freezing, seizing, and forfeiting cryptocurrency from these criminals. To our American victims: we are here for you, we care for you, and we will continue fighting like hell to claw back your… pic.twitter.com/RFD3zeJYsc — US Attorney Pirro (@USAttyPirro) February 26, 2026\n\nPirro said that crypto seizures are “one important part of the Scam Center Strike Force’s work,” adding that, “Through the legal process, my Office will seek to forfeit these funds and return them to victims to the maximum extent possible.”\n\nThe Scam Center Strike Force\n\nFounded in November 2025, the Scam Center Strike Force coordinates across the DOJ, FBI, Secret Service, U.S. Treasury, and other government agencies, targeting transnational criminal networks that have made billions of dollars through so-called “pig butchering” scams.\n\nPig butchering scams involve the use of social engineering to encourage victims to purchase cryptocurrency, before the scammers divert and seize control of the funds through fake investment domains and applications. Southeast Asia has emerged as a hotbed of scam compounds, often relying on coerced labor, which Interpol last year elevated to a global threat.\n\nIn September 2025, the U.S. Treasury’s Office of Foreign Assets Control sanctioned 19 entities across Burma and Cambodia, dismantling scam operations that cost victims more than $10 billion in 2024. Last month, Amnesty International warned that mass "
      },
      {
        "title": "Pantera, Franklin Templeton join Sentient Arena to test AI agents",
        "link": "https://cointelegraph.com/news/sentient-arena-tests-ai-agents-pantera-franklin-templeton?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 27 Feb 2026 12:27:18 +0000",
        "source": "Cointelegraph.com News",
        "text": "Pantera Capital and Franklin Templeton’s digital assets units have joined the first cohort of Arena, a new testing environment from open-source AI lab Sentient that is designed to evaluate how AI agents perform in enterprise-style workflows.\n\nIn a Friday announcement shared with Cointelegraph, Sentient positioned Arena as a production-style benchmarking platform rather than a static model test. Instead of scoring agents on fixed datasets alone, it runs them through standardized tasks modeled on enterprise conditions, including long documents, incomplete information and conflicting sources.\n\n“In this initial phase, participation refers to supporting the Arena program and developer cohort,” Oleg Golev, product lead at Sentient Labs, told Cointelegraph.\n\nHe said partners are helping shape what “production-ready reasoning” looks like for document-heavy tasks such as analysis, compliance and operations. The companies are not announcing capital commitments tied to the initiative.\n\nRelated: Jack Dorsey’s Block to cut 4,000 jobs in AI-driven restructuring\n\nThe launch comes as enterprises accelerate the deployment of AI agents into research and operational workflows, even as governance frameworks lag.\n\nAccording to the Celonis 2026 Process Optimization Report, published Feb. 4, 85% of surveyed senior business leaders aim to become “agentic enterprises” within three years, while only 19% currently use multi-agent systems.\n\nThe 2026 Process Optimization Report. Source: Celonis\n\nProduction-style evaluation, not static scoring\n\nGolev described Arena as a shared platform where developers submit AI agents to standardized tasks and compare results under consistent testing conditions.\n\nThe platform tracks failure categories such as hallucination, missing evidence, incorrect citations and reasoning gaps, allowing developers to diagnose recurring issues.\n\nArena plans to publish comparative performance metrics through a public leaderboard and release postmortems summarizing common fail"
      },
      {
        "title": "Morning Minute: Jack Dorsey Slashes 40% of Block's Jobs Due to AI",
        "link": "https://decrypt.co/359395/morning-minute-jack-dorsey-slashes-40-of-blocks-jobs-due-to-ai",
        "published": "Fri, 27 Feb 2026 12:51:59 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nMorning Minute is a daily newsletter written by Tyler Warner. The analysis and opinions expressed are his own and do not necessarily reflect those of Decrypt. Subscribe to the Morning Minute on Substack.\n\nGM!\n\nToday’s top news:\n\nCrypto majors fall as Iran concerns escalate; BTC at $66k\n\nJack’s Block announces 40% layoffs, XYZ stock jumps 20% on news\n\nEthereum leans further into post-quantum as Vitalik pushes roadmap\n\nZachXBT exposes an Axiom employee for trading on inside information\n\nMagic Eden to sunset its BTC and EVM marketplace along with its wallet\n\n🤖 Jack Dorsey Just Halved Block’s Workforce Because of AI\n\nThe Citrini article was right. But maybe not that early.\n\n📌 What Happened\n\nJack Dorsey’s Block reported Q4 2025 earnings yesterday and then Jack dropped a bombshell on X—he’s cutting 40% of its staff due to AI.\n\nThe Block headcount is dropping from 10,200 to just under 6,000, all while the business is objectively not struggling.\n\nJack’s letter was blunt:\n\n“Intelligence tools have changed what it means to build and run a company. A significantly smaller team, using the tools we’re building, can do more and do it better.”\n\nHe had two options, he said: cut slowly over months as AI takes over, or do it now. He chose now.\n\nBlock expects $450M to $500M in restructuring charges, mostly landing in Q1.\n\nNotably, XYZ shares jumped 23% in after-hours trading.\n\n🗣️ What They’re Saying\n\n“I don’t think we’re early to this realization. I think most companies are late. Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes. I’d rather get there honestly and on our own terms than be forced into it reactively.” - Jack Dorsey\n\n“We are choosing to shift how we operate at a time when our business is accelerating.” - CFO Amrita Ahuja\n\n🧠 Why It Matters\n\nThe timing of the Block cuts is critical to the virality of the story, coming on the "
      },
      {
        "title": "New York judge blocks Binance bid to force US crypto claims into arbitration",
        "link": "https://cointelegraph.com/news/new-york-judge-blocks-binance-bid-to-force-us-crypto-claims-into-arbitration?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Fri, 27 Feb 2026 11:46:37 +0000",
        "source": "Cointelegraph.com News",
        "text": "A United States federal judge ruled that Binance cannot force a group of US customers to arbitrate claims over losses on crypto tokens they bought on its global platform before Feb. 20, 2019, keeping a major class action in open court.\n\nThe decision on Thursday by District Judge Andrew Carter Jr. in the Southern District of New York held that those claims were not bound by Binance.com’s 2019 arbitration clause because users lacked sufficient notice when the company unilaterally shifted its terms of use away from the 2017 version, which contained no arbitration or class action waiver provisions.\n\nAccording to the judge, Binance relied on a general change‑of‑terms clause and the posting of updated 2019 terms on its website, and there was no evidence that the exchange provided any individual notice or formally “announced” the new arbitration provision to users.\n\nCarter found that Binance’s “new world” rhetoric about operating in a decentralized manner did not change the basic contract law analysis for internet‑based agreements.\n\nWilliams vs. Binance. Source: CourtListener\n\nHe concluded that the 2019 arbitration clause could not be applied retroactively to claims that arose before its Feb. 20 effective date, because the contract never clearly said it would cover earlier conduct.\n\nRelated: US senator launches probe into Binance over Iran, Russia sanctions claims\n\nCarter also held that a purported US class action waiver embedded in a section heading of the 2019 terms was unenforceable in federal court because the contract never actually sets out the terms of any such waiver and had to be interpreted narrowly against Binance as the drafter.\n\n​​Binance says post‑2019 claims already dismissed\n\nThe case, Williams v. Binance, is a proposed class action brought by five US investors from California, Nevada and Texas who claim that Binance and founder Changpeng Zhao (CZ) illegally sold unregistered securities on Binance.com and failed to register as a broker‑dealer.\n\nThe case was"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-27T14:01:23.509434+00:00"
  }
}