{
  "Tech": {
    "summary": "## Executive Summary\nSarvam, an Indian AI startup, has launched its Indus AI chat app, entering a competitive market dominated by global players. Stellantis, a parent company of Jeep, Dodge, and Chrysler, is facing a crisis due to its misplaced bet on EVs, resulting in a $26.5 billion write-down. Meanwhile, password managers' claims of being \"zero knowledge\" have been debunked, and souvenirs from the 2026 Winter Olympics are being resold for high prices online. Sarvam has raised $41 million to date and is seeking feedback from users for its Indus app.\n\n## Market & Business Implications\n* Sarvam has launched its Indus chat app, which serves as a chat interface for its 105-billion-parameter large language model, as stated in Article 1.\n* Stellantis is facing a crisis due to its misplaced bet on EVs, resulting in a $26.5 billion write-down, as reported in Article 2.\n* Research has shown that password managers' claims of being \"zero knowledge\" are not entirely true, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups, as stated in Article 4.\n* The 2026 Winter Olympics souvenirs, such as plushies and Swatch watches, are being resold for high prices online, with some items selling for up to four times their original price, as reported in Article 5.\n\n## Beginner-Friendly Summary\nA new company called Sarvam has made a chat app that uses artificial intelligence. Another company, Stellantis, is having big problems because it made a bad bet on electric vehicles. Some password managers are not as secure as they claim to be. Also, people are buying and selling Olympic souvenirs online for a lot of money.",
    "articles": [
      {
        "title": "India’s Sarvam launches Indus AI chat app as competition heats up",
        "link": "https://techcrunch.com/2026/02/20/indias-sarvam-launches-indus-ai-chat-app-as-competition-heats-up/",
        "published": "Sat, 21 Feb 2026 01:00:00 +0000",
        "source": "TechCrunch",
        "text": "Sarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users, entering a fast-growing market dominated by global players including OpenAI, Anthropic, and Google.\n\nThe launch comes as India has become a key battleground for generative AI adoption. Recently, OpenAI CEO Sam Altman said ChatGPT has more than 100 million weekly active users in India, while Anthropic said India accounts for 5.8% of total Claude usage, second only to the U.S.\n\nIndus serves as a chat interface for its newly announced Sarvam 105B model, the company’s 105-billion-parameter large language model. The app’s launch comes two days after Bengaluru-based Sarvam unveiled its 105B and 30B models at the India AI Impact Summit in New Delhi earlier this week. At the summit, the startup also outlined enterprise initiatives and hardware plans and announced partnerships with companies including HMD to bring AI to Nokia feature phones and Bosch for AI-enabled automotive applications.\n\nCurrently available in beta on iOS, Android, and the web, the Indus app allows users to type or speak queries and receive responses in text and audio. Users can sign in using their phone number, Google or Microsoft account, or Apple ID, though the service appears to be limited to India for now.\n\nImage Credits:Jagmeet Singh / TechCrunch\n\nThe app currently comes with some limitations. Users cannot delete their chat history without deleting their account, and there is no option to turn off the app’s reasoning feature, which can sometimes slow response times. Sarvam has also warned that access may be restricted as it gradually expands its compute capacity.\n\n“We’re gradually rolling out Indus on a limited compute capacity, so you may hit a waitlist at first. We will expand access over time,” Sarvam co-founder Pratyush Kumar wrote on X, adding that the company is seeking feedback from users.\n\nFounded in 2023, Sarvam has raised $41 million to date"
      },
      {
        "title": "Stellantis is in a crisis of its own making",
        "link": "https://www.theverge.com/transportation/881987/stellantis-crisis-ev-loss-sales-regulations",
        "published": "2026-02-21T08:00:00-05:00",
        "source": "The Verge",
        "text": "Demand for EVs has gone glacial, and one automaker after another is running aground: General Motors threw $7.6 billion overboard. Ford washed $19.5 billion off its books. Leave it to Stellantis to face the most titanic charge yet, a $26.5 billion bill for its own misplaced bet on EVs.\n\nThe Jeep, Dodge, and Chrysler parent company hasn’t said how much of that unfathomable sum is explicitly due to EV losses, as the write-down wiped away about 25 percent of the company’s stock value overnight. Every automaker faces the same cooling EV demand and whipsawing political climate, yet Stellantis appears the most exposed, due in part to longstanding failures to keep up with evolving tech or consumer tastes. Don’t forget quality. An additional $16.7 billion charge for warranty and recall claims, including a recall of 320,000 Jeep 4xe plug-in hybrids for battery-fire risks, adds insult to financial injury.\n\nThe names may change — Stellantis, Fiat Chrysler, DaimlerChrysler, Chrysler Corp. — but the company stays frustratingly familiar. It’s the slightly off-key sister in the Motown trio. It’s an automaker enamored of the quick fix, the low-hanging fruit.\n\nIn America, that low-hanging fruit tends to come in bunches of eight, with Hemi V8s below the hood of a thirsty pickup, SUV, or muscle car. Now it’s déjà vu all over again. Stellantis plans to ship 100,000 Hemi engines from its Saltillo, Mexico, factory in 2026, tripling output to power Ram 1500 pickups, Jeep Wranglers, and other models. For now, the demand appears there, and executives intend to give the people what they want.\n\nDuring an analysts’ call last year, Stellantis CEO Antonio Filosa said the so-called Big Beautiful Bill — making sure to give President Trump credit — allows the company “more flexibility in choosing… a mix between ICE and electric versions that we sell. And this will mean, to us, a lot of additional profit.”\n\nA driver from Stellantis takes a journalist on a drive in a 2026 Jeep Gladiator Rubicon during"
      },
      {
        "title": "Padlet (YC W13) Is Hiring in San Francisco and Singapore",
        "link": "https://padlet.jobs",
        "published": "Sat, 21 Feb 2026 12:02:14 +0000",
        "source": "Hacker News: Front Page",
        "text": "LET'S GET TO WORK\n\nYour morning cup of coffee.\n\n\n\nThe song you'll play at your wedding.\n\n\n\nFootball, either one.\n\n\n\nThe camera that recorded your first steps.\n\n\n\nAir conditioning in the living room, hot water in the bathroom.\n\n\n\n\n\nYour every comfort, every joy, every memory.\n\n\n\nYou have them because of someone's work,\n\n\n\nbecause of a world at work,\n\n\n\nbecause of generations that worked before us.\n\n\n\n\n\nMaking.\n\n\n\nSaving.\n\n\n\nBreaking.\n\n\n\nMoving.\n\n\n\n\n\nWrestling inboxes that never tap out.\n\n\n\nFive minutes to finish a ziplocked ham sandwich.\n\n\n\nTrying to find parking. Always trying to find parking.\n\n\n\nKnots in the gut before the lights turn on.\n\n\n\nBlisters on fingers where the pencil meets the skin.\n\n\n\n\n\nSnowfall or heatwave.\n\n\n\nStardust to sunrise.\n\n\n\n\n\nThey showed up for us.\n\n\n\n\n\nLet's show up for them.\n\n\n\n\n\nLet's move.\n\n\n\nLet's break.\n\n\n\nLet's save.\n\n\n\nLet's make.\n\n\n\n\n\nLet's get to work."
      },
      {
        "title": "Password managers' promise that they can't see your vaults isn't always true",
        "link": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
        "published": "Tue, 17 Feb 2026 20:43:01 +0000",
        "source": "Biz & IT - Ars Technica",
        "text": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data.\n\nAll eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. These promises make sense, given previous breaches of LastPass and the reasonable expectation that state-level hackers have both the motive and capability to obtain password vaults belonging to high-value targets.\n\nA bold assurance debunked\n\nTypical of these claims are those made by Bitwarden, Dashlane, and LastPass, which together are used by roughly 60 million people. Bitwarden, for example, says that “not even the team at Bitwarden can read your data (even if we wanted to).” Dashlane, meanwhile, says that without a user’s master password, “malicious actors can’t steal the information, even if Dashlane’s servers are compromised.” LastPass says that no one can access the “data stored in your LastPass vault, except you (not even LastPass).”\n\nNew research shows that these claims aren’t true in all cases, particularly when account recovery is in place or password managers are set to share vaults or organize users into groups. The researchers reverse-engineered or closely analyzed Bitwarden, Dashlane, and LastPass and identified ways that someone with control over the server—either administrative or the result of a compromise—can, in"
      },
      {
        "title": "Souvenirs From the 2026 Winter Olympics Are Being Resold for Big Bucks Online",
        "link": "https://www.wired.com/story/gear-from-the-2026-winter-olympics-is-being-resold-for-big-bucks-online/",
        "published": "Sat, 21 Feb 2026 12:00:00 +0000",
        "source": "WIRED",
        "text": "As the 2026 Winter Olympics come to a close, a whole new game is afoot: the mad dash to make money on exclusive memorabilia. When the Games are over, most of the event’s coolest collectibles will become very hard to find, plundered by scalpers and bargain hunters and only available through online marketplaces like eBay and Vinted. And if the eye-popping prices already placed on the gear are any indication, they’re going to be quite valuable.\n\nOf all the Milano Cortina Olympics memorabilia that’s hit the internet so far, the plushies of mascots Milo and Tina and the Swatch watches given to volunteers have proven to be standouts. Pins are also proving popular, particularly Snoop Dogg’s special edition and the ones dedicated to the torchbearers.\n\nOriginally, the Milo and Tina stuffed animals ranged in price from €15 to €50 (about $18 to $60), depending on size. Now the smallest stoat plushies are going for as much as three times their original price, and the bigger ones are four times as expensive as they originally were. (Some can still be ordered on the Olympics shop at their original prices. But there is one drawback: As of this writing, some of them may not be delivered until June.)\n\nThe Swatch watches, meanwhile, were only given to volunteers and not available for sale. Never-worn Swatches still in the box are already showing up for sale for anywhere from €200 to €500 ($235 to $590).\n\nAt least one of the Samsung Galaxy Z Flip 7 smartphones give to athletes has shown up on eBay with a Buy It Now price of $1,680.\n\nAs of this writing, you can still get Olympics souvenir pins on the Games’ official online shop. Prices there start at around €15, but resellers are putting them up for twice as much. Limited-edition pins from sponsors like Samsung go for around €100 ($118). WIRED Italia spotted pins given to Olympic torchbearers online for around €600 ($707). Also available? Replicas of Olympic medals, which start at around €50 for a single medal and €150 to €200 ($177 to"
      }
    ]
  },
  "AI": {
    "summary": "## Executive Summary\nSarvam, an Indian AI startup, has launched its Indus chat app, entering a market dominated by global players. The US Pentagon is reconsidering its relationship with Anthropic, a major AI company, due to its objections to participating in certain military operations. The Trump administration has repealed restrictions on toxic pollutants from power plants, which could impact the environment as AI demand for energy increases. Meanwhile, the creator economy is evolving, with creators diversifying beyond ad revenue. Data centers are being built at a rapid pace to support the AI boom, raising concerns about energy consumption and water usage.\n\n## Market & Business Implications\n* Sarvam has launched its Indus chat app, which serves as a chat interface for its newly announced Sarvam 105B model, and has raised $41 million to date (Article 1).\n* The Pentagon is reconsidering its $200 million contract with Anthropic due to the company's objections to participating in certain military operations (Article 2).\n* The Trump administration has repealed the Mercury and Air Toxics Standards, which could make power generation dirtier and impact the environment as AI demand for energy increases (Article 3).\n* The creator economy is evolving, with creators launching product lines and acquiring startups to diversify beyond ad revenue (Article 4).\n* Data centers are being built at a rapid pace to support the AI boom, with some considering building data centers in space to reduce energy consumption and water usage (Article 5).\n\n## Beginner-Friendly Summary\nThere's a new chat app called Indus from a company called Sarvam. The US military is having issues with a company called Anthropic because they don't want to help with certain military actions. The government has also changed some rules that might make the air dirtier because of how much energy is needed for artificial intelligence. Some people who make content online are finding new ways to make money beyond just ads. And because artificial intelligence needs a lot of energy, people are building special centers to support it, which is causing some problems.",
    "articles": [
      {
        "title": "India’s Sarvam launches Indus AI chat app as competition heats up",
        "link": "https://techcrunch.com/2026/02/20/indias-sarvam-launches-indus-ai-chat-app-as-competition-heats-up/",
        "published": "Sat, 21 Feb 2026 01:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Sarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users, entering a fast-growing market dominated by global players including OpenAI, Anthropic, and Google.\n\nThe launch comes as India has become a key battleground for generative AI adoption. Recently, OpenAI CEO Sam Altman said ChatGPT has more than 100 million weekly active users in India, while Anthropic said India accounts for 5.8% of total Claude usage, second only to the U.S.\n\nIndus serves as a chat interface for its newly announced Sarvam 105B model, the company’s 105-billion-parameter large language model. The app’s launch comes two days after Bengaluru-based Sarvam unveiled its 105B and 30B models at the India AI Impact Summit in New Delhi earlier this week. At the summit, the startup also outlined enterprise initiatives and hardware plans and announced partnerships with companies including HMD to bring AI to Nokia feature phones and Bosch for AI-enabled automotive applications.\n\nCurrently available in beta on iOS, Android, and the web, the Indus app allows users to type or speak queries and receive responses in text and audio. Users can sign in using their phone number, Google or Microsoft account, or Apple ID, though the service appears to be limited to India for now.\n\nImage Credits:Jagmeet Singh / TechCrunch\n\nThe app currently comes with some limitations. Users cannot delete their chat history without deleting their account, and there is no option to turn off the app’s reasoning feature, which can sometimes slow response times. Sarvam has also warned that access may be restricted as it gradually expands its compute capacity.\n\n“We’re gradually rolling out Indus on a limited compute capacity, so you may hit a waitlist at first. We will expand access over time,” Sarvam co-founder Pratyush Kumar wrote on X, adding that the company is seeking feedback from users.\n\nFounded in 2023, Sarvam has raised $41 million to date"
      },
      {
        "title": "AI Safety Meets the War Machine",
        "link": "https://www.wired.com/story/backchannel-anthropic-dispute-with-the-pentagon/",
        "published": "Fri, 20 Feb 2026 17:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "When Anthropic last year became the first major AI company cleared by the US government for classified use—including military applications—the news didn’t make a major splash. But this week a second development hit like a cannonball: The Pentagon is reconsidering its relationship with the company, including a $200 million contract, ostensibly because the safety-conscious AI firm objects to participating in certain deadly operations. The so-called Department of War might even designate Anthropic as a “supply chain risk,” a scarlet letter usually reserved for companies that do business with countries scrutinized by federal agencies, like China, which means the Pentagon would not do business with firms using Anthropic’s AI in their defense work. In a statement to WIRED, chief Pentagon spokesperson Sean Parnell confirmed that Anthropic was in the hot seat. “Our nation requires that our partners be willing to help our warfighters win in any fight. Ultimately, this is about our troops and the safety of the American people,” he said. This is a message to other companies as well: OpenAI, xAI and Google, which currently have Department of Defense contracts for unclassified work, are jumping through the requisite hoops to get their own high clearances.\n\nThere’s plenty to unpack here. For one thing, there’s a question of whether Anthropic is being punished for complaining about the fact that its AI model Claude was used as part of the raid to remove Venezuela's president Nicolás Maduro (that’s what’s being reported; the company denies it). There’s also the fact that Anthropic publicly supports AI regulation—an outlier stance in the industry and one that runs counter to the administration’s policies. But there’s a bigger, more disturbing issue at play. Will government demands for military use make AI itself less safe?\n\nResearchers and executives believe AI is the most powerful technology ever invented. Virtually all of the current AI companies were founded on the premise that i"
      },
      {
        "title": "Trump is making coal plants even dirtier as AI demands more energy",
        "link": "https://www.theverge.com/science/882288/trump-ai-data-center-power-plant-pollution-mercury-mats",
        "published": "2026-02-20T15:18:34-05:00",
        "source": "AI | The Verge",
        "text": "Posts from this author will be added to your daily email digest and your homepage feed.\n\nThe Trump administration just tossed out Biden-era restrictions on mercury and other toxic pollutants from power plants. It’s repealing Mercury and Air Toxics Standards (MATS) just as electricity demand in the US ticks up with the buildout of new AI data centers.\n\nThose standards are particularly impactful when it comes to pollution from coal plants responsible for around half of mercury emissions in the US. Mercury is a neurotoxin; high exposure has been linked to birth defects and learning disabilities in children. Exposure can also impact the kidneys and nervous system.\n\nTrump’s deregulation spree aims to make it easier to quickly construct new data centers and fossil fuel infrastructure to power them\n\nAnd yet the Trump administration is making power generation dirtier as the nation’s electricity needs grow with more data centers, domestic manufacturing, and electric vehicles. President Donald Trump’s deregulation spree aims to make it easier to quickly construct new data centers and fossil fuel infrastructure to power them — including coal plants.\n\n“The Trump administration is wiping out health protections critical for protecting children from toxins like mercury just to save the coal industry some money,” Nicholas Morales, an attorney with nonprofit environmental law group Earthjustice, said in a press release today.\n\nThe Environmental Protection Agency (EPA) finalized its repeal of Mercury and Air Toxics Standards that the Biden administration strengthened in 2024. The Trump administration is rolling the standards back to where they were in 2012 when the Obama administration initially instituted them. Weakening the regulations is supposed to save $78 million each year starting in 2028, according to an EPA fact sheet."
      },
      {
        "title": "The creator economy’s ad revenue problem and India’s AI ambitions",
        "link": "https://techcrunch.com/video/the-creator-economys-ad-revenue-problem-and-indias-ai-ambitions/",
        "published": "Fri, 20 Feb 2026 23:00:00 +0000",
        "source": "AI News & Artificial Intelligence | TechCrunch",
        "text": "Loading the player…\n\nThe creator economy is evolving fast, and ad revenue alone isn’t cutting it anymore. YouTubers are launching product lines, acquiring startups, and building actual business empires. In fact, MrBeast’s company bought fintech startup Step, and his chocolate business is outearning his media arm. This isn’t just one creator’s strategy. For many, it’s the new playbook.\n\nOn this episode of TechCrunch’s Equity podcast, hosts Kirsten Korosec, Anthony Ha, and Rebecca Bellan unpack how creators are diversifying beyond ads, whether their model can scale beyond the top 1%, everything happing at India’s AI Impact Summit, and more of the week’s headlines."
      },
      {
        "title": "Could AI Data Centers Be Moved to Outer Space?",
        "link": "https://www.wired.com/story/could-we-put-ai-data-centers-in-space/",
        "published": "Fri, 20 Feb 2026 12:00:00 +0000",
        "source": "Feed: Artificial Intelligence Latest",
        "text": "Data centers are being built at a frantic pace all over the world, driven by the AI boom. These facilities consume staggering amounts of electricity. By 2028, AI servers alone may use as much energy as 22 percent of US households. Of course that demand will raise energy prices for everyone, and we’ll need more power plants, which means more global warming.\n\nThen there’s the water problem. High-density AI chips run so hot that air cooling isn’t enough. New facilities are turning to liquid cooling. The technique of choice is water evaporation. It’s more effective and energy-efficient than recirculating water, but a large data center using this method consumes millions of gallons of water a day, draining local water supplies.\n\nSo it’s no surprise that more and more towns are pushing back on data center projects in their area. But if everyone goes NIMBY, it gets sort of NOMPY—like “not on my planet, you bastards.” What to do? People aren’t going to stop using AI. That’s why some folks are saying we should build data centers in space.\n\nJust think: You could get 24/7 energy from solar panels—it’s always sunny in space—and the thermal stuff wouldn’t be an issue because it’s so cold out there. You could do the heavy processing in orbiting data centers and beam the results back to Earth just like satellite internet. That’s the claim, anyway.\n\nCould this really work? Or is it about as practical as colonizing Mars? I asked Google’s AI Overview, and it said, “Yes, data centers can be built in space.” But of course it would say that. I think we’ll have to go full renegade and dial up some old-fashioned human intelligence on this.\n\nPower Up\n\nOne of the really big ideas in science is called conservation of energy. This says that for any “system” (any collection of things we pick), the total energy going into the system equals the change in energy of that system plus the energy going out of the system:\n\nOr rearranging, any change in the amount of energy in a system equals the diffe"
      }
    ]
  },
  "Finance": {
    "summary": "## Executive Summary\nPresident Donald Trump has announced a new 10% global tariff, which will take effect almost immediately, following a Supreme Court ruling that struck down his previous tariffs. Meanwhile, Ford Motor Company's stock has had a total return of 63% over the past five years, underperforming the S&P 500 index. Additionally, experts are discussing the importance of saving and investing, with some suggesting that saving as little as $20,000 can be a significant step towards financial freedom. Trump is also considering a limited military strike against Iran, which could impact the global oil trade.\n\n## Market & Business Implications\n* A $1,000 investment in Ford shares five years ago would be worth $1,630 today, with the company's stock underperforming the S&P 500 index (Article 1).\n* The new 10% global tariff announced by President Trump will replace previous tariffs that were struck down by the Supreme Court, potentially lowering U.S. tariff rates for some countries (Article 2).\n* Artificial intelligence is being used in the restaurant industry to improve efficiency and reduce labor costs, with benefits including the ability to manage inventory and track labor costs (Article 3).\n* Saving $20,000 can be a significant step towards financial freedom, as it allows individuals to take advantage of compound interest and earn returns on their investments (Article 4).\n* A potential conflict between the U.S. and Iran could disrupt oil flows through the Strait of Hormuz, a vital chokepoint for the global oil trade (Article 5).\n\n## Beginner-Friendly Summary\nThe US President, Donald Trump, has introduced a new tax on imported goods from around the world. Meanwhile, a big car company called Ford hasn't done as well as other companies on the stock market. Some experts think that saving money is important, and even saving a small amount can help. Trump is also thinking about taking military action against a country called Iran, which could affect the price of oil.",
    "articles": [
      {
        "title": "If You'd Invested $1,000 in Ford 5 Years Ago, Here's How Much You'd Have Today",
        "link": "https://finance.yahoo.com/news/youd-invested-1-000-ford-132000176.html",
        "published": "2026-02-21T13:20:00Z",
        "source": "Yahoo Finance",
        "text": "Thanks to its long history as one of the leaders of the domestic auto industry, Ford Motor Company (NYSE: F) is a company that investors are familiar with. Though, this doesn't mean it has been a wildly successful addition to portfolios.\n\nIf you'd invested $1,000 in Ford shares exactly five years ago, here's how much you'd have today.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now, when you join Stock Advisor. See the stocks »\n\nImage source: Getty Images.\n\nFord is a market underperformer\n\nFord produced a total return of 63% in the past five years (as of Feb. 17). This means that a $1,000 investment would be worth $1,630 today. The gain lags the S&P 500 index, which put up a total return of 87%.\n\nLet's look at the positive and negative developments that have influenced this automotive stock over the past half-decade.\n\nThe good\n\nFord has maintained its leadership position atop the market for pickup trucks. Last year was the 44th straight year that the F-Series lineup was the best-selling vehicle in America. These vehicles have pricing power and support high margins for the company.\n\nFord pro, the segment that sells cars, software, and services to commercial and government customers, was a notable bright spot. Its growth and profitability are generally better than that of the overall business. And it introduces a recurring revenue stream.\n\nBesides 2022, the business generated positive free cash flow each year over the past half-decade. That supports Ford's ongoing dividend, which currently yields 4.25%. Income investors might find this compelling.\n\nThe bad\n\nOn the other hand, there were many negative trends that Ford has had to deal with.\n\nIts electric vehicle (EV) segment, called model e, is one clear example. Billions upon billions of dollars in operating losses and weaker-than-expected demand finally forced the management team to shift its focus toward lower-priced EV models and hybrid vehi"
      },
      {
        "title": "Trump announces new 10% global tariff after raging over Supreme Court loss",
        "link": "https://www.cnbc.com/2026/02/20/trump-global-trade-tariff-supreme-court.html",
        "published": "Sat, 21 Feb 2026 01:31:14 GMT",
        "source": "US Top News and Analysis",
        "text": "President Donald Trump on Friday evening said he signed an executive order imposing a new 10% \"global tariff,\" hours after the Supreme Court struck down his sweeping \"reciprocal\" import duties in a major rebuke of his trade agenda.\n\nThe \"Section 122\" tariffs will take effect \"almost immediately,\" Trump said in a Truth Social post.\n\nThey come on top of the levies that remain intact following the high court's decision, which invalidated the tariffs Trump had imposed using the International Emergency Economic Powers Act, or IEEPA.\n\nAt a White House press briefing Friday afternoon, Trump railed against the \"deeply disappointing\" 6-3 ruling.\n\n\"I'm ashamed of certain members of the court, absolutely ashamed for not having the courage to do what's right for our country,\" Trump said.\n\nThe ruling threw out the legal underpinning for many of the tariffs that Trump insists are essential for the U.S. economy and for rebuilding America's shrinking manufacturing base.\n\nTrump's reciprocal tariffs and his drug-trafficking-related duties both hinged on his administration's expansive interpretation of IEEPA. But the court's majority ruled Friday that IEEPA \"does not authorize the President to impose tariffs.\"\n\nThe new 10% global tariffs, which come with a 150-day time limit, will effectively replace the IEEPA duties, a White House official told CNBC later Friday.\n\nThat could mean lower U.S. tariff rates for some of the countries that had either struck trade deals with the Trump administration, or were in ongoing trade talks.\n\nThat's because many of those countries and regions had faced U.S. tariffs higher than 10% as part of those agreements. The European Union, for example, agreed to a 15% tariff as part of its trade deal with the U.S.\n\nThose tariffs were largely implemented under IEEPA, meaning they were invalidated as a result of the Supreme Court's ruling.\n\nThe shake-up could be significant for China, which faced two sets of 10% IEEPA-based U.S. tariffs in addition to a 25% duty "
      },
      {
        "title": "Jon Taffer says AI 'doesn’t get sick' as restaurants struggle to find workers",
        "link": "https://www.foxbusiness.com/media/jon-taffer-says-ai-doesnt-get-sick-as-restaurant-struggle-find-workers",
        "published": "Sat, 21 Feb 2026 07:00:10 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Artificial intelligence is quietly reshaping restaurant operations, but not necessarily in the way diners might expect.\n\nAs labor shortages persist and costs remain elevated, \"Bar Rescue\" host Jon Taffer joined FOX Business’ Stuart Varney on \"Varney & Co.\" to say that technology is becoming a critical back-of-house tool rather than a front-facing replacement for hospitality.\n\nTaffer explained that staffing challenges are pushing operators to look for new efficiencies.\n\n\"We're struggling to find people. The male workforce is declining in America… So finding employees is difficult… AI is a great way to provide efficiency and streamline operations,\" he said.\n\nLAWMAKERS DEBATE AI’S IMPACT ON WHITE-COLLAR JOBS AS DISRUPTION FEARS GROW\n\nRather than placing machines between customers and staff, Taffer emphasized that human interaction remains central to the dining experience.\n\n\"I don't put AI in the front of the house. I don't want you interacting with the machine. I want you to be interacting with people. I think that connectivity is very important,\" he said.\n\nInstead, AI is deployed behind the scenes, where it can directly impact margins.\n\n\"All of my AI is back of the house. We manage inventory. We manage order process. We track ticket times. We track all of these incentives. We can track labor costs down to the moment. But AI in the back of house is a powerful, powerful asset for us. It can save us considerable dollars,\" Taffer said.\n\nThe financial case, he said, is straightforward.\n\n\"It doesn't get sick.\"\n\nTaffer has decades of hands-on industry experience as a longtime, no-nonsense hospitality consultant. He has built a reputation on helping struggling restaurants while preserving the human connection that sits at the heart of the business."
      },
      {
        "title": "Charlie Munger said saving $100K creates the fast track to wealth, but here’s why just 20K can set you up for success",
        "link": "https://finance.yahoo.com/news/charlie-munger-said-saving-100k-130000914.html",
        "published": "2026-02-21T13:00:00Z",
        "source": "Yahoo Finance",
        "text": "Munger’s $100,000 benchmark has math on its side. But in reality, most families struggle to set aside six figures as they battle stagnant wages and rapidly rising costs of living.\n\nHere’s why maximizing savings with compound interest unlocks your wealth potential — and what you can do to hit your goal and discover financial freedom.\n\nEither way, whether the magic number is five or six figures, it’s clear the experts agree on one thing: When it comes to investing in your financial future, compound interest is the best friend to your savings.\n\nIn her words, “It’s like planting a tree that grows even more trees for you.”\n\n“Compound interest is one of the most powerful forces in finance,” she said (2). “And once you hit 20K, you’ll see exactly what it means. Your money doesn’t just sit there anymore. It starts earning returns. And then those returns start earning their own returns.”\n\nFinancial YouTuber Nischa Shah explains that once you’ve saved just 20 grand, you can begin taking advantage of the power of compound interest in your investments. More importantly, you can stop being driven by fear — and not have to take the first job you’re offered or stay in a role you hate because you lack other options.\n\nBut not everybody agrees. Some financial advice gurus are saying there’s freedom to be had with numbers as low as $20,000.\n\nMunger’s six-figure fixation might seem a bit arbitrary at first, but his reason behind it was actually simple: Six figures are where the real power of compounding is unlocked. Once you cross this critical threshold, your money earns more money at a meaningful scale.\n\n“I don’t care what you have to do,” he continued. “If it means walking everywhere and not eating anything that wasn’t purchased with a coupon, find a way to get your hands on $100,000. After that, you can ease off the gas a little bit.”\n\nMost Americans earn a dismal 0.39% APY on their cash at big banks. Unlock up to 4.05% APY and pay $0 in account fees instead with a Wealthfront Cash"
      },
      {
        "title": "Trump says he's considering limited military strike against Iran",
        "link": "https://www.cnbc.com/2026/02/20/trump-says-hes-considering-limited-military-strike-against-iran.html",
        "published": "Sat, 21 Feb 2026 11:40:01 GMT",
        "source": "US Top News and Analysis",
        "text": "An aerial view of the USS Abraham Lincoln Carrier Strike Group while operating at the Arabian Sea, escorted by two military replenishment ships and two U.S. Coast Guard vessels, as fighter jets from Carrier Air Wing Nine conducted flight operations overhead in the Arabian Sea, on February 6, 2026.\n\nPresident Donald Trump said Friday that he is considering limited military strikes to pressure Iran over its nuclear program.\n\n\"I guess I can say I am considering that,\" Trump said when asked by a reporter at a White House breakfast with U.S. governors.\n\nTrump said Thursday that he would make a decision in the next 10 to 15 days on whether to attack the Islamic Republic. He has left open the possibility that a deal could still be reached with Tehran over its nuclear program.\n\nTrump has previously said an attack on Iran would be \"far worse\" than the limited strikes launched by the U.S. in June against its nuclear facilities.\n\nOil prices were stable Friday after rallying more than 5% this week as traders price in some risk of imminent U.S. military action. U.S. crude oil fell 4 cents to close at $66.39 per barrel. Global benchmark Brent rose 10 cents to settle at $71.76 per barrel.\n\nA massive U.S. military buildup is underway in the Middle East. The USS Abraham Lincoln aircraft carrier is in the region. A second aircraft carrier, the USS Gerald Ford, is en route.\n\nThe oil market's biggest fear is that a conflict between the U.S. and Iran could lead to a prolonged disruption of oil flows through the Strait of Hormuz.\n\nThe strait is a vital chokepoint for the global oil trade. More than 14 million barrels per day of oil and condensates passed through the narrow waterway on average in 2025, according to data from consulting firm Kpler, which says that amount accounts for a third of total worldwide seaborne oil exports.\n\nAbout three-quarters of the oil that passes through the strait goes to China, India, Japan and South Korea, according to Kpler."
      }
    ]
  },
  "World News": {
    "summary": "## Executive Summary\nBritish police have arrested former Prince Andrew on suspicion of \"misconduct in public office\". A UN-mandated fact-finding mission has found that the siege of El Fasher in Sudan has \"hallmarks of genocide\". The US has imposed a new 10% global levy after the Supreme Court rejected Trump's global import taxes. Additionally, Cuban security forces have exited Venezuela, and Quebec is renewing historic trails to boost winter tourism.\n\n## Market & Business Implications\n* The arrest of former Prince Andrew may have implications for the British monarchy, as reported by NPR.\n* The situation in Sudan, including the siege of El Fasher and drone strikes, may affect businesses operating in the region, as reported by The Guardian.\n* The US has introduced a new 10% global levy, as announced by Trump after the Supreme Court rejected his global import taxes, according to BBC News.\n* The exit of Cuban security forces from Venezuela may have implications for regional trade and security, as reported by Reuters.\n* The renewal of historic trails in Quebec may boost winter tourism and have a positive impact on local businesses, as reported by NPR.\n\n## Beginner-Friendly Summary\nSomething big happened in the UK - a former prince was arrested. There's also a very serious situation in a country called Sudan, where many people are being hurt. The US president, Trump, is putting a new tax on things imported from other countries. Meanwhile, some soldiers from Cuba left Venezuela, and a place called Quebec is fixing old trails to help tourism.",
    "articles": [
      {
        "title": "Recent updates on the arrest of former Prince Andrew",
        "link": "https://www.npr.org/2026/02/21/nx-s1-5719503/recent-updates-on-the-arrest-of-former-prince-andrew",
        "published": "Sat, 21 Feb 2026 07:44:31 -0500",
        "source": "NPR Topics: World",
        "text": "Recent updates on the arrest of former Prince Andrew British police arrested the former Prince Andrew on suspicion of \"misconduct in public office.\" NPR's Scott Simon speaks to royal expert Jennie Bond about the latest developments.\n\nWorld Recent updates on the arrest of former Prince Andrew Recent updates on the arrest of former Prince Andrew Audio will be available later today. British police arrested the former Prince Andrew on suspicion of \"misconduct in public office.\" NPR's Scott Simon speaks to royal expert Jennie Bond about the latest developments. Sponsor Message Sponsor Message"
      },
      {
        "title": "Exclusive: Cuban security forces exit Venezuela as US pressure mounts - Reuters",
        "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQLUpOZlNMNUV4TzFHR1dTR1ZZYncyNlFoVkFYcUdKZkZHWUV5cmJXQzFnOXF3aXNIaHR1X1NOcEN1OHZnRnR4Qmk2XzVFY0tlbEtFMkRkaXVrdDFnXzFMXzFuaG80RnQwQkZFOW01ZVJGTXJCV1JvMWh6WVI4anZmYTFWVWhodEZJYXVydkg5VU93VFpfSnhraWZLOUVPZ09lakIwdHFNaFJoUQ?oc=5",
        "published": "Sat, 21 Feb 2026 11:06:02 GMT",
        "source": "\"site:reuters.com\" - Google News",
        "text": ""
      },
      {
        "title": "RSF siege of El Fasher in Sudan has ‘hallmarks of genocide’, UN mission finds",
        "link": "https://www.theguardian.com/world/2026/feb/19/rsf-siege-el-fasher-sudan-hallmarks-of-genocide-un-mission-north-darfur",
        "published": "Thu, 19 Feb 2026 17:59:17 GMT",
        "source": "World news | The Guardian",
        "text": "The siege and capture of the Sudanese city of El Fasher by the paramilitary Rapid Support Forces group last October bore “the hallmarks of genocide”, a UN-mandated fact-finding mission has said.\n\nIn a report detailing the harrowing 18-month occupation of the capital of North Darfur, investigators concluded that the RSF and allied militias deliberately inflicted conditions calculated to bring about the physical destruction of the Zaghawa and Fur ethnic communities.\n\n“The scale, coordination, and public endorsement of the operation by senior RSF leadership demonstrate that the crimes committed in and around El Fasher were not random excesses of war,” said Mohamed Chande Othman, the mission’s chair, who called for a thorough investigation of the perpetrators.\n\nView image in fullscreen A massive fire at a displacement camp in Sudan killed one child, injured other people and left homeless hundreds who had already had to flee to escape the fighting ravaging the country. Photograph: AFP/Getty Images\n\nThe report was published a day after the UK, Canada and the European Union denounced possible war crimes and crimes against humanity in Sudan during the nearly three-year war.\n\nIts release coincides with the latest wave of drone strikes that have left dozens dead across Sudan’s Kordofan region, an area where the UN has consistently said that grave abuses are taking place.\n\nUnicef said at least 15 children were killed this week when a drone struck a displacement camp in West Kordofan. Local rights defenders reported that another strike on a market in nearby North Kordofan left 28 people dead. Blame for the West Kordofan attack has been directed at the Sudanese army; while the RSF has been accused of carrying out the strike in North Kordofan.\n\nSince April 2023, the RSF has been waging war against the army after a falling out between its commander, Muhammad Hamdan Dagalo, and the army chief, Abdel Fattah al-Burhan, former allies who came to power after the 2019 Sudanese revolutio"
      },
      {
        "title": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
        "link": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss",
        "published": "Sat, 21 Feb 2026 11:58:18 GMT",
        "source": "BBC News",
        "text": "Trump says he's 'ashamed' of Supreme Court judges over tariffs ruling\n\nThe president also said that in an effort to \"protect\" the US, he will charge more under other statutes and announced a new 10% global levy."
      },
      {
        "title": "Quebec renews historic trails for future generations",
        "link": "https://www.npr.org/2026/02/21/nx-s1-5633285/quebec-renews-historic-trails-for-future-generations",
        "published": "Sat, 21 Feb 2026 07:44:27 -0500",
        "source": "NPR Topics: World",
        "text": "Quebec renews historic trails for future generations Backwoods ski trails Quebec residents used to get from village to village a century ago are luring outdoor enthusiasts and boosting winter tourism.\n\nWorld Quebec renews historic trails for future generations Quebec renews historic trails for future generations Audio will be available later today. Backwoods ski trails Quebec residents used to get from village to village a century ago are luring outdoor enthusiasts and boosting winter tourism. Sponsor Message Sponsor Message"
      }
    ]
  },
  "Business": {
    "summary": "## Executive Summary\nThe business world is seeing various developments, including the impact of a viral baby monkey on Ikea's sales, the use of artificial intelligence in restaurants to streamline operations, and changes in the toy industry with Hasbro outperforming Mattel. President Trump has announced a new 10% global tariff, and his administration is struggling to allocate an additional $500 billion for military spending. These events reflect the diverse challenges and opportunities facing businesses and policymakers.\n\n## Market & Business Implications\n* According to Article 1, a viral baby monkey's preference for an Ikea comfort toy has led to the toy selling out, highlighting the potential impact of social media on consumer demand.\n* As stated in Article 2, Jon Taffer believes that AI can provide efficiency and streamline restaurant operations, particularly in the back-of-house, without replacing human interaction with customers.\n* Article 4 notes that Hasbro's revenue grew 14% in the fiscal year 2025, reaching $4.7 billion, while Mattel's net sales dropped 1% to $5.3 billion, indicating a widening gap between the two toy makers.\n* Article 3 reports that President Trump has introduced a new 10% global tariff, following a Supreme Court ruling on his global import taxes.\n* As mentioned in Article 5, the Trump administration is facing challenges in allocating an additional $500 billion for military spending, with discussions focusing on the balance between existing weapons and new technologies like artificial intelligence.\n\n## Beginner-Friendly Summary\nThere are some big things happening in the business world. A baby monkey that became famous on the internet loves a toy from Ikea, and now that toy is sold out. Some restaurants are using computers to help with work behind the scenes. A company called Hasbro is doing better than another company called Mattel when it comes to selling toys. The president has announced a new tax on things imported from other countries. The government is also trying to figure out how to spend a lot of extra money on the military.",
    "articles": [
      {
        "title": "After lonely baby monkey goes viral, his Ikea comfort toy sells out",
        "link": "https://www.washingtonpost.com/lifestyle/2026/02/21/monkey-punch-japan-lonely-ikea/",
        "published": "Sat, 21 Feb 2026 12:00:29 +0000",
        "source": "Business",
        "text": "What’s it like to have millions of fans but struggle to make friends? For Punch, a 7-month-old macaque, fame and loneliness have collided, leaving the world watching as he clings to a stuffed orangutan toy from Ikea. Punch was abandoned shortly after birth and raised by the staff at the Ichikawa City Zoo outside Tokyo. Baby monkeys often clutch their mothers for comfort and security, so the staff gave Punch a surrogate. He carries the toy around with him and runs back to it for comfort when scolded or rejected by other monkeys, according to a statement on X from the zoo.\n\nThe zoo and botanical garden has been posting regularly about Punch’s progress as he tries to integrate with the other macaques after moving in with them last month at the zoo’s “Monkey Mountain.” The baby monkey now has masses of dedicated human fans around the world cheering him on — though he’s still learning how to socialize with his own species.\n\nVideos have gone viral showing Punch looking lonesome and snuggling with his soft toy, or approaching other monkeys in the enclosure with varying degrees of success. Some videos show Punch being outright rejected by the group of primates, or even seemingly bullied.\n\nIn a statement posted Friday on X, the zoo confirmed that videos of Punch being dragged by other monkeys seemed to be authentic and explained that this is part of his journey as he learns how to be a monkey without his mother to show him the ropes.\n\n“Punch has been scolded by other monkeys many times in the past and has learned how to socialize with them,” the statement said.\n\nThe zoo staff also noted that after moments of conflict with other monkeys, Punch runs back to his comfort object — his stuffed toy orangutan. When he feels safe again, he will leave his toy and return to his peers.\n\nAn abandoned monkey named Punch went viral after he was filmed clinging to the stuffed toy — his \"surrogate mother.\" Now, he's building up his social skills. (Video: The Washington Post)\n\nPunch has also "
      },
      {
        "title": "Jon Taffer says AI 'doesn’t get sick' as restaurants struggle to find workers",
        "link": "https://www.foxbusiness.com/media/jon-taffer-says-ai-doesnt-get-sick-as-restaurant-struggle-find-workers",
        "published": "Sat, 21 Feb 2026 07:00:10 -0500",
        "source": "Latest Business News on Fox Business",
        "text": "Artificial intelligence is quietly reshaping restaurant operations, but not necessarily in the way diners might expect.\n\nAs labor shortages persist and costs remain elevated, \"Bar Rescue\" host Jon Taffer joined FOX Business’ Stuart Varney on \"Varney & Co.\" to say that technology is becoming a critical back-of-house tool rather than a front-facing replacement for hospitality.\n\nTaffer explained that staffing challenges are pushing operators to look for new efficiencies.\n\n\"We're struggling to find people. The male workforce is declining in America… So finding employees is difficult… AI is a great way to provide efficiency and streamline operations,\" he said.\n\nLAWMAKERS DEBATE AI’S IMPACT ON WHITE-COLLAR JOBS AS DISRUPTION FEARS GROW\n\nRather than placing machines between customers and staff, Taffer emphasized that human interaction remains central to the dining experience.\n\n\"I don't put AI in the front of the house. I don't want you interacting with the machine. I want you to be interacting with people. I think that connectivity is very important,\" he said.\n\nInstead, AI is deployed behind the scenes, where it can directly impact margins.\n\n\"All of my AI is back of the house. We manage inventory. We manage order process. We track ticket times. We track all of these incentives. We can track labor costs down to the moment. But AI in the back of house is a powerful, powerful asset for us. It can save us considerable dollars,\" Taffer said.\n\nThe financial case, he said, is straightforward.\n\n\"It doesn't get sick.\"\n\nTaffer has decades of hands-on industry experience as a longtime, no-nonsense hospitality consultant. He has built a reputation on helping struggling restaurants while preserving the human connection that sits at the heart of the business."
      },
      {
        "title": "Trump brings in new 10% tariff as Supreme Court rejects his global import taxes",
        "link": "https://www.bbc.com/news/articles/cn8146l0n55o?at_medium=RSS&at_campaign=rss",
        "published": "Sat, 21 Feb 2026 11:58:18 GMT",
        "source": "BBC News",
        "text": "Trump says he's 'ashamed' of Supreme Court judges over tariffs ruling\n\nThe president also said that in an effort to \"protect\" the US, he will charge more under other statutes and announced a new 10% global levy."
      },
      {
        "title": "Under mounting toy pressures, Hasbro has a secret sauce that Mattel hasn't matched",
        "link": "https://www.cnbc.com/2026/02/21/hasbro-vs-mattel-toy-industry-pressures-make-digital-the-star.html",
        "published": "Sat, 21 Feb 2026 13:00:01 GMT",
        "source": "Business News",
        "text": "In this article MAT\n\nHAS Follow your favorite stocks CREATE FREE ACCOUNT\n\nwatch now\n\nThe gap is widening between rival toy makers Hasbro and Mattel — thanks in part to a 30-year-old trading card game. The toy giants have flip-flopped dominance in the space for decades, jockeying for the most coveted master licenses to put new fan favorites — Disney princesses and \"Star Wars\" characters among them — on store shelves. But as the industry recovers from a period of declining sales, Hasbro is the one winning over Wall Street. For the fiscal year 2025, Hasbro reported revenue gains of 14%, reaching $4.7 billion, while Mattel saw its net sales drop 1% to $5.3 billion. Though Mattel's revenue is larger than Hasbro's, its growth has been stagnating, according to Eric Handler, managing director and senior research analyst at Roth Capital Partners. \"[Mattel's] revenue has been in a very tight range for five years now, and 2026, on an organic basis, is the same,\" he told CNBC. Mattel shares are down more than 20% in the last 12 months, trading at around $17. Meanwhile, Hasbro's stock is up roughly 46% over the same period, with shares trading at around $100. Of course, Hasbro's journey post-pandemic has not been without its own headwinds. The company's revenue took a hit when it divested its film and TV business, eOne. Also, its entertainment segment, which includes film and TV licenses, was deeply impacted by Hollywood's dual labor strikes in 2023. \"Despite market volatility and a shifting consumer environment, we returned this company to growth in a meaningful way,\" Hasbro CEO Chris Cocks told investors during an earnings call earlier this month. Throughout these changes, one key piece of Hasbro's business has been steadily growing — Wizards of the Coast.\n\nA dash of Magic\n\nThe Hasbro division includes Dungeons & Dragons, Magic: The Gathering and the company's portfolio of digital and video games. In 2025, Wizards' revenue grew 45% to $2.1 billion, fueled by sales of sets tied"
      },
      {
        "title": "Trump aides struggle with how to spend $500 billion more on military",
        "link": "https://www.washingtonpost.com/business/2026/02/21/trump-hegseth-budget-military/",
        "published": "Sat, 21 Feb 2026 11:00:00 +0000",
        "source": "Business",
        "text": "Trump administration officials have struggled to figure out how to increase U.S. military spending by a whopping $500 billion in their forthcoming budget, slowing the overall White House spending plan, four people familiar with the matter said. President Donald Trump last month agreed to a roughly 50 percent funding boost sought by Pete Hegseth, the defense secretary, in the White House’s annual budget proposal. The idea ran into internal criticism from several other officials, including White House budget chief Russell Vought, who warned about its potential impact on the widening federal deficit, said the people, who spoke on the condition of anonymity to reflect internal deliberations.\n\nSince Trump agreed to the higher number, White House aides and defense officials have run into logistical challenges surrounding where to put the money, because the amount is so large, the people said. The White House is more than two weeks behind its statutory deadline to send its budget proposal to Congress, in part because it is unclear how precisely to spend the additional $500 billion, according to the people familiar with the matter.\n\nSenior Pentagon officials have consulted with former senior defense officials as they grapple with the challenge, said one person familiar with the matter. Part of the discussion centers on how much emphasis should go into buying weapons the military already uses versus investing in high-end technologies, such as artificial intelligence, that the Pentagon envisions as part of its future.\n\nThe roughly $900 billion defense budget approved last year was the largest in U.S. history. While other nations have also increased their military spending, the United States already spends more on defense than the next nine countries combined, according to 2023 data from the Peter G. Peterson Foundation, a nonpartisan think tank.\n\n“I’m not surprised they’re having difficulty doing that,” said G. William Hoagland, senior vice president at the Bipartisan Policy "
      }
    ]
  },
  "Stock Market": {
    "summary": "## Executive Summary\nThe stock market has seen various developments, including Ford's total return of 63% in the past five years, which lags the S&P 500 index's total return of 87%. RingCentral and Five9's shares surged after their earnings alleviated concerns about artificial intelligence's impact on their business models. Texas Roadhouse's shares rose despite missing Street estimates due to high beef prices. The software sector has experienced a significant selloff, with the iShares Expanded Tech-Software Sector ETF plunging about 23% this year. \n\n## Market & Business Implications\n* Ford's total return of 63% in the past five years lags the S&P 500 index's total return of 87% (Article 1).\n* RingCentral and Five9's earnings topped Wall Street's estimates, alleviating concerns about artificial intelligence's impact on their business models (Article 2).\n* Texas Roadhouse's shares rose about 2.5% in after-hours trading despite missing Street estimates on both the top and bottom lines in the fourth quarter (Article 4).\n* The iShares Expanded Tech-Software Sector ETF has plunged about 23% this year, led by declines in Atlassian, Unity Software, and Rapid7 (Article 2).\n* Ford's electric vehicle segment, called model e, has been a negative trend for the company (Article 1).\n\n## Beginner-Friendly Summary\nSome big companies have been doing well or not so well in the stock market. Ford, a car company, has made some money but not as much as the overall market. Two other companies, RingCentral and Five9, made people happy with their earnings reports. Texas Roadhouse, a restaurant chain, had a tough quarter but its stock still went up a little. The technology sector has been having a tough time, with many companies losing value.",
    "articles": [
      {
        "title": "If You'd Invested $1,000 in Ford 5 Years Ago, Here's How Much You'd Have Today",
        "link": "https://www.fool.com/investing/2026/02/21/you-invest-1000-ford-5-years-ago-how-much-today/?.tsrc=rss",
        "published": "Sat, 21 Feb 2026 13:20:00 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "While the Detroit auto stock posted a positive total return, it lags the overall market.\n\nThanks to its long history as one of the leaders of the domestic auto industry, Ford Motor Company (F +1.67%) is a company that investors are familiar with. Though, this doesn't mean it has been a wildly successful addition to portfolios.\n\nIf you'd invested $1,000 in Ford shares exactly five years ago, here's how much you'd have today.\n\nFord is a market underperformer\n\nFord produced a total return of 63% in the past five years (as of Feb. 17). This means that a $1,000 investment would be worth $1,630 today. The gain lags the S&P 500 index, which put up a total return of 87%.\n\nLet's look at the positive and negative developments that have influenced this automotive stock over the past half-decade.\n\nThe good\n\nFord has maintained its leadership position atop the market for pickup trucks. Last year was the 44th straight year that the F-Series lineup was the best-selling vehicle in America. These vehicles have pricing power and support high margins for the company.\n\nFord pro, the segment that sells cars, software, and services to commercial and government customers, was a notable bright spot. Its growth and profitability are generally better than that of the overall business. And it introduces a recurring revenue stream.\n\nBesides 2022, the business generated positive free cash flow each year over the past half-decade. That supports Ford's ongoing dividend, which currently yields 4.25%. Income investors might find this compelling.\n\nExpand NYSE : F Ford Motor Company Today's Change ( 1.67 %) $ 0.23 Current Price $ 14.01 Key Data Points Market Cap $56B Day's Range $ 13.72 - $ 14.04 52wk Range $ 8.44 - $ 14.50 Volume 68M Avg Vol 59M Gross Margin 6.52 % Dividend Yield 4.28 %\n\nThe bad\n\nOn the other hand, there were many negative trends that Ford has had to deal with.\n\nIts electric vehicle (EV) segment, called model e, is one clear example. Billions upon billions of dollars in operating lo"
      },
      {
        "title": "Beaten-down software stocks RingCentral and Five9 rally as earnings quell some AI concerns",
        "link": "https://www.cnbc.com/2026/02/20/ringcentral-ring-five9-fivn-rally-ai-sell-off.html",
        "published": "Fri, 20 Feb 2026 23:39:30 GMT",
        "source": "Earnings",
        "text": "Shares of RingCentral and Five9 surged on Friday after earnings from both software firms alleviated recent fears that artificial intelligence is eating away at their business models.\n\nRingCentral popped 34%, while Five9 rallied about 12% after topping Wall Street's estimates and issuing upbeat guidance. Both companies, which provide customer service solutions like voice integration, said accelerating AI adoption has boosted demand.\n\nNew AI tools, capable of building apps and websites in a matter of minutes, have spooked investors in recent weeks, leading to a massive selloff across the software sector.\n\nThe worry is that these products, emerging from the likes of Anthropic and OpenAI, will displace the software-as-a-service industry's longstanding business models as firms lean on quicker and more efficient AI tools.\n\nSo far this year, the iShares Expanded Tech-Software Sector ETF tracking the sector has plunged about 23%, led to the downside by Atlassian , Unity Software and Rapid7 , which have shed more than half their value.\n\nSoftware giants Salesforce and Microsoft have dropped 30% and 18%, respectively."
      },
      {
        "title": "Dow Jones Futures: All Eyes On Nvidia After Stock Market Rallies On Trump Tariff Ruling",
        "link": "https://finance.yahoo.com/m/3a31782f-5969-3157-9772-a6293c1ebb72/dow-jones-futures%3A-all-eyes.html?.tsrc=rss",
        "published": "Sat, 21 Feb 2026 13:11:49 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "There are no important events for this country at this time. Select \"All\" to see top events in other countries or view all events."
      },
      {
        "title": "Texas Roadhouse gets a pass from Wall Street. What's next might be out of its control",
        "link": "https://www.cnbc.com/2026/02/19/texas-roadhouse-gets-a-pass-from-wall-street-whats-next-might-be-out-of-its-control.html",
        "published": "Fri, 20 Feb 2026 00:04:26 GMT",
        "source": "Earnings",
        "text": "Texas Roadhouse missed Street estimates on both the top and bottom lines in the fourth quarter as high beef prices weighed on profits. But the restaurant chain's strong comparable restaurant sales through the first seven weeks of the first quarter of 2026 paired with no change in management's commodity inflation outlook for the year are keeping shares afloat Thursday evening. Revenue in the quarter ending Dec. 30 increased 3.1% year over year to $1.48 billion, missing the LSEG-complied Wall Street consensus estimate of $1.496 billion. Earnings per share dropped 26% on an annual basis to $1.28, missing expectations of $1.51, LSEG data showed. TXRH YTD mountain Texas Roadhouse YTD Shares of Texas Roadhouse rose about 2.5% in after-hours trading to around $187 per share. The move would erase Thursday's regular-hours trading losses. The stock was already off to a good start to 2026, gaining about 10% as of Thursday's close. Bottom line This was a weak quarter from Texas Roadhouse, but the market was giving it a pass because everyone knew beef costs were going to be an issue. On the surface, we were a little underwhelmed by the comp sales growth this quarter. After delivering 6.1% comp growth in the third quarter and guiding 5.4% growth through the first five weeks of the fourth quarter, sales growth slipped back to 4.2% for the entire quarter, missing analyst forecasts of about 5.2%. The 4.2% increase was driven by a 1.9% increase in traffic and 2.3% increase in average check. The results lagged due to a slowdown as the quarter progressed, with comps sales up 6.1%, 4.8% and 2.2% in October, November, and December, respectively. Adverse weather in December may have weighed on the results. Management also called out a negative impact from the timing of Christmas. Usually, this cadence would spell trouble for a restaurant chain or retailer. Positively, though, sluggishness was a temporary trend. One of the best things that came out of this earnings release was the company "
      },
      {
        "title": "Two AI Stocks, Ralph Lauren Lead Five Stocks To Watch Near Buy Points",
        "link": "https://finance.yahoo.com/m/7542d0f3-19dd-3d10-a9bf-6df15db0ed3b/two-ai-stocks%2C-ralph-lauren.html?.tsrc=rss",
        "published": "Sat, 21 Feb 2026 13:00:29 +0000",
        "source": "Yahoo! Finance: ^GSPC ^DJI ^IXIC News",
        "text": "There are no important events for this country at this time. Select \"All\" to see top events in other countries or view all events."
      }
    ]
  },
  "Crypto": {
    "summary": "## Executive Summary\nIoTeX has confirmed a security incident involving one of its token safes, with estimated losses of around $4.3 million. Meanwhile, Bitcoin sell pressure is easing, but large investors, or whales, are continuing to deposit and sell their Bitcoin on exchanges. The European Central Bank's president, Christine Lagarde, is stepping down, which may impact crypto policy in Europe. Additionally, a Trump-backed project is offering a tokenization project for a luxury resort in the Maldives with an exit mechanism for investors. Spot Bitcoin ETFs have recorded five consecutive weeks of net outflows, totaling $3.8 billion.\n\n## Market & Business Implications\n* IoTeX has confirmed a security incident involving one of its token safes, with estimated losses of around $4.3 million, according to onchain investigator Specter (Article 1).\n* The Bitcoin deposited on exchanges has fallen to around 23,000 BTC on average over the last seven days, down from a peak of 60,000 BTC on February 6, indicating easing sell pressure (Article 2).\n* The European Central Bank has consulted on the Markets in Crypto Assets (MiCA) legislation, which defines the crypto landscape in the European Union, but does not regulate decentralized finance (DeFi) (Article 3).\n* World Liberty Financial's tokenization project for a luxury resort in the Maldives will offer an exit mechanism for accredited investors, allowing them to exit their investment if they are not happy with the project's progress (Article 4).\n* Spot Bitcoin ETFs have recorded five consecutive weeks of net outflows, totaling $3.8 billion, with the largest weekly withdrawal occurring in the week ending January 30 (Article 5).\n\n## Beginner-Friendly Summary\nThere was a security problem with a company called IoTeX, and they lost around $4.3 million. Some people are selling their Bitcoin, but not as many as before. The person in charge of a big bank in Europe is leaving, and this might change how they deal with cryptocurrency. A new project is letting people invest in a luxury resort in the Maldives, and they can get their money back if they want to. Some people are taking their money out of Bitcoin investment funds, and this has been happening for five weeks in a row.",
    "articles": [
      {
        "title": "IoTeX confirms ‘suspicious activity’ involving token safe, says losses contained",
        "link": "https://cointelegraph.com/news/iotex-investigates-token-safe-suspicious-activity-4-3m-loss?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 21 Feb 2026 13:11:52 +0000",
        "source": "Cointelegraph.com News",
        "text": "Decentralized identity protocol IoTeX has confirmed that it is investigating unusual activity tied to one of its token safes after onchain analysts flagged a possible security incident.\n\nIn a Saturday post on X, the project said its team was “fully engaged, working around the clock to assess and contain the situation.” IoTeX added that early estimates indicate the potential loss is lower than circulating rumors and that it has coordinated with major exchanges and security partners to trace and freeze funds linked to the attacker.\n\n“The situation is under control. We will continue to monitor closely and provide timely updates to the community,” the project said.\n\nIoTeX’s native token (IOTX) dropped following the incident, with the price sliding more than 8% over 24 hours to around $0.0049, according to data from CoinMarketCap.\n\nRelated: CertiK links $63M in Tornado Cash deposits to $282M wallet compromise\n\nAnalyst says compromised key drained $4.3 million\n\nThe response came after onchain investigator Specter claimed a private key connected to the safe may have been compromised.\n\nThe onchain sleuth revealed that the wallet was drained of several tokens, including USDC (USDC), USDt (USDT), IoTeX (IOTX) and wrapped Bitcoin (WBTC), with losses estimated at roughly $4.3 million. The stolen funds were reportedly swapped into Ether (ETH), and about 45 ETH was bridged to Bitcoin.\n\nIoTeX wallet breach led to $4.3 million in losses. Source: Specter\n\nThe analyst also published addresses associated with the suspected attacker, alongside transaction records showing rapid movements through decentralized exchanges and token swaps. The activity suggested an attempt to convert assets quickly and move them across chains to complicate recovery efforts.\n\nRelated: SwapNet exploit drains up to $13.3M from Matcha Meta users\n\nMost crypto projects don’t recover from hacks\n\nAs Cointelegraph reported, nearly 80% of crypto projects hit by major hacks struggle to recover, largely due to mismanag"
      },
      {
        "title": "Bitcoin Sell Pressure Is Easing, But Whales Keep Dumping on Exchanges: CryptoQuant",
        "link": "https://decrypt.co/358782/bitcoin-sell-pressure-easing-whales-dumping-exchanges",
        "published": "Fri, 20 Feb 2026 20:41:31 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief Bitcoin deposits on exchanges have dropped from their daily peak of around 60,000 BTC on February 6.\n\nYet while sell pressure is easing, the biggest overall depositors are the largest holders, or whales.\n\nThe price of Bitcoin is down 46% since peaking above $126,000 last October.\n\nA major influx of Bitcoin deposits to centralized exchanges has slowed, reducing sell pressure on crypto’s top asset by market cap. But the largest investors, or whales, have kept their foot on the gas, according to a new report from CryptoQuant.\n\nThe Bitcoin deposited on exchanges had reached around 60,000 BTC on February 6 as the price of the coin slipped near $60,000. That number has since fallen to around 23,000 BTC on average over the last seven days, the blockchain analytics firm indicated.\n\n“This moderation suggests that the acute sell-off phase has eased, even as exchange flows remain elevated relative to prior months,” the report reads. “Lower exchange inflows put less selling pressure on prices.”\n\n<span data-mce-type=\"bookmark\" style=\"display:inline-block;width:0px;overflow:hidden;line-height:0\" class=\"mce_SELRES_start\">﻿</span>\n\nWhile the inflows are declining from their early-month levels, their makeup has shifted to favor large depositors. CryptoQuant’s “Exchange Whale Ratio,” which compares the top 10 inflows to the entire influx of deposits, has reached 0.64—its highest mark since 2015.\n\n“This indicates that 64% of all Bitcoin exchange inflows were made by the top 10 by volume, suggesting that large investors are selling,” the firm wrote.\n\nWhales lining up to sell the top asset was a key theme of 2025, in which an “unprecedented amount” of coins changed hands, CryptoQuant analyst J.A. Maartun told Decrypt in December.\n\n“I call this the 'great redistribution,' during which Bitcoin held by long-term holders has been transferred to new owners in several waves,” Maartun said at the time.\n\nBTC cl"
      },
      {
        "title": "What’s next for crypto in Europe after Christine Lagarde steps down?",
        "link": "https://cointelegraph.com/news/what-next-crypto-europe-ecb-christine-lagarde?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 21 Feb 2026 13:00:00 +0000",
        "source": "Cointelegraph.com News",
        "text": "European Central Bank (ECB) president Christine Lagarde is stepping down sometime before the French presidential election next year.\n\nUnder her leadership, the ECB has consulted on the Markets in Crypto Assets (MiCA) legislation that defined the crypto landscape in the European Union. The preeminent European bank also began work on the digital euro — the next iteration of the Eurozone’s currency.\n\nBut there is still work to be done on crypto policy in Europe. MiCA does not, in its current form, regulate decentralized finance (DeFi), and policymakers at the ECB are still deliberating over the digital euro’s final details.\n\nWhile the exact timing of Lagarde’s departure has not yet been determined, observers are already speculating about who will take her place and how it will affect crypto policy in Europe.\n\nLagarde was a crypto-skeptic, critical of stablecoins\n\nLike many central bankers, Lagarde has been cautious at best when it comes to cryptocurrencies. In 2022, she said regarding crypto, “My very humble assessment is that it is worth nothing.”\n\n“It is based on nothing ... There is no underlying asset to act as an anchor of safety.”\n\nShe said that crypto should be regulated, citing concern that investors did not understand the risks associated with crypto investing and would “lose it all.”\n\nThis set the tone for the ECB consultations on MiCA that would follow. The ECB itself does not create laws, but throughout the legislative process, the ECB advised, observed and offered comments, particularly over areas related to monetary policy and payments regulations.\n\nEven after MiCA was passed, Lagarde advocated for tight regulations on stablecoins and aligning international standards. In September 2025, she called on lawmakers in Europe to provide safeguards for stablecoins and equivalence for foreign stablecoin issuers to prevent the risk of stablecoin runs.\n\n“European legislation should ensure that such schemes cannot operate in the EU unless supported by robust equival"
      },
      {
        "title": "Trump-Backed World Liberty Plots 'Exit Mechanism' for Maldives Hotel Tokenization Project",
        "link": "https://decrypt.co/358781/trump-backed-world-liberty-exit-mechanism-maldives-hotel-tokenization",
        "published": "Fri, 20 Feb 2026 20:24:52 +0000",
        "source": "Decrypt",
        "text": "Add Decrypt as your preferred source to see more of our stories on Google.\n\nIn brief World Liberty Financial's tokenization project involves building a luxury Maldivian resort.\n\nAssociated tokens will have an exit mechanism for accredited investors.\n\nSome tokenized assets have historically lacked liquidity.\n\nHolding a digital asset for four years can feel like an eternity in the cryptosphere. So, how does a Trump-backed DeFi project convince investors to park their capital behind a luxury Maldivian resort that won't open its doors until 2030?\n\nThe answer, according to World Liberty Financial (WLFI) and Saudi real estate developer DarGlobal, is a specialized “exit mechanism” that’s designed to bridge the gap between meme coin attention spans and the slow-burn reality of international real estate.\n\nThe mechanism will be detailed in an upcoming prospectus for the Trump-backed crypto project, which entails building 100 beach and overwater villas within the archipelagic nation, DarGlobal CEO Ziad El Chaar told Decrypt, acknowledging that delays can happen.\n\nJUST IN - The Next Generation of RWAs 🦅🇺🇸 We are officially partnering with @Securitize and @dar_global to bring institutional-grade RWA offerings.\n\n(Availability limited to supported jurisdictions) The first asset on the list? Trump International Hotel & Resort, Maldives. 🇲🇻… pic.twitter.com/lSuN652g6U — WLFI (@worldlibertyfi) February 18, 2026\n\n“We've done a structure whereby if you're not happy where this is going, you can exit,” he said. “And at the same time, [...] you’re not standing there earning nothing.”\n\nBy tokenizing at the development level—rather than selling off pieces of a finished building—WLFI says it’s unlocking the high-margin \"development returns\" for commercial real estate projects that are usually eaten up by big banks.\n\nThe tokens are expected to provide investors with fixed yield and loan revenue streams that stem from the $300 million property, according to a press release. And in the future, "
      },
      {
        "title": "Spot Bitcoin ETFs record five weeks of net withdrawals, totaling $3.8B",
        "link": "https://cointelegraph.com/news/spot-bitcoin-etfs-five-weeks-net-outflows-3-8b?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "Sat, 21 Feb 2026 09:39:40 +0000",
        "source": "Cointelegraph.com News",
        "text": "US spot Bitcoin exchange-traded funds (ETFs) have posted five consecutive weeks of net outflows, with investors pulling roughly $3.8 billion from the products over the period.\n\nDuring last week, the funds recorded about $315.9 million in net outflows, according to data from SoSoValue. The biggest weekly withdrawal during this 5-week streak occurred in the week ending Jan. 30, when spot Bitcoin (BTC) ETFs recorded about $1.49 billion in net outflows.\n\nThe net weekly outflows come as some sessions posted inflows. On Friday, Bitcoin ETFs saw about $88 million in inflows, but they were outweighed by larger redemption days earlier in the week. Notable withdrawals included more than $410 million on Feb. 12, along with additional negative sessions from Feb. 17 through Feb. 19, leaving the weekly total firmly negative.\n\nSpot Bitcoin ETFs see outflows for five consecutive weeks. Source: SoSoValue\n\nAs of Friday, spot Bitcoin ETFs have accumulated roughly $54.01 billion in net inflows since launch. Total net assets stood near $85.31 billion, representing approximately 6.3% of Bitcoin’s overall market capitalization.\n\nRelated: Bitcoin ETFs shed $166M as BTC heads for worst start in years\n\nInstitutional de-risking drives Bitcoin ETF outflows\n\nRecent withdrawals from spot Bitcoin ETFs appear tied to institutional positioning rather than a loss of long-term interest in the asset, according to Vincent Liu, chief investment officer at Kronos Research. He said the outflows reflect portfolio de-risking as geopolitical tensions and broader macro uncertainty rise.\n\nLiu added that flows may remain unstable in the near term. Escalating trade disputes and tariff developments have reinforced a risk-off environment across markets, leaving digital assets sensitive to macro headlines.\n\n“Market inflows will be dependent on macro events like incoming Thursday’s initial jobless claims, as weaker data could revive expectations for future rate cuts and help support sentiment currently at 14 extreme"
      }
    ]
  },
  "_meta": {
    "generated_at": "2026-02-21T13:43:30.800350+00:00"
  }
}